{"8fit2018-07-01":"En juillet 2018, le service de santé et de remise en forme <a href=\"https://8fit.zendesk.com/hc/en-us/articles/360017746394-Notice\" target=\"_blank\" rel=\"noopener\">8fit a subi une violation de données</a> . Les données sont ensuite apparues à la vente sur un marché du Web sombre en février 2019 et comprenaient plus de 15 millions d&#39;adresses e-mail uniques ainsi que les noms, les sexes, les adresses IP et les mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","8tracks2017-06-27":"En juin 2017, le service de playlists en ligne connu sous le nom de <a href=\"https://blog.8tracks.com/2017/06/27/password-security-alert/\" target=\"_blank\" rel=\"noopener\">8Tracks a subi une violation de données</a> qui a touché 18 millions de comptes. Dans leur divulgation, 8Tracks a indiqué que &quot;le vecteur de l&#39;attaque était le compte GitHub d&#39;un employé, qui n&#39;était pas sécurisé à l&#39;aide d&#39;une authentification à deux facteurs&quot;. Des hachages de mot de passe SHA-1 salés pour les utilisateurs qui <em>ne se sont pas</em> inscrits avec l&#39;authentification Google ou Facebook ont également été inclus. Les données ont été fournies à HIBP par le chercheur en sécurité Whitehat et analyste de données Adam Davies et contenaient près de 8 millions d&#39;adresses e-mail uniques. L&#39;ensemble complet d&#39;enregistrements de 18 millions a ensuite été fourni par JimScott.Sec@protonmail.com et mis à jour dans HIBP en conséquence.","Abandonia2015-11-01":"En novembre 2015, le site de jeux dédié aux jeux DOS classiques <a href=\"http://www.abandonia.com\" target=\"_blank\" rel=\"noopener\">Abandonia a</a> subi une violation de données entraînant l&#39;exposition de 776 000 enregistrements d&#39;utilisateurs uniques. Les données contenaient des adresses e-mail et IP, des noms d&#39;utilisateur et des hachages MD5 de mots de passe salés.","AbuseWithUs2016-07-01":"En 2016, le site dédié à aider les gens à pirater des comptes de messagerie électronique et de jeux en ligne connu sous le nom d&#39;Abusewith.us a subi de multiples violations de données. Le site <a href=\"https://krebsonsecurity.com/2017/02/who-ran-leakedsource-com/\" target=\"_blank\" rel=\"noopener\">aurait eu un administrateur en commun avec l&#39;infâme site LeakedSource</a> , tous deux fermés depuis. Les données exposées comprenaient plus de 1,3 million d&#39;adresses e-mail uniques, souvent accompagnées de noms d&#39;utilisateur, d&#39;adresses IP et de mots de passe en texte brut ou hachés récupérés à partir de diverses sources et destinés à être utilisés pour compromettre les comptes des victimes.","AcneOrg2014-11-25":"En novembre 2014, le site Web d&#39;acné <a href=\"http://www.acne.org/\" target=\"_blank\" rel=\"noopener\">acne.org a</a> subi une violation de données qui a exposé plus de 430 000 comptes de membres du forum. Les données étaient activement échangées sur des forums clandestins et comprenaient des adresses e-mail, des dates de naissance et des mots de passe.","Adapt2018-11-05":"En novembre 2018, le <a href=\"https://blog.hackenproof.com/industry-news/another-decision-makers-database-leaked/\" target=\"_blank\" rel=\"noopener\">chercheur en sécurité Bob Diachenko a identifié une base de données non protégée hébergée par l&#39;agrégateur de données &quot;Adapt&quot;</a> . Un fournisseur de « contacts de qualité fraîche », le service a exposé plus de 9,3 millions d&#39;enregistrements uniques d&#39;individus et d&#39;informations sur l&#39;employeur, y compris leurs noms, employeurs, intitulés de poste, coordonnées et données relatives à l&#39;employeur, y compris la description de l&#39;organisation, la taille et les revenus. Aucune réponse n&#39;a été reçue d&#39;Adapt lorsqu&#39;il a été contacté.","Adobe2013-10-04":"En octobre 2013, 153 millions de comptes Adobe ont été violés, chacun contenant un identifiant interne, un nom d&#39;utilisateur, une adresse e-mail, <em>un</em> mot de passe crypté et un indice de mot de passe en texte brut. La cryptographie des mots de passe était mal faite et <a href=\"http://stricture-group.com/files/adobe-top100.txt\" target=\"_blank\" rel=\"noopener\">nombre d&#39;entre eux ont été rapidement résolus en texte brut</a> . Les indices non cryptés ont également <a href=\"http://www.troyhunt.com/2013/11/adobe-credentials-and-serious.html\" target=\"_blank\" rel=\"noopener\">révélé beaucoup de choses sur les mots de passe,</a> ajoutant encore au risque auquel des centaines de millions de clients Adobe étaient déjà confrontés.","AerServ2018-04-01":"En avril 2018, la plateforme de gestion des publicités connue sous le nom d&#39; <a href=\"https://www.aerserv.com/\" target=\"_blank\" rel=\"noopener\">AerServ a</a> subi une violation de données. Acquise par InMobi plus tôt dans l&#39;année, la violation d&#39;AerServ a touché plus de 66 000 adresses e-mail uniques et comprenait également des informations de contact et des mots de passe stockés sous forme de hachage SHA-512 salé. Les données ont été publiées sur Twitter plus tard en 2018, après quoi InMobi a été informé et informé qu&#39;ils étaient au courant de l&#39;incident.","AhaShare2013-05-30":"En mai 2013, le site torrent <a href=\"http://www.ahashare.com\">AhaShare.com a</a> subi une violation qui a entraîné la publication publique de plus de 180 000 comptes d&#39;utilisateurs. La violation incluait une série d&#39;informations personnelles sur les utilisateurs enregistrés et, malgré les affirmations de ne pas diffuser d&#39;informations personnellement identifiables, le site a également divulgué les adresses IP utilisées par les identités enregistrées.","Aipai2016-09-27":"En septembre 2016, des données prétendument obtenues sur le site Web de jeux chinois connu sous le nom d&#39; <a href=\"http://aipai.com\" target=\"_blank\" rel=\"noopener\">Aipai.com</a> et contenant 6,5 millions de comptes ont été divulguées en ligne. Bien qu&#39;il existe des preuves que les données sont légitimes, en raison de la difficulté de vérifier catégoriquement la violation chinoise, elles ont été signalées comme « non vérifiées ». Les données de la violation contiennent des adresses e-mail et des hachages de mot de passe MD5. <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>","AKP2016-07-19":"En juillet 2016, un pirate informatique connu sous le nom de Phineas Fisher a <a href=\"https://motherboard.vice.com/en_us/article/yp3n55/phineas-fisher-turkish-government-hack\" target=\"_blank\" rel=\"noopener\">piraté le parti au pouvoir en Turquie (Parti de la justice et du développement ou « AKP ») et a eu accès à 300 000 e-mails</a> . Le contenu complet des e-mails a ensuite été <a href=\"https://wikileaks.org/akp-emails/\" target=\"_blank\" rel=\"noopener\">publié par WikiLeaks et rendu consultable</a> . HIBP a identifié plus de 917 000 modèles d&#39;adresses e-mail uniques dans l&#39;ensemble de données, y compris les ID de message et un certain nombre d&#39;autres adresses non-utilisateur.","AndroidForums2011-10-30":"En octobre 2011, le site Web des forums Android a <a href=\"http://www.pcworld.com/article/259201/online_android_forum_hacked_user_data_accessed.html\" target=\"_blank\" rel=\"noopener\">été piraté</a> et 745 000 comptes d&#39;utilisateurs ont ensuite été divulgués publiquement. Les données compromises comprenaient les adresses e-mail, les dates de naissance des utilisateurs et les mots de passe stockés sous forme de hachage MD5 salé.","AnimalJam2020-10-12":"En octobre 2020, le jeu en ligne pour enfants <a href=\"https://www.animaljam.com/en/2020databreach\" target=\"_blank\" rel=\"noopener\">Animal Jam a subi une violation de données</a> qui a ensuite été partagée par les communautés de piratage en ligne le mois suivant. Les données contenaient 46 millions de comptes d&#39;utilisateurs avec plus de 7 millions d&#39;adresses e-mail uniques. Les données concernées comprenaient également les noms d&#39;utilisateur, les adresses IP et pour certains enregistrements, les dates de naissance (parfois sous forme partielle), les adresses physiques, les noms des parents et les mots de passe stockés sous forme de hachages PBKDF2.","AnimeGame2020-02-27":"En février 2020, le site de jeux <a href=\"http://animegame.me/\" target=\"_blank\" rel=\"noopener\">AnimeGame a</a> subi une violation de données. L&#39;incident a affecté 1,4 million d&#39;abonnés et a exposé des adresses e-mail, des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachages MD5 salés. Les données ont ensuite été partagées sur un forum de piratage populaire et ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","AnimePlanet2016-01-01":"Vers 2016, le site Web d&#39;anime <a href=\"https://www.anime-planet.com/\" target=\"_blank\" rel=\"noopener\">Anime-Planet a</a> subi une violation de données qui a touché 369 000 abonnés. Les données exposées comprenaient les noms d&#39;utilisateur, les adresses IP et e-mail, les dates de naissance et les mots de passe stockés sous forme de hachages MD5 non salés et pour les comptes plus récents, de hachages bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Animoto2018-07-10":"En juillet 2018, le service de <a href=\"https://techcrunch.com/2018/08/20/animoto-hack-exposes-personal-information-geolocation-data/\" target=\"_blank\" rel=\"noopener\">création de vidéos basé sur le cloud Animoto a subi une violation de données</a> . La violation a exposé 22 millions d&#39;adresses e-mail uniques ainsi que les noms, les dates de naissance, le pays d&#39;origine et les hachages de mots de passe salés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","AntiPublic2016-12-16":"En décembre 2016, une énorme liste de paires d&#39;adresses e-mail et de mots de passe est apparue dans une &quot;liste combo&quot; appelée &quot;Anti Public&quot;. La liste contenait 458 millions d&#39;adresses e-mail uniques, dont beaucoup avec plusieurs mots de passe différents piratés à partir de divers systèmes en ligne. La liste a été largement diffusée et utilisée pour le « bourrage d&#39;informations d&#39;identification », c&#39;est-à-dire que les attaquants l&#39;utilisent pour tenter d&#39;identifier d&#39;autres systèmes en ligne où le propriétaire du compte avait réutilisé son mot de passe. Pour des informations détaillées sur cet incident, lisez <a href=\"https://www.troyhunt.com/password-reuse-credential-stuffing-and-another-1-billion-records-in-have-i-been-pwned\" target=\"_blank\" rel=\"noopener\">Réutilisation des mots de passe, bourrage d&#39;informations d&#39;identification et un autre milliard d&#39;enregistrements dans Have I Been Pwned</a> .","Apollo2018-07-23":"En juillet 2018, la startup d&#39;engagement commercial <a href=\"https://www.wired.com/story/apollo-breach-linkedin-salesforce-data/\" target=\"_blank\" rel=\"noopener\">Apollo a laissé une base de données contenant des milliards de points de données exposés publiquement sans mot de passe</a> . Les données ont été découvertes par le chercheur en sécurité <a href=\"http://www.vinnytroia.com/\" target=\"_blank\" rel=\"noopener\">Vinny Troia</a> qui a ensuite envoyé un sous-ensemble des données contenant 126 millions d&#39;adresses e-mail uniques à Have I Been Pwned. Les données laissées exposées par Apollo ont été utilisées dans leur &quot;plate-forme d&#39;accélération des revenus&quot; et comprenaient des informations personnelles telles que des noms et des adresses e-mail ainsi que des informations professionnelles, y compris les lieux de travail, les rôles que les gens occupent et où ils se trouvent. Apollo a souligné que les données exposées n&#39;incluaient pas d&#39;informations sensibles telles que des mots de passe, des numéros de sécurité sociale ou des données financières. <a href=\"https://www.apollo.io/contact\" target=\"_blank\" rel=\"noopener\">Le site Web d&#39;Apollo propose un formulaire de contact</a> pour ceux qui souhaitent entrer en contact avec l&#39;organisation.","Appartoo2017-03-25":"En mars 2017, le site de <a href=\"https://www.appartoo.com\" target=\"_blank\" rel=\"noopener\">colocation français Appartoo a</a> subi une violation de données. L&#39;incident a exposé une grande quantité d&#39;informations personnelles sur près de 50 000 membres, notamment des adresses e-mail, des sexes, des âges, des messages privés envoyés entre les utilisateurs du service et des mots de passe stockés sous forme de hachage SHA-256. Appartoo a indiqué que tous les abonnés ont été informés de l&#39;incident au début de 2017.","Appen2020-06-22":"En juin 2020, la société de données de formation à l&#39;IA <a href=\"https://www.bleepingcomputer.com/news/security/hacker-leaks-386-million-user-records-from-18-companies-for-free/\" target=\"_blank\" rel=\"noopener\">Appen a subi une violation de données</a> exposant les détails de près de 5,9 millions d&#39;utilisateurs qui ont ensuite été vendus en ligne. La violation comprenait des noms, des adresses e-mail et des mots de passe stockés sous forme de hachage bcrypt. Certains dossiers contenaient également des numéros de téléphone, des employeurs et des adresses IP. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Aptoide2020-04-13":"En avril 2020, la boutique d&#39;applications Android indépendante <a href=\"https://blog.aptoide.com/aptoide-credentials-information/\" target=\"_blank\" rel=\"noopener\">Aptoide a subi une violation de données</a> . L&#39;incident a entraîné l&#39;exposition de 20 millions de dossiers de clients qui ont ensuite été partagés en ligne via un forum de piratage populaire. Les données concernées comprenaient les adresses e-mail et IP, les noms, les adresses IP et les mots de passe stockés sous forme de hachage SHA-1 sans sel.","ArmorGames2019-01-01":"En janvier 2019, le site portail de jeux <a href=\"https://techraptor.net/content/armor-games-data-breach-january-2019\" target=\"_blank\" rel=\"noopener\">Armor Games a subi une violation de données</a> . Au total, 10,6 millions d&#39;adresses e-mail ont été affectées par la violation qui a également exposé les noms d&#39;utilisateur, les adresses IP, les anniversaires des comptes d&#39;administrateur et les mots de passe stockés sous forme de hachage SHA-1 salé. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","ArmyForceOnline2016-05-18":"En mai 2016, le site de jeux en ligne <a href=\"http://armyforceonline.com\" target=\"_blank\" rel=\"noopener\">Army Force Online a</a> subi une violation de données qui a exposé 1,5 million de comptes. Les données violées ont été trouvées régulièrement échangées en ligne et comprenaient des noms d&#39;utilisateur, des adresses e-mail et IP et des mots de passe MD5.","Artsy2018-04-01":"En avril 2018, la base de données d&#39;art en ligne <a href=\"https://www.theregister.co.uk/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">Artsy a subi une violation de données qui est par conséquent apparue à la vente sur une place de marché du dark web</a> . Plus d&#39;un million de comptes ont été touchés et comprenaient des adresses IP et e-mail, des noms et des mots de passe stockés sous forme de hachage SHA-512 salé. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;nano@databases.pw&quot;.","Audi2019-08-14":"En août 2019, <a href=\"https://techcrunch.com/2021/06/11/volkswagen-says-a-vendors-security-lapse-exposed-3-3-million-drivers-details/\" target=\"_blank\" rel=\"noopener\">Audi USA a subi une violation de données après qu&#39;un fournisseur a laissé des données non sécurisées et exposées sur Internet</a> . Les données contenaient 2,7 millions d&#39;adresses e-mail uniques ainsi que des noms, des numéros de téléphone, des adresses physiques et des informations sur le véhicule, y compris le VIN. Dans <a href=\"https://techcrunch.com/2021/06/11/volkswagen-says-a-vendors-security-lapse-exposed-3-3-million-drivers-details/\" target=\"_blank\" rel=\"noopener\">une déclaration de divulgation d&#39;Audi</a> , ils ont également informé que certains clients avaient des permis de conduire, des dates de naissance, des numéros de sécurité sociale et d&#39;autres informations personnelles.","Autocentrum2018-02-04":"En février 2018, des <a href=\"https://niebezpiecznik.pl/post/wyciek-hasel-144-000-uzytkownikow-autocentrum-pl/\" target=\"_blank\" rel=\"noopener\">données appartenant au site Web automobile polonais autocentrum.pl ont été trouvées en ligne</a> . Les données contenaient 144 000 adresses e-mail et mots de passe en texte brut.","Avast2014-05-26":"En mai 2014, <a href=\"https://www.grahamcluley.com/2014/05/avast-forum-hacked/\" target=\"_blank\" rel=\"noopener\">le forum antivirus d&#39;Avast a été piraté</a> et 423 000 enregistrements de membres ont été exposés. Le forum Simple Machines Based comprenait des noms d&#39;utilisateur, des e-mails et des hachages de mot de passe.","BabyNames2008-10-24":"Vers 2008, le site destiné à aider les parents à nommer leurs enfants, connu sous le nom de <a href=\"https://www.babynames.com/\" target=\"_blank\" rel=\"noopener\">Baby Names, a</a> subi une violation de données. L&#39;incident a révélé 846 000 adresses e-mail et mots de passe stockés sous forme de hachages MD5 salés. Lorsqu&#39;il a été contacté en octobre 2018, Baby Names a indiqué que &quot;la violation s&#39;est produite il y a au moins dix ans&quot; et que les membres ont été informés à l&#39;époque.","BannerBit2018-12-29":"Vers décembre 2018, la plate-forme publicitaire en ligne <a href=\"https://bannerbit.com/\" target=\"_blank\" rel=\"noopener\">BannerBit a</a> subi une violation de données. Contenant 213 000 adresses e-mail uniques et mots de passe en texte brut, les données ont été fournies à HIBP par un tiers. Plusieurs tentatives ont été faites pour contacter BannerBit, mais aucune réponse n&#39;a été reçue.","Bell20172017-05-15":"En mai 2017, <a href=\"http://www.cbc.ca/beta/news/technology/bell-data-breach-customer-names-phone-numbers-emails-leak-1.4116608\" target=\"_blank\" rel=\"noopener\">la société de télécommunications Bell au Canada a subi une violation de données</a> entraînant l&#39;exposition de millions de dossiers de clients. Les données ont par conséquent été divulguées en ligne avec un message de l&#39;attaquant déclarant qu&#39;ils &quot;publiaient une partie importante des données de Bell.ca en raison du fait qu&#39;ils n&#39;avaient pas coopéré avec nous&quot; et incluaient une menace de fuite supplémentaire. Les données concernées comprenaient plus de 2 millions d&#39;adresses e-mail uniques et 153 000 résultats d&#39;enquêtes remontant à 2011 et 2012. Il y avait également 162 dossiers d&#39;employés de Bell contenant des données personnelles plus complètes, notamment des noms, des numéros de téléphone et des « codes d&#39;accès » en texte brut. Bell a subi une autre violation en 2014 qui a exposé 40 000 enregistrements.","bigbasket2020-10-14":"En octobre 2020, la plate-forme d&#39;épicerie indienne <a href=\"https://indianexpress.com/article/business/business-others/bigbasket-data-breach-user-details-leaked-dark-web-cyber-crime-7009578/\" target=\"_blank\" rel=\"noopener\">bigbasket a subi une violation de données qui a exposé plus de 20 millions de dossiers de clients</a> . Les données ont été initialement vendues avant d&#39;être divulguées publiquement en avril de l&#39;année suivante et comprenaient des adresses e-mail, IP et physiques, des noms, des numéros de téléphone, des mots de passe de date de naissance stockés sous forme de hachage Django (SHA-1).","BinWeevils2014-09-01":"En septembre 2014, le jeu en ligne <a href=\"http://blog.binweevils.com/2014/09/important-security-update/\" target=\"_blank\" rel=\"noopener\">Bin Weevils a subi une violation de données</a> . Alors qu&#39;il déclarait à l&#39;origine que seuls les noms d&#39;utilisateur et les mots de passe avaient été exposés, <a href=\"https://www.databreaches.net/data-from-2014-hack-of-childrens-online-game-bin-weevils-leaked-online-hacker-claims-20m-records/\" target=\"_blank\" rel=\"noopener\">un article ultérieur sur DataBreaches.net indiquait qu&#39;un ensemble plus étendu d&#39;attributs personnels avait été affecté</a> (les commentaires suggèrent également que les données peuvent provenir d&#39;une violation ultérieure). Les données correspondant à ce modèle ont ensuite été fournies à Have I Been Pwned par <a href=\"https://twitter.com/akshayindia6\" target=\"_blank\" rel=\"noopener\">@akshayindia6</a> et comprenaient près de 1,3 million d&#39;adresses e-mail uniques, de sexe, d&#39;âge et de mots de passe en texte brut.","BitcoinTalk2015-05-22":"En mai 2015, le forum <a href=\"https://www.cryptocoinsnews.com/bitcoin-exchange-btc-e-bitcointalk-forum-breaches-details-revealed/\" target=\"_blank\" rel=\"noopener\">Bitcoin Bitcoin Talk a été piraté</a> et plus de 500 000 adresses e-mail uniques ont été exposées. L&#39;attaque a conduit à l&#39;exposition d&#39;une série de données personnelles, notamment des noms d&#39;utilisateur, des adresses e-mail et IP, des sexes, des dates de naissance, des questions de sécurité et des hachages MD5 de leurs réponses, ainsi que des hachages des mots de passe eux-mêmes.","Bitly2014-05-08":"En mai 2014, la société de gestion de liens <a href=\"https://bitly.com/blog/urgent-security-update-regarding-your-bitly-account/\" target=\"_blank\" rel=\"noopener\">Bitly a annoncé avoir subi une violation de données</a> . La violation contenait plus de 9,3 millions d&#39;adresses e-mail uniques, de noms d&#39;utilisateur et de mots de passe hachés, la plupart utilisant SHA1 avec un petit nombre utilisant bcrypt.","BlackHatWorld2014-06-23":"En juin 2014, le forum d&#39;optimisation des moteurs de recherche <a href=\"http://www.blackhatworld.com\" target=\"_blank\" rel=\"noopener\">Black Hat World a</a> vu trois quarts de million de comptes piratés dans son système. La violation comprenait divers attributs personnellement identifiables qui ont été rendus publics dans un script de base de données MySQL.","BlackSpigotMC2019-07-14":"En juillet 2019, le site de piratage <a href=\"https://blackspigot.com/\" target=\"_blank\" rel=\"noopener\">BlackSpigotMC a subi une violation de données</a> . Le site basé sur le forum XenForo aurait été compromis par un site Web de piratage rival et aurait entraîné la fuite de 8,5 Go de données, y compris la base de données et le site Web lui-même. Les données exposées comprenaient 140 000 adresses e-mail uniques, noms d&#39;utilisateur, adresses IP, sexes, emplacements géographiques et mots de passe stockés sous forme de hachages bcrypt.","BlankMediaGames2018-12-28":"En décembre 2018, le site Web de la ville de Salem produit par <a href=\"https://blog.dehashed.com/town-of-salem-blankmediagames-hacked/\" target=\"_blank\" rel=\"noopener\">BlankMediaGames a subi une violation de données</a> . Rapportées à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">DeHashed</a> , les données contenaient 7,6 millions d&#39;adresses e-mail d&#39;utilisateurs uniques, ainsi que des noms d&#39;utilisateur, des adresses IP, des historiques d&#39;achat et des mots de passe stockés sous forme de hachages phpass. DeHashed a tenté à plusieurs reprises de contacter BlankMediaGames sur différents canaux et plusieurs jours, mais n&#39;avait pas encore reçu de réponse au moment de la publication.","Bolt2017-03-01":"Vers mars 2017, le site Web de partage de fichiers <a href=\"http://bolt.cd/\" target=\"_blank\" rel=\"noopener\">Bolt a</a> subi une violation de données entraînant l&#39;exposition de 995 000 enregistrements d&#39;utilisateurs uniques. Les données provenaient de leur forum vBulletin et contenaient des adresses e-mail et IP, des noms d&#39;utilisateur et des hachages de mot de passe MD5 salés. Le site a déjà été signalé comme compromis dans le répertoire de la base de données violée <a href=\"https://vigilante.pw/\" target=\"_blank\" rel=\"noopener\">Vigilante.pw.</a>","BombujEu2018-12-07":"En décembre 2018, le site Web slovaque de visionnage de films en ligne gratuitement <a href=\"https://www.bombuj.eu\" target=\"_blank\" rel=\"noopener\">Bombuj.eu a</a> subi une violation de données. L&#39;incident a révélé plus de 575 000 adresses e-mail et mots de passe uniques stockés sous forme de hachages MD5 non salés. Aucune réponse n&#39;a été reçue de Bombuj.eu lorsqu&#39;il a été contacté au sujet de l&#39;incident.","Bonobos2020-08-14":"En août 2020, le magasin de vêtements <a href=\"https://www.bleepingcomputer.com/news/security/bonobos-clothing-store-suffers-a-data-breach-hacker-leaks-70gb-database/\" target=\"_blank\" rel=\"noopener\">Bonobos a subi une violation de données</a> qui a exposé près de 70 Go de données contenant 2,8 millions d&#39;adresses e-mail uniques. La violation a également exposé des noms, des adresses physiques et IP, des numéros de téléphone, des historiques de commandes et des mots de passe stockés sous forme de hachages SHA-512 salés, y compris des mots de passe historiques. La violation a également exposé des données partielles de carte de crédit, notamment le type de carte, le nom sur la carte, la date d&#39;expiration et les 4 derniers chiffres de la carte. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Bookmate2018-07-08":"À la mi-2018, le service d&#39;abonnement aux <a href=\"https://www.theregister.co.uk/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">ebooks sociaux Bookmate faisait partie d&#39;une série de sites qui ont été violés et leurs données ont ensuite été vendues début 2019</a> . Les données comprenaient près de 4 millions d&#39;adresses e-mail uniques ainsi que les noms, les sexes, les dates de naissance et les mots de passe stockés sous forme de hachage SHA-512 salé. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;BenjaminBlue@exploit.im&quot;.","BTCE2014-10-01":"En octobre 2014, <a href=\"https://www.databreaches.net/bitcoin-exchange-btc-e-and-bitcointalk-forum-breaches/\" target=\"_blank\" rel=\"noopener\">l&#39;échange Bitcoin BTC-E a été piraté</a> et 568 000 comptes ont été exposés. Les données comprenaient les adresses e-mail et IP, les soldes de portefeuille et les mots de passe hachés.","BtoBet2019-12-26":"En décembre 2019, <a href=\"https://www.troyhunt.com/the-difficulty-of-disclosure-surebet247-and-the-streisand-effect/\" target=\"_blank\" rel=\"noopener\">une grande collection de données de la société de jeux d&#39;argent nigériane Surebet247 a été envoyée à HIBP</a> . Parallèlement au Surebet247, des sauvegardes de bases de données des sites de jeux d&#39;argent BetAlfa, BetWay, BongoBongo et TopBet ont également été incluses. Une enquête plus approfondie a <a href=\"https://www.iafrikan.com/2020/01/09/btobet-sports-betting-technology-software-neuron-platform-surebet247-gambling-data-security-breach/\" target=\"_blank\" rel=\"noopener\">impliqué le fournisseur de plate-forme de paris BtoBet comme étant la source commune des données</a> . Les données concernées comprenaient les dossiers des utilisateurs et des informations détaillées sur les antécédents de jeu.","Bukalapak2017-10-23":"En mars 2019, le site de commerce électronique indonésien <a href=\"https://www.bukalapak.com/blog/feature-updates/petunjuk-teknis-105502\" target=\"_blank\" rel=\"noopener\">Bukalapak a découvert une violation de données des sauvegardes de l&#39;organisation remontant à octobre 2017</a> . L&#39;incident a révélé environ 13 millions d&#39;adresses e-mail uniques ainsi que des adresses IP, des noms et des mots de passe stockés sous forme de hachages SHA-512 bcrypt et salés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à « Maxime Thalet ».","BulgarianNationalRevenueAgency2019-07-15":"En juillet 2019, <a href=\"https://thenextweb.com/security/2019/07/16/bulgaria-tax-agency-data-leak-hack/\" target=\"_blank\" rel=\"noopener\">une violation massive des données de l&#39;Agence nationale du revenu bulgare a commencé à circuler avec des données sur 5 millions de personnes</a> . Prétendument obtenues en juin, les données ont été largement partagées en ligne et comprenaient des informations fiscales ainsi que des noms, des numéros de téléphone, des adresses physiques et 471 000 adresses e-mail uniques. La violation aurait touché &quot;presque tous les adultes en Bulgarie&quot;.","CafeMom2014-04-10":"En 2014, le réseau social pour les mères <a href=\"http://www.cafemom.com\" target=\"_blank\" rel=\"noopener\">CafeMom a</a> subi une violation de données. Les données ont fait surface aux côtés d&#39;un certain nombre d&#39;autres violations historiques, notamment Kickstarter, Bitly et Disqus, et contenaient 2,6 millions d&#39;adresses e-mail et de mots de passe en texte brut.","CafePress2019-02-20":"En février 2019, le détaillant de marchandises personnalisées <a href=\"https://www.cafepress.com/\" target=\"_blank\" rel=\"noopener\">CafePress a</a> subi une violation de données. Les données exposées comprenaient 23 millions d&#39;adresses e-mail uniques avec certains enregistrements contenant également des noms, des adresses physiques, des numéros de téléphone et des mots de passe stockés sous forme de hachage SHA-1. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","CannabisForum2014-02-05":"En février 2014, le forum vBulletin du site de marijuana cannabis.com a été violé et <a href=\"https://www.google.com/search?q=%22cannabisforum.tar%22\" target=\"_blank\" rel=\"noopener\">divulgué publiquement</a> . Bien qu&#39;il n&#39;y ait eu aucune attribution publique de la violation, les données divulguées comprenaient plus de 227 000 comptes et près de 10 000 messages privés entre les utilisateurs du forum.","Canva2019-05-24":"En mai 2019, le site Web de l&#39;outil de conception graphique <a href=\"https://support.canva.com/contact/customer-support/may-24-security-incident-faqs/\" target=\"_blank\" rel=\"noopener\">Canva a subi une violation de données</a> qui a touché 137 millions d&#39;abonnés. Les données exposées comprenaient des adresses e-mail, des noms d&#39;utilisateur, des noms, des villes de résidence et des mots de passe stockés sous forme de hachages bcrypt pour les utilisateurs n&#39;utilisant pas de connexions sociales. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","CashCrate2016-11-17":"En juin 2017, la nouvelle a <a href=\"https://motherboard.vice.com/en_us/article/bj8pvq/hackers-steal-6-million-user-accounts-for-cash-for-surveys-site\" target=\"_blank\" rel=\"noopener\">annoncé que CashCrate avait subi une violation de données exposant 6,8 millions d&#39;enregistrements</a> . La violation du site d&#39;argent pour les sondages remontait à novembre 2016 et les noms, adresses physiques, adresses e-mail et mots de passe exposés étaient stockés en texte clair pour les anciens comptes, ainsi que des hachages MD5 faibles pour les plus récents.","CDProjektRed2016-03-01":"En mars 2016, <a href=\"http://forums.cdprojektred.com/forum/en/the-witcher-series/news-aa/7248610-important-potential-unauthorized-access-to-the-forums%E2%80%99-data\" target=\"_blank\" rel=\"noopener\">le développeur de jeux polonais CD Projekt RED a subi une violation de données</a> . Le piratage de leur forum a conduit à l&#39;exposition de près de 1,9 million de comptes ainsi que des noms d&#39;utilisateur, des adresses e-mail et des mots de passe SHA1 salés.","Chatbooks2020-03-26":"En mars 2020, le service d&#39;impression photo <a href=\"https://www.bleepingcomputer.com/news/security/chatbooks-discloses-data-breach-after-data-sold-on-dark-web/\" target=\"_blank\" rel=\"noopener\">Chatbooks a subi une violation de données</a> qui a ensuite été mise en vente sur un marché du dark web. La violation contenait 15 millions d&#39;enregistrements d&#39;utilisateurs avec 2,5 millions d&#39;adresses e-mail uniques, ainsi que des noms, des numéros de téléphone, des profils de réseaux sociaux et des hachages de mots de passe SHA-512 salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","CheapAssGamer2015-07-01":"Vers la mi-2015, le forum de <a href=\"https://www.cheapassgamer.com\" target=\"_blank\" rel=\"noopener\">CheapAssGamer.com a</a> subi une violation de données. La base de données du forum basé sur IP.Board contenait 445 000 comptes, y compris les noms d&#39;utilisateur, les adresses e-mail et IP et les hachages de mot de passe MD5 salés.","Chegg2018-04-28":"En avril 2018, le service de location de manuels scolaires <a href=\"https://techcrunch.com/2018/09/26/chegg-resets-40-million-user-passwords-after-data-breach/\" target=\"_blank\" rel=\"noopener\">Chegg a subi une violation de données</a> qui a touché 40 millions d&#39;abonnés. Les données exposées comprenaient des adresses e-mail, des noms d&#39;utilisateur, des noms et des mots de passe stockés sous forme de hachages MD5 non salés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","Cit0day2020-11-04":"En novembre 2020, <a href=\"https://www.troyhunt.com/inside-the-cit0day-breach-collection\" target=\"_blank\" rel=\"noopener\">une collection de plus de 23 000 sites Web prétendument violés, connue sous le nom de Cit0day, a été mise à disposition en téléchargement sur plusieurs forums de piratage</a> . Les données se composaient de 226 millions d&#39;adresses e-mail uniques ainsi que de paires de mots de passe, souvent représentées à la fois par des hachages de mots de passe et des versions en texte brut craquées. Une vérification indépendante des données a établi qu&#39;elle contient de nombreuses violations légitimes, non divulguées auparavant. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","CivilOnline2011-07-10":"À la mi-2011, des données auraient été obtenues à partir du site Web d&#39;ingénierie chinois connu sous le nom de <a href=\"http://www.co188.com/\" target=\"_blank\" rel=\"noopener\">Civil Online</a> et contenaient 7,8 millions de comptes. Bien qu&#39;il existe des preuves que les données sont légitimes, en raison de la difficulté de vérifier catégoriquement la violation chinoise, elles ont été signalées comme « non vérifiées ». Les données de la violation contiennent des adresses e-mail et IP, des noms d&#39;utilisateur et des hachages de mot de passe MD5. <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>","ClearVoiceSurveys2015-08-23":"En avril 2021, la société d&#39;études de marché <a href=\"https://www.clearvoicesurveys.com/\" target=\"_blank\" rel=\"noopener\">ClearVoice Surveys</a> avait une sauvegarde de base de données publique de 2015 prise et redistribuée sur un forum de piratage populaire. Les données comprenaient 15 millions d&#39;adresses e-mail uniques sur plus de 17 millions de lignes de données qui comprenaient également des noms, des adresses physiques et IP, des sexes, des dates de naissance et des mots de passe en texte brut. ClearVoice Surveys a indiqué qu&#39;elle était au courant de la violation et a confirmé son authenticité.","ClixSense2016-09-04":"En septembre 2016, le site payant au clic <a href=\"http://cybercashworldwide.com/clixsense-has-been-hacked\" target=\"_blank\" rel=\"noopener\">ClixSense a subi une violation de données</a> qui a exposé 2,4 millions d&#39;identités d&#39;abonnés. Les données violées ont ensuite été mises en ligne par les attaquants qui ont affirmé qu&#39;il s&#39;agissait d&#39;un sous-ensemble d&#39;une violation de données plus importante totalisant 6,6 millions d&#39;enregistrements. Les données divulguées étaient nombreuses et comprenaient des noms, des adresses physiques, électroniques et IP, des sexes et des dates de naissance, des soldes de comptes et des mots de passe stockés sous forme de texte brut.","CloudPets2017-01-01":"En janvier, le fabricant d&#39;ours en peluche qui enregistre les voix des enfants et les envoie à la famille et aux amis via Internet <a href=\"https://www.troyhunt.com/data-from-connected-cloudpets-teddy-bears-leaked-and-ransomed-exposing-kids-voice-messages\" target=\"_blank\" rel=\"noopener\">CloudPets a laissé sa base de données publiquement exposée et elle a ensuite été téléchargée par des parties externes</a> (les données ont également fait l&#39;objet de 3 demandes de rançon différentes). 583 000 enregistrements ont été fournis à HIBP via un commerçant de données et comprenaient des adresses e-mail et des hachages bcrypt, mais l&#39;intégralité des données utilisateur exposées par le système dépassait 821 000 enregistrements et incluait également les noms d&#39;enfants et des références à des portraits et des enregistrements vocaux.","ClubPenguinRewritten2018-01-21":"En janvier 2018, le site de jeux pour enfants <a href=\"https://community.cprewritten.net/\" target=\"_blank\" rel=\"noopener\">Club Penguin</a> Rewrite (CPRewrite) a subi une violation de données (remarque : CPRewrite est une recréation indépendante du jeu Disney&#39;s Club Penguin). L&#39;incident a révélé près de 1,7 million d&#39;adresses e-mail uniques ainsi que des adresses IP, des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachage bcrypt. Lorsqu&#39;elle a été contactée, CPRewrite a indiqué qu&#39;elle était au courant de la violation et qu&#39;elle avait « contacté les utilisateurs concernés ».","ClubPenguinRewrittenJul20192019-07-27":"En juillet 2019, le site de jeux pour enfants <a href=\"https://community.cprewritten.net/\" target=\"_blank\" rel=\"noopener\">Club Penguin</a> Rewrite (CPRewrite) a subi une violation de données (remarque : CPRewrite est une recréation indépendante du jeu Disney&#39;s Club Penguin). En plus d&#39;une violation de données antérieure qui a touché 1,7 million de comptes, la violation suivante a exposé 4 millions d&#39;adresses e-mail uniques ainsi que des adresses IP, des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachage bcrypt.","Coachella2017-02-22":"En février 2017, des <a href=\"https://motherboard.vice.com/en_us/article/mgkzkp/someone-is-selling-coachella-user-accounts-on-the-dark-web\" target=\"_blank\" rel=\"noopener\">centaines de milliers de disques du festival de musique Coachella ont été découverts en vente en ligne</a> . Prétendument tirées d&#39;une combinaison du site Web principal de Coachella et de leur babillard basé sur vBulletin, les données comprenaient près de 600 000 noms d&#39;utilisateur, adresses IP et e-mail et des hachages salés de mots de passe (MD5 dans le cas du babillard).","Coinmama2017-08-03":"En août 2017, le service de courtage de crypto-monnaie <a href=\"https://cointelegraph.com/news/major-crypto-brokerage-coinmama-reports-450-000-users-affected-by-data-breach\" target=\"_blank\" rel=\"noopener\">Coinmama a subi une violation de données</a> qui a touché 479 000 abonnés. La violation a été découverte en février 2019 avec des données exposées, notamment des adresses e-mail, des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachages WordPress MD5. Les données ont été fournies à HIBP par Adam Davies, chercheur en sécurité et analyste de données à chapeau blanc.","Collection12019-01-07":"En janvier 2019, une grande collection de listes de bourrage d&#39;informations d&#39;identification (combinaisons d&#39;adresses e-mail et de mots de passe utilisées pour pirater des comptes sur d&#39;autres services) a été découverte en train d&#39;être distribuée sur un forum de piratage populaire. Les données contenaient près de 2,7 <em>milliards d&#39;</em> enregistrements, dont 773 millions d&#39;adresses e-mail uniques, ainsi que les mots de passe que ces adresses avaient utilisés sur d&#39;autres services violés. Des détails complets sur l&#39;incident et sur la façon de rechercher les mots de passe violés sont fournis dans l&#39;article de blog <a href=\"https://www.troyhunt.com/the-773-million-record-collection-1-data-reach\" target=\"_blank\" rel=\"noopener\">The 773 Million Record &quot;Collection #1&quot; Data Breach</a> .","COMELEC2016-03-27":"En mars 2016, <a href=\"http://www.comelec.gov.ph/\" target=\"_blank\" rel=\"noopener\">le site Web de la Commission électorale des Philippines</a> (COMELEC) a été <a href=\"http://www.rappler.com/nation/politics/elections/2016/127256-comelec-website-hacked-anonymous-philippines\" target=\"_blank\" rel=\"noopener\">attaqué et défiguré</a> , prétendument par Anonymous Philippines. Peu de temps après, des <a href=\"http://www.theregister.co.uk/2016/04/07/philippine_voter_data_breach/\" target=\"_blank\" rel=\"noopener\">données sur 55 millions d&#39;électeurs philippins ont été divulguées publiquement</a> et comprenaient des informations sensibles telles que le sexe, l&#39;état matrimonial, la taille et le poids et les données biométriques des empreintes digitales. La violation ne comprenait que 228 000 adresses e-mail.","CouponMomAndArmorGames2014-02-08":"En 2014, un fichier contenant prétendument des données piratées à partir de <a href=\"https://www.couponmom.com\" target=\"_blank\" rel=\"noopener\">Coupon Mom a</a> été créé et comprenait 11 millions d&#39;adresses e-mail et des mots de passe en texte brut. Après une enquête plus approfondie, il a également été découvert que le fichier contenait des données indiquant qu&#39;il provenait d&#39; <a href=\"https://armorgames.com\" target=\"_blank\" rel=\"noopener\">Armor Games</a> . Une vérification ultérieure auprès des abonnés HIBP a confirmé que les mots de passe avaient déjà été utilisés et que de nombreux abonnés avaient déjà utilisé Coupon Mom ou Armor Games. Lors de la divulgation aux deux organisations, chacune a constaté que les données ne représentaient pas l&#39;ensemble de leur clientèle et comprenaient peut-être des enregistrements provenant d&#39;autres sources avec des abonnés communs. La violation a par la suite été signalée comme « non vérifiée » car la source ne peut pas être prouvée avec force. En juillet 2020, il <a href=\"https://www.troyhunt.com/how-beeradvocate-learned-theyd-been-pwned/\" target=\"_blank\" rel=\"noopener\">a également été découvert que les données contenaient des comptes BeerAdvocate provenant d&#39;une violation jusqu&#39;alors inconnue</a> .","db8151dd2020-02-20":"En février 2020, <a href=\"https://www.troyhunt.com/the-unattributable-db8151dd-data-breach\" target=\"_blank\" rel=\"noopener\">une énorme quantité d&#39;informations personnelles appelées &quot;db8151dd&quot; a</a> été fournie à HIBP après avoir été retrouvée exposée sur un serveur Elasticsearch accessible au public. Plus tard identifiées comme provenant de l&#39;application de contacts Covve, les données exposées comprenaient de nombreuses informations personnelles et des interactions entre les utilisateurs de Covve et leurs contacts. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","CrackedTO2019-07-21":"En juillet 2019, le site de piratage <a href=\"https://cracked.to\" target=\"_blank\" rel=\"noopener\">Cracked.to a</a> subi une violation de données. Il y avait 749 000 adresses e-mail uniques réparties sur 321 000 utilisateurs du forum et d&#39;autres tables dans la base de données. Un site Web rival de piratage a revendiqué la responsabilité d&#39;avoir violé le forum basé sur MyBB qui a divulgué les adresses e-mail et IP, les noms d&#39;utilisateur, les messages privés et les mots de passe stockés sous forme de hachage bcrypt.","CrackingForum2016-07-01":"Vers la mi-2016, le forum de la communauté de cracking connu sous le nom de <a href=\"http://crackingforum.com\" target=\"_blank\" rel=\"noopener\">CrackingForum a</a> subi une violation de données. Le forum basé sur vBulletin a exposé 660 000 adresses e-mail et IP, noms d&#39;utilisateur et hachages MD5 salés.","Creative2018-05-01":"En mai 2018, <a href=\"http://forums.creative.com/\" target=\"_blank\" rel=\"noopener\">le forum de la société de matériel informatique singapourienne Creative Technology a</a> subi une violation de données qui a entraîné la divulgation de 483 000 adresses e-mail uniques. Fonctionnant sur une ancienne version de vBulletin, la violation a également révélé des noms d&#39;utilisateur, des adresses IP et des hachages de mot de passe MD5 salés. Après avoir été informé de l&#39;incident, Creative a définitivement fermé le forum.","CrossFire2016-08-08":"En août 2016, <a href=\"http://www.zdnet.com/article/over-25-million-accounts-stolen-after-mail-ru-forums-raided-by-hackers/\" target=\"_blank\" rel=\"noopener\">le forum de jeu russe connu sous le nom de Cross Fire (ou cfire.mail.ru) a été piraté</a> ainsi qu&#39;un certain nombre d&#39;autres forums sur le fournisseur de messagerie russe, mail.ru. Le forum vBulletin contenait 12,8 millions de comptes, y compris des noms d&#39;utilisateur, des adresses e-mail et des mots de passe stockés sous forme de hachage MD5 salé.","D3scene2016-01-01":"En janvier 2016, le site de jeux D3Scene a subi une violation de données. Le forum vBulletin compromis a exposé 569 000 millions d&#39;adresses e-mail, adresses IP, noms d&#39;utilisateur et mots de passe stockés sous forme de hachages MD5 salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","DailyQuiz2021-01-13":"En janvier 2021, le site Web de quiz <a href=\"https://dailyquiz.me/\" target=\"_blank\" rel=\"noopener\">Daily Quiz a</a> subi une violation de données qui a exposé plus de 8 millions d&#39;adresses e-mail uniques. Les données comprenaient également des noms d&#39;utilisateur, des adresses IP et des mots de passe stockés en texte brut.","Dailymotion2016-10-20":"En octobre 2016, la plateforme de partage de vidéos <a href=\"http://thehackernews.com/2016/12/dailymotion-video-hacked.html\" target=\"_blank\" rel=\"noopener\">Dailymotion a subi une violation de données</a> . L&#39;attaque a conduit à l&#39;exposition de plus de 85 millions de comptes d&#39;utilisateurs et comprenait des adresses e-mail, des noms d&#39;utilisateur et des hachages bcrypt de mots de passe.","DailyObjects2018-01-01":"Vers janvier 2018, une collection de plus de 464 000 dossiers clients du détaillant en ligne indien <a href=\"https://www.dailyobjects.com/\" target=\"_blank\" rel=\"noopener\">DailyObjects a</a> été divulguée en ligne. Les données comprenaient des noms, des adresses physiques et électroniques, des numéros de téléphone et des « codes PIN » stockés en texte brut. Après plusieurs tentatives pour les contacter, DailyObjects a répondu et a reçu une copie des données pour vérification, mais n&#39;a pas répondu aux multiples tentatives de contact qui ont suivi.","DaniWeb2015-12-01":"Fin 2015, le site technologique et social <a href=\"https://www.daniweb.com\" target=\"_blank\" rel=\"noopener\">DaniWeb a</a> subi une violation de données. L&#39;attaque a entraîné la divulgation de 1,1 million de comptes, y compris les adresses e-mail et IP, qui étaient également accompagnés de hachages MD5 de mots de passe salés. Cependant, DaniWeb a indiqué que &quot;les hachages et les sels de mot de passe violés sont incorrects&quot; et qu&#39;ils sont depuis passés à une nouvelle infrastructure et de nouveaux logiciels.","PDL2019-10-16":"En octobre 2019, <a href=\"https://www.troyhunt.com/data-enrichment-people-data-labs-and-another-622m-email-addresses\" target=\"_blank\" rel=\"noopener\">les chercheurs en sécurité Vinny Troia et Bob Diachenko ont identifié un serveur Elasticsearch non protégé contenant 1,2 milliard d&#39;enregistrements de données personnelles</a> . Les données exposées comprenaient un index indiquant qu&#39;elles provenaient de la société d&#39;enrichissement de données People Data Labs (PDL) et contenaient 622 millions d&#39;adresses e-mail uniques. Le serveur n&#39;appartenait pas à PDL et on pense qu&#39;un client n&#39;a pas réussi à sécuriser correctement la base de données. Les informations exposées comprenaient des adresses e-mail, des numéros de téléphone, des profils de réseaux sociaux et des données d&#39;historique de travail.","DataCamp2017-01-30":"En décembre 2018, le site Web de science des données <a href=\"https://support.datacamp.com/hc/en-us/articles/360017716074-DataCamp-Security-Update-Frequently-Asked-Questions\" target=\"_blank\" rel=\"noopener\">DataCamp a subi une violation</a> de données d&#39;enregistrements remontant à janvier 2017. L&#39;incident a révélé 760 000 adresses e-mail et IP uniques ainsi que des noms et des mots de passe stockés sous forme de hachages bcrypt. En 2019, <a href=\"https://www.theregister.co.uk/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">les données sont apparues en vente sur un marché du Web sombre</a> (avec plusieurs autres violations importantes) et ont ensuite commencé à circuler plus largement. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;BenjaminBlue@exploit.im&quot;.","DemonForums2019-02-20":"En février 2019, le forum de piratage <a href=\"https://demonforums.net/\" target=\"_blank\" rel=\"noopener\">Demon Forums a</a> subi une violation de données. La compromission du forum vBulletin a exposé 52 000 adresses e-mail uniques ainsi que des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachages MD5 salés.","Descomplica2021-03-14":"En mars 2021, la société brésilienne d&#39;EdTech <a href=\"https://atendimento.descomplica.com.br/hc/pt-br/articles/1500003993042-FAQ-Ataque-cibern%C3%A9tico-14-03\" target=\"_blank\" rel=\"noopener\">Descomplica a subi une violation de données</a> qui a ensuite été publiée sur un forum de piratage populaire. Les données comprenaient près de 5 millions d&#39;adresses e-mail, les noms, les 6 premiers et les 4 derniers chiffres et la date d&#39;expiration des cartes de crédit, les historiques d&#39;achat et les hachages de mot de passe.","DietCom2014-08-10":"En août 2014, le site Web de régime et de nutrition <a href=\"https://diet.com/\" target=\"_blank\" rel=\"noopener\">diet.com a</a> subi une violation de données entraînant l&#39;exposition de 1,4 million d&#39;enregistrements d&#39;utilisateurs uniques remontant à 2004. Les données contenaient des adresses e-mail et IP, des noms d&#39;utilisateur, des mots de passe en texte clair et des informations alimentaires sur les membres du site, y compris les habitudes alimentaires, l&#39;IMC et la date de naissance. Le site a déjà été signalé comme compromis dans le répertoire de la base de données violée <a href=\"https://vigilante.pw/\" target=\"_blank\" rel=\"noopener\">Vigilante.pw.</a>","Digimon2016-09-05":"En septembre 2016, plus de 16 Go de journaux d&#39;un service indiqué comme étant digimon.co.in ont été obtenus, très probablement à partir d&#39;une instance de base de données Mongo non protégée. Le service a cessé de fonctionner peu de temps après et aucune information ne subsiste sur la nature précise de celui-ci. D&#39;après les <a href=\"https://twitter.com/troyhunt/status/1045178309926051840\" target=\"_blank\" rel=\"noopener\">demandes de renseignements effectuées via Twitter</a> , il semble qu&#39;il s&#39;agisse d&#39;un service de messagerie peut-être basé sur PowerMTA et utilisé pour envoyer du spam. Les journaux contenaient des informations, notamment 7,7 millions de destinataires de courrier électronique uniques (noms et adresses), des adresses IP de serveur de messagerie, des sujets de courrier électronique et des informations de suivi, notamment les ouvertures de courrier et les clics.","Disqus2012-07-01":"En octobre 2017, le service de commentaires de blogs <a href=\"https://blog.disqus.com/security-alert-user-info-breach\" target=\"_blank\" rel=\"noopener\">Disqus a annoncé avoir subi une violation de données</a> . La violation remontait à juillet 2012, mais n&#39;a été identifiée que des années plus tard, lorsque les données ont finalement fait surface. La violation contenait plus de 17,5 millions d&#39;adresses e-mail et de noms d&#39;utilisateur uniques. Les utilisateurs qui ont créé des connexions sur Disqus avaient des hachages de mots de passe SHA1 salés, tandis que les utilisateurs qui se sont connectés via des fournisseurs de réseaux sociaux n&#39;avaient que des références à ces comptes.","DLH2016-07-31":"En juillet 2016, le site d&#39;actualités sur les jeux <a href=\"http://www.zdnet.com/article/millions-of-steam-game-keys-stolen-after-site-hack/\" target=\"_blank\" rel=\"noopener\">DLH.net a subi une violation de données</a> qui a exposé 3,3 millions d&#39;identités d&#39;abonnés. Outre les clés utilisées pour échanger et activer des jeux sur la plate-forme Steam, la violation a également entraîné l&#39;exposition d&#39;adresses e-mail, de dates de naissance et de hachages de mots de passe MD5 salés. Les données ont été données à Have I Been Pwned par le service de surveillance des violations de données <a href=\"https://vigilante.pw/\" target=\"_blank\" rel=\"noopener\">Vigilante.pw</a> .","Dodonew2011-12-01":"À la fin de 2011, les données auraient été obtenues à partir du site Web chinois connu sous le nom de Dodonew.com et contenaient 8,7 <a href=\"http://dodonew.com\" target=\"_blank\" rel=\"noopener\">millions de comptes.</a> Bien qu&#39;il existe des preuves que les données sont légitimes, en raison de la difficulté de vérifier catégoriquement la violation chinoise, elles ont été signalées comme « non vérifiées ». Les données de la violation contiennent des adresses e-mail et des noms d&#39;utilisateur. <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>","Dominos2014-06-13":"En juin 2014, <a href=\"http://www.welivesecurity.com/2014/06/16/dominos-pizza-hacked/\" target=\"_blank\" rel=\"noopener\">Domino&#39;s Pizza en France et en Belgique a été piraté</a> par un groupe du nom de &quot;Rex Mundi&quot; et les données de ses clients ont été rançonnées. Domino&#39;s a refusé de payer la rançon et six mois plus tard, les attaquants ont <a href=\"http://cyberintelligence.in/rex-mundi-hackers-leaked-data-dominos-accord-easypay/\" target=\"_blank\" rel=\"noopener\">publié les données</a> ainsi que des trésors d&#39;autres comptes piratés. Parmi les données client figuraient des mots de passe stockés avec un algorithme de hachage MD5 faible et sans sel.","DominosIndia2021-03-24":"En avril 2021, <a href=\"https://www.bleepingcomputer.com/news/security/dominos-india-discloses-data-breach-after-hackers-sell-data-online/\" target=\"_blank\" rel=\"noopener\">13 To de Domino&#39;s India compromis sont apparus à la vente sur un forum de piratage,</a> après quoi la société a reconnu une violation de données majeure datant de mars. Les données compromises comprenaient 22,5 millions d&#39;adresses e-mail, noms, numéros de téléphone, historiques de commandes et adresses physiques uniques.","DriveSure2020-12-19":"En décembre 2020, le fournisseur de services de concession automobile <a href=\"https://www.riskbasedsecurity.com/2021/02/01/personal-data-of-3-million-people-exposed-in-drivesure-hack/\" target=\"_blank\" rel=\"noopener\">DriveSure a subi une violation de données</a> . L&#39;incident a entraîné le téléchargement de 26 Go de données, puis leur partage sur un forum de piratage. Les informations personnelles concernées comprenaient 3,6 millions d&#39;adresses électroniques, de noms, de numéros de téléphone et d&#39;adresses physiques uniques. Les données du véhicule ont également été exposées et comprenaient les marques, les modèles, les numéros VIN et les lectures du compteur kilométrique. Un petit nombre de mots de passe stockés sous forme de hachages bcrypt ont également été inclus dans l&#39;ensemble de données.","Drizly2020-07-02":"Vers juillet 2020, le service de livraison d&#39;alcool en ligne basé aux États-Unis, <a href=\"https://techcrunch.com/2020/07/28/drizly-data-breach/\" target=\"_blank\" rel=\"noopener\">Drizly, a subi une violation de données</a> . Les données ont été vendues en ligne avant d&#39;être largement redistribuées et contenaient 2,5 millions d&#39;adresses e-mail uniques ainsi que des noms, des adresses physiques et IP, des numéros de téléphone, des dates de naissance et des mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Dropbox2012-07-01":"À la mi-2012, Dropbox a subi une violation de données qui a exposé les informations d&#39;identification stockées de dizaines de millions de ses clients. En août 2016, <a href=\"https://motherboard.vice.com/read/dropbox-forces-password-resets-after-user-credentials-exposed\" target=\"_blank\" rel=\"noopener\">ils ont forcé la réinitialisation des mots de passe pour les clients qu&#39;ils pensaient être à risque</a> . Un grand volume de données totalisant plus de 68 millions d&#39;enregistrements <a href=\"https://motherboard.vice.com/read/hackers-stole-over-60-million-dropbox-accounts\" target=\"_blank\" rel=\"noopener\">a ensuite été échangé en ligne</a> et comprenait des adresses e-mail et des hachages salés de mots de passe (la moitié SHA1, la moitié bcrypt).","Dubsmash2018-12-01":"En décembre 2018, le service de messagerie vidéo <a href=\"https://www.theregister.co.uk/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">Dubsmash a subi une violation de données</a> . L&#39;incident a révélé 162 millions d&#39;adresses e-mail uniques ainsi que des noms d&#39;utilisateur et des hachages de mot de passe PBKDF2. En 2019, les données sont apparues en vente sur un marché du dark web (avec plusieurs autres violations importantes) et ont ensuite commencé à circuler plus largement. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;BenjaminBlue@exploit.im&quot;.","DuelingNetwork2017-03-29":"En mars 2017, le jeu Flash basé sur le jeu de cartes à collectionner Yu-Gi-Oh <a href=\"https://www.vice.com/amp/en_us/article/783dkz/hacker-steals-millions-of-accounts-from-yu-gi-oh-fan-project-dueling-network\" target=\"_blank\" rel=\"noopener\">Dueling Network a subi une violation de données</a> . Le site lui-même a été mis hors ligne en 2016 en raison d&#39;une ordonnance de cesser et de s&#39;abstenir, mais le forum est resté en ligne pendant une autre année. La violation de données a exposé les noms d&#39;utilisateur, les adresses IP et e-mail et les mots de passe stockés sous forme de hachages MD5. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées au &quot;burger vault&quot;.","Dunzo2020-06-19":"Vers juin 2019, le service de livraison indien <a href=\"https://www.thenewsminute.com/article/dunzo-suffers-data-breach-launches-internal-investigation-128415\" target=\"_blank\" rel=\"noopener\">Dunzo a subi une violation de données</a> . En exposant 3,5 millions d&#39;adresses e-mail uniques, la brèche Dunzo incluait également des noms, des numéros de téléphone et des adresses IP qui ont tous été largement diffusés en ligne via un forum de piratage. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","DVDShopCH2017-12-05":"En décembre 2017, la boutique de DVD en ligne suisse connue sous le nom de <a href=\"https://www.melani.admin.ch/melani/de/home/dokumentation/newsletter/passwoerter-von-70000-e-mail-konten-im-umlauf.html\" target=\"_blank\" rel=\"noopener\">dvd-shop.ch a subi une violation de données</a> . L&#39;incident a conduit à l&#39;exposition de 68 000 adresses e-mail et mots de passe en texte brut. Le site a depuis été mis à jour pour indiquer qu&#39;il est actuellement fermé.","Eatigo2018-10-16":"En octobre 2018, le service de réservation de restaurants <a href=\"https://www.channelnewsasia.com/singapore/eatigo-data-breach-personal-information-millions-account-1307916\" target=\"_blank\" rel=\"noopener\">Eatigo a subi une violation de données qui a exposé 2,8 millions de comptes</a> . Les données comprenaient des adresses e-mail, des noms, des numéros de téléphone, des profils de réseaux sociaux, des sexes et des mots de passe stockés sous forme de hachages MD5 non salés.","EatStreet2019-05-03":"En mai 2019, le service de commande de nourriture en ligne <a href=\"https://www.zdnet.com/article/eatstreet-food-ordering-service-discloses-security-breach/\" target=\"_blank\" rel=\"noopener\">EatStreet a subi une violation de données affectant 6,4 millions de clients</a> . Une grande quantité de données personnelles a été obtenue, notamment des noms, des numéros de téléphone, des adresses, des données partielles de carte de crédit et des mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","Elance2009-01-01":"En 2009, la plate-forme de recrutement <a href=\"http://www.ibtimes.co.uk/elance-data-breach-hacker-leaks-1-3-million-accounts-staffing-platform-1605368\" target=\"_blank\" rel=\"noopener\">Elance a subi une violation de données qui a touché 1,3 million de comptes</a> . Apparues en ligne 8 ans plus tard, les données contenaient des noms d&#39;utilisateur, des adresses e-mail, des numéros de téléphone et des hachages SHA1 de mots de passe, entre autres données personnelles.","Elanic2018-01-01":"En janvier 2020, le marché indien de la mode <a href=\"https://elanic.in/\" target=\"_blank\" rel=\"noopener\">Elanic</a> comptait 2,8 millions d&#39;enregistrements avec 2,3 millions d&#39;adresses e-mail uniques publiées publiquement sur un forum de piratage populaire. Elanic a confirmé qu&#39;ils avaient &quot;vérifié les données et qu&#39;elles ont été extraites de l&#39;un de nos serveurs de test où ces données ont été exposées publiquement&quot; et que les données étaient &quot;anciennes&quot; (le forum de piratage a signalé qu&#39;elles dataient de 2016-2018). Interrogé sur la divulgation aux clients concernés, Elanic a indiqué qu&#39;ils avaient &quot;décidé de ne pas avoir en tant que tel de communication et de divulgation publique&quot;.","EpicGames2016-08-11":"En août 2016, <a href=\"http://www.zdnet.com/article/epic-games-unreal-engine-forums-hacked-in-latest-data-breach\" target=\"_blank\" rel=\"noopener\">le forum Epic Games a subi une violation de données</a> , prétendument due à une vulnérabilité d&#39;injection SQL dans vBulletin. L&#39;attaque a entraîné l&#39;exposition de 252 000 comptes, y compris des noms d&#39;utilisateur, des adresses e-mail et des hachages MD5 de mots de passe salés.","EpicBot2019-09-01":"En septembre 2019, le fournisseur de bot RuneScape <a href=\"https://arstechnica.com/information-technology/2019/11/password-data-dumped-online-for-2-2-million-users-of-currency-and-gaming-sites/\" target=\"_blank\" rel=\"noopener\">EpicBot a subi une violation de données qui a touché 817 000 abonnés</a> . Les données de la violation ont ensuite été partagées sur un forum de piratage populaire et comprenaient des noms d&#39;utilisateur, des adresses e-mail et IP et des mots de passe stockés sous forme de hachage MD5 salé ou bcrypt. EpicBot n&#39;a pas répondu lorsqu&#39;il a été contacté au sujet de l&#39;incident.","Epik2021-09-13":"En septembre 2021, <a href=\"https://arstechnica.com/information-technology/2021/09/anonymous-leaks-gigabytes-of-data-from-epik-web-host-of-gab-and-parler/\" target=\"_blank\" rel=\"noopener\">le registraire de domaine et hébergeur Web Epik a subi une importante violation de données</a> , prétendument en représailles pour l&#39;hébergement de sites Web de droit alternatif. La violation a exposé un énorme volume de données non seulement sur les clients d&#39;Epik, mais a également supprimé les enregistrements WHOIS appartenant à des individus et à des organisations qui n&#39;étaient pas des clients d&#39;Epik. Les données comprenaient plus de 15 millions d&#39;adresses e-mail uniques (y compris des versions anonymisées pour la confidentialité du domaine), des noms, des numéros de téléphone, des adresses physiques, des achats et des mots de passe stockés dans divers formats.","Estonia2018-06-07":"En juin 2018, <a href=\"https://www.troyhunt.com/data-provided-by-the-estonian-central-criminal-police-is-now-searchable-on-have-i-been-pwned\" target=\"_blank\" rel=\"noopener\">le Bureau de la cybercriminalité de la police criminelle centrale estonienne a contacté HIBP</a> et a demandé de l&#39;aide pour rendre un ensemble de données de 655 000 adresses e-mail consultables. La police estonienne soupçonnait que les adresses e-mail et les mots de passe obtenus étaient utilisés pour accéder aux boîtes aux lettres, aux échanges de crypto-monnaie, aux comptes de service cloud et à d&#39;autres actifs en ligne similaires. Ils ont demandé aux personnes qui se trouvent dans l&#39;ensemble de données <b><i>et identifient également que la crypto-monnaie a été volée de les</i></b> contacter à l&#39; <a href=\"mailto:cybercrime@politsei.ee\">adresse cybercrime@politsei.ee</a> .","Evermotion2015-05-07":"En mai 2015, le site Web polonais de modélisation 3D connu sous le nom d&#39; <a href=\"https://evermotion.org/\" target=\"_blank\" rel=\"noopener\">Evermotion a</a> subi une violation de données entraînant l&#39;exposition de 435 000 enregistrements d&#39;utilisateurs uniques. Les données provenaient d&#39;un forum vBulletin et contenaient des adresses e-mail, des noms d&#39;utilisateur, des dates de naissance et des hachages MD5 de mots de passe salés. Le site a déjà été signalé comme compromis dans le répertoire de la base de données violée <a href=\"https://vigilante.pw/\" target=\"_blank\" rel=\"noopener\">Vigilante.pw.</a>","EverybodyEdits2019-03-23":"En mars 2019, le jeu de plateforme multijoueur <a href=\"https://everybodyedits.wordpress.com/2019/03/28/everybody-edits-data-security-breach/\" target=\"_blank\" rel=\"noopener\">Everybody Edits a subi une violation de données</a> . L&#39;incident a révélé 871 000 adresses e-mail uniques ainsi que des noms d&#39;utilisateur et des adresses IP. Les données ont ensuite été diffusées en ligne sur un ensemble de fichiers.","Evony2016-06-01":"En juin 2016, le jeu multijoueur en ligne <a href=\"http://securityaffairs.co/wordpress/52260/data-breach/evony-data-breach.html\" target=\"_blank\" rel=\"noopener\">Evony a été piraté</a> et plus de 29 millions de comptes uniques ont été exposés. L&#39;attaque a conduit à l&#39;exposition de noms d&#39;utilisateur, d&#39;adresses e-mail et IP et de hachages MD5 de mots de passe (sans sel).","Exactis2018-06-01":"En juin 2018, <a href=\"https://www.wired.com/story/exactis-database-leak-340-million-records/\" target=\"_blank\" rel=\"noopener\">la société de marketing Exactis a divulgué publiquement par inadvertance 340 millions d&#39;enregistrements de données personnelles</a> . Le chercheur en sécurité <a href=\"https://www.nightlionsecurity.com/\" target=\"_blank\" rel=\"noopener\">Vinny Troia de Night Lion Security a</a> découvert que la fuite contenait plusieurs téraoctets d&#39;informations personnelles réparties dans des centaines de champs distincts, notamment des adresses, des numéros de téléphone, des structures familiales et de nombreuses données de profilage. Les données ont été collectées dans le cadre du service d&#39;Exactis en tant que « compilateur et agrégateur de données premium sur les entreprises et les consommateurs » qu&#39;ils vendent ensuite à des fins de profilage et de marketing. Un petit sous-ensemble des champs exposés a été fourni à Have I Been Pwned et contenait 132 millions d&#39;adresses e-mail uniques.","Experian20202020-08-19":"En août 2020, <a href=\"https://www.iafrikan.com/2020/09/01/experian-data-breach-database-public-data-information-south-africa/\" target=\"_blank\" rel=\"noopener\">Experian South Africa a subi une violation de données</a> qui a exposé les informations personnelles de dizaines de millions de personnes. Seulement 1,3 million des enregistrements contenaient des adresses électroniques, tandis que la plupart contenaient des numéros d&#39;identité, des noms, des adresses, des professions et des employeurs émis par le gouvernement, entre autres informations personnelles.","ExploitIn2016-10-13":"Fin 2016, une énorme liste de paires d&#39;adresses e-mail et de mots de passe est apparue dans une &quot;liste combinée&quot; appelée &quot;Exploit.In&quot;. La liste contenait 593 millions d&#39;adresses e-mail uniques, dont beaucoup avec plusieurs mots de passe différents piratés à partir de divers systèmes en ligne. La liste a été largement diffusée et utilisée pour le « bourrage d&#39;informations d&#39;identification », c&#39;est-à-dire que les attaquants l&#39;utilisent pour tenter d&#39;identifier d&#39;autres systèmes en ligne où le propriétaire du compte avait réutilisé son mot de passe. Pour des informations détaillées sur cet incident, lisez <a href=\"https://www.troyhunt.com/password-reuse-credential-stuffing-and-another-1-billion-records-in-have-i-been-pwned\" target=\"_blank\" rel=\"noopener\">Réutilisation des mots de passe, bourrage d&#39;informations d&#39;identification et un autre milliard d&#39;enregistrements dans Have I Been Pwned</a> .","VINs2017-06-05":"En juin 2017, <a href=\"https://www.bleepingcomputer.com/news/security/car-thieves-everywhere-rejoice-as-unsecured-database-exposes-10-million-car-vins/\" target=\"_blank\" rel=\"noopener\">une base de données non sécurisée contenant plus de 10 millions de VIN (numéros d&#39;identification de véhicule) a été découverte par des chercheurs</a> . Considérées comme provenant de concessionnaires automobiles américains, les données comprenaient une série d&#39;informations personnelles et de données sur les véhicules ainsi que 397 000 adresses e-mail uniques.","EyeEm2018-02-28":"En février 2018, le <a href=\"https://www.theregister.co.uk/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">site de photographie EyeEm a subi une violation de données</a> . La violation a été identifiée parmi une série d&#39;autres incidents importants et a exposé près de 20 millions d&#39;adresses e-mail, noms, noms d&#39;utilisateur, bios et hachages de mots de passe uniques. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;Kuroi&#39;sh ou Gabriel Kimiaie-Asadi Bildstein&quot;.","FaceUP2013-01-01":"En 2013, le site de médias sociaux danois <a href=\"https://faceup.dk/\" target=\"_blank\" rel=\"noopener\">FaceUP a</a> subi une violation de données. L&#39;incident a révélé 87 000 adresses e-mail uniques, ainsi que les sexes, les dates de naissance, les noms, les numéros de téléphone et les mots de passe stockés sous forme de hachages MD5 non salés. Lorsqu&#39;il a été informé de l&#39;incident, FaceUP a indiqué qu&#39;il avait identifié une vulnérabilité d&#39;injection SQL à l&#39;époque et forcé les réinitialisations de mot de passe sur les clients concernés.","Factual2017-03-22":"En mars 2017, un fichier contenant 8 millions de lignes de données <a href=\"https://www.troyhunt.com/when-is-data-public-and-2-5m-public-factual-records\" target=\"_blank\" rel=\"noopener\">prétendument provenant de l&#39;agrégateur de données Factual a</a> été compilé puis échangé sur le principe qu&#39;il s&#39;agissait d&#39;une &quot;violation&quot;. Les données contenaient 2,5 millions d&#39;adresses e-mail uniques ainsi que des noms d&#39;entreprises, des adresses et des numéros de téléphone. Après consultation avec Factual, ils ont indiqué que les données étaient &quot;des informations accessibles au public sur les entreprises et d&#39;autres points d&#39;intérêt que Factual met à disposition sur son site Web et aux clients&quot;.","WhiteRoom2018-07-09":"En juillet 2018, la société de commerce électronique basée au Royaume-Uni, <a href=\"https://www.grahamcluley.com/online-fashion-shoppers-exposed-ecommerce-breach/\" target=\"_blank\" rel=\"noopener\">Fashion Nexus, a subi une violation de données qui a exposé 1,4 million d&#39;enregistrements</a> . Plusieurs sites Web développés par la société sœur White Room Solutions ont été touchés par la brèche, parmi lesquels des sites tels que <a href=\"https://jadedldn.com/\" target=\"_blank\" rel=\"noopener\">Jaded London</a> et <a href=\"http://axparis.co.uk\" target=\"_blank\" rel=\"noopener\">AX Paris</a> . Les différents sites exposés dans l&#39;incident comprenaient une gamme de types de données différents, notamment des noms, des numéros de téléphone, des adresses et des mots de passe stockés sous forme d&#39;un mélange de mots de passe salés MD5 et SHA-1 ainsi que de mots de passe MD5 non salés. Lorsque le journaliste Graham Cluley lui a demandé si une déclaration publique sur l&#39;incident était disponible, une réponse d&#39;un mot &quot;Non&quot; a été reçue.","FashionFantasyGame2016-12-01":"Fin 2016, le site de jeux de mode <a href=\"http://www.zdnet.com/article/amid-data-breach-responsibility-thrown-to-the-wind/\" target=\"_blank\" rel=\"noopener\">Fashion Fantasy Game a subi une violation de données</a> . L&#39;incident a révélé 2,3 millions de comptes d&#39;utilisateurs uniques et les hachages de mot de passe MD5 correspondants sans sel. Les données ont été fournies à Have I Been Pwned avec l&#39;aimable autorisation de rip@creep.im.","FilmaiIn2020-01-01":"Vers 2019 ou 2020, le service de streaming de films lituanien <a href=\"http://filmai.in/\" target=\"_blank\" rel=\"noopener\">Filmai.in a</a> subi une violation de données exposant 645 000 adresses e-mail, noms d&#39;utilisateur et mots de passe en texte brut.","FFShrine2015-09-18":"En septembre 2015, <a href=\"http://ffshrine.org\" target=\"_blank\" rel=\"noopener\">le forum de discussion Final Fantasy connu sous le nom de FFShrine a</a> été violé et les données ont été vidées publiquement. Environ 620 000 enregistrements ont été publiés contenant des adresses e-mail, des adresses IP et des hachages salés de mots de passe.","FlashFlashRevolution2016-02-01":"En février 2016, le jeu de rythme basé sur la musique connu sous le nom de <a href=\"http://www.flashflashrevolution.com\" target=\"_blank\" rel=\"noopener\">Flash Flash Revolution a</a> été piraté et 1,8 million de comptes ont été exposés. En plus des adresses e-mail et IP, le forum vBulletin a également exposé des hachages de mot de passe MD5 salés.","FlashFlashRevolution20192019-07-16":"En juillet 2019, le jeu de rythme musical <a href=\"http://www.flashflashrevolution.com/\" target=\"_blank\" rel=\"noopener\">Flash Flash Revolution a</a> subi une violation de données. La violation de 2019 a touché près de 1,9 million de membres et <em>s&#39;ajoute à</em> <a href=\"http://www.flashflashrevolution.com/ffr/information-breach/\" target=\"_blank\" rel=\"noopener\">la violation de données de 2016 du même service</a> . Les adresses e-mail et IP, les noms d&#39;utilisateur, les dates de naissance et les hachages MD5 salés ont tous été exposés dans la brèche. Les données ont été fournies avec le soutien de <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Foodora2016-04-22":"En avril 2016, le service de livraison de nourriture en ligne <a href=\"https://www.databreachtoday.com/delivery-hero-confirms-foodora-data-breach-a-14435\" target=\"_blank\" rel=\"noopener\">Foodora a subi une violation de données</a> qui a ensuite été largement redistribuée en ligne. La violation comprenait les informations personnelles de centaines de milliers de clients de plusieurs pays, y compris leurs noms, adresses de livraison, numéros de téléphone et mots de passe stockés sous forme de hachage MD5 salé ou bcrypt.","Forbes2014-02-15":"En février 2014, le site Web de Forbes a <a href=\"http://news.cnet.com/8301-1009_3-57618945-83/syrian-electronic-army-hacks-forbes-steals-user-data\" target=\"_blank\" rel=\"noopener\">succombé à une attaque qui a divulgué plus d&#39;un million de comptes d&#39;utilisateurs</a> . L&#39;attaque a été attribuée à l&#39;armée électronique syrienne, prétendument en représailles pour une &quot;haine de la Syrie&quot; perçue. L&#39;attaque a non seulement divulgué les informations d&#39;identification des utilisateurs, mais a également entraîné la publication de fausses nouvelles sur forbes.com.","FreshMenu2016-07-01":"En juillet 2016, le service de livraison de nourriture basé en Inde <a href=\"https://www.freshmenu.com/\" target=\"_blank\" rel=\"noopener\">FreshMenu a</a> subi une violation de données. L&#39;incident a exposé les données personnelles de plus de 110 000 clients et comprenait leurs noms, adresses e-mail, numéros de téléphone, adresses de domicile et historiques de commandes. Lorsqu&#39;il a été informé de l&#39;incident, FreshMenu a reconnu être déjà au courant de la violation, mais a déclaré qu&#39;il avait décidé de ne pas informer les clients concernés.","Funimation2016-07-01":"En juillet 2016, le site d&#39;animation <a href=\"https://www.funimation.com/\" target=\"_blank\" rel=\"noopener\">Funimation a</a> subi une violation de données qui a touché 2,5 millions de comptes. Les données contenaient des noms d&#39;utilisateur, des adresses e-mail, des dates de naissance et des hachages SHA1 salés de mots de passe.","FunnyGames2018-04-28":"En avril 2018, le site de divertissement en ligne <a href=\"https://www.funny-games.biz/\" target=\"_blank\" rel=\"noopener\">Funny Games a</a> subi une violation de données qui a divulgué 764 000 enregistrements, notamment des noms d&#39;utilisateur, des adresses e-mail et IP et des hachages de mot de passe MD5 salés. L&#39;incident a été divulgué à Funny Games en juillet qui a reconnu la violation et identifié qu&#39;elle avait été causée par un code hérité qui n&#39;était plus utilisé. Le nombre d&#39;enregistrements dans la violation constitue environ la moitié de la base d&#39;utilisateurs.","Gaadi2015-05-14":"En mai 2015, le site Web automobile indien connu sous le nom de <a href=\"https://www.gaadi.com/\" target=\"_blank\" rel=\"noopener\">Gaadi</a> avait 4,3 millions d&#39;enregistrements exposés dans une violation de données. Les données contenaient des noms d&#39;utilisateur, des adresses e-mail et IP, des sexes, la ville des utilisateurs ainsi que des mots de passe stockés à la fois en texte brut et sous forme de hachage MD5. Le site a déjà été signalé comme compromis dans le répertoire de la base de données violée <a href=\"https://vigilante.pw/\" target=\"_blank\" rel=\"noopener\">Vigilante.pw.</a>","GameSalad2019-02-24":"En février 2019, le site d&#39;éducation et de création de jeux <a href=\"https://www.zdnet.com/article/round-4-hacker-returns-and-puts-26mil-user-records-for-sale-on-the-dark-web/\" target=\"_blank\" rel=\"noopener\">Game Salad a subi une violation de données</a> . L&#39;incident a touché 1,5 million de comptes et a exposé des adresses e-mail, des noms d&#39;utilisateur, des adresses IP et des mots de passe stockés sous forme de hachage SHA-256. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","GameTuts2015-03-01":"Probablement au début de 2015, le site Web de jeux vidéo GameTuts a subi une violation de données et plus de 2 millions de comptes d&#39;utilisateurs ont été exposés. Le site a ensuite <a href=\"https://twitter.com/TeamModio/status/756705841168916486\" target=\"_blank\" rel=\"noopener\">fermé ses portes en juillet 2016,</a> mais a été identifié comme ayant été hébergé sur un forum vBulletin. Les données exposées comprenaient les noms d&#39;utilisateur, les adresses e-mail et IP et les hachages MD5 salés.","GateHub2019-06-04":"En octobre 2019, <a href=\"https://arstechnica.com/information-technology/2019/11/password-data-dumped-online-for-2-2-million-users-of-currency-and-gaming-sites/\" target=\"_blank\" rel=\"noopener\">1,4 million de comptes du service de portefeuille de crypto-monnaie GateHub ont été publiés sur un forum de piratage populaire</a> . GateHub avait <a href=\"https://gatehub.net/blog/gatehub-update-investigation-continues/\" target=\"_blank\" rel=\"noopener\">déjà reconnu une violation de données en juin</a> , mais avec un plus petit nombre de comptes concernés. Les données de la violation comprenaient des adresses e-mail, des phrases mnémoniques, des clés principales cryptées, des clés de récupération cryptées et des mots de passe stockés sous forme de hachages bcrypt.","Gawker2010-12-11":"En décembre 2010, Gawker a été attaqué par le collectif de hackers « Gnosis » en représailles à ce qui aurait été une querelle entre Gawker et 4Chan. Des informations sur les utilisateurs de Gawkers 1.3M ont été publiées avec les données des autres sites Web de Gawker, notamment Gizmodo et Lifehacker. En raison de la prévalence de la réutilisation des mots de passe, de nombreuses victimes de la violation ont <a href=\"http://www.troyhunt.com/2011/01/why-your-apps-security-design-could.html\" target=\"_blank\" rel=\"noopener\">alors vu leurs comptes Twitter compromis pour envoyer du spam Acai berry</a> .","Gett2017-05-04":"En mai 2017, la plateforme de partage de fichiers <a href=\"https://www.zdnet.com/article/127-million-user-records-from-8-companies-put-up-for-sale-on-the-dark-web/\" target=\"_blank\" rel=\"noopener\">Ge.tt a subi une violation de données</a> . Les données ont ensuite été mises en vente sur un marché du Web sombre en février 2019 aux côtés d&#39;une série d&#39;autres violations. La violation de Ge.tt comprenait des noms, des identifiants de profil de médias sociaux, des hachages de mot de passe SHA256 et près de 2,5 millions d&#39;adresses e-mail uniques. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à <a href=\"https://www.linkedin.com/company/breachdirectory/\" target=\"_blank\" rel=\"noopener\">BreachDirectory</a> .","GeekedIn2016-08-15":"En août 2016, le site de recrutement technologique <a href=\"http://geekedin.net\" target=\"_blank\" rel=\"noopener\">GeekedIn a</a> laissé une base de données MongoDB exposée et plus de 8 millions d&#39;enregistrements ont été extraits par un tiers inconnu. Les données violées ont été à l&#39;origine supprimées de GitHub en violation de leurs conditions d&#39;utilisation et contenaient des informations exposées dans des profils publics, y compris plus d&#39;un million d&#39;adresses e-mail de membres. Tous les détails sur l&#39;incident (y compris la façon dont les membres touchés peuvent voir leurs données divulguées) sont couverts dans l&#39;article de blog sur <a href=\"https://www.troyhunt.com/8-million-github-profiles-were-leaked-from-geekedins-mongodb-heres-how-to-see-yours\" target=\"_blank\" rel=\"noopener\">8 millions de profils GitHub ont été divulgués à partir de MongoDB de GeekedIn - voici comment voir le vôtre</a> .","GeniusU2020-10-02":"En novembre 2020, <a href=\"https://www.databreaches.net/more-drama-on-a-forum-and-a-slew-of-new-databases-dumped/\" target=\"_blank\" rel=\"noopener\">un recueil de violations de données a été rendu public dont la « Entrepreneur Success Platform », GeniusU</a> . Datant du mois précédent, les données comprenaient 1,3 million de noms, adresses e-mail et IP, sexes, liens vers des profils de réseaux sociaux et mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","GFAN2016-10-10":"En octobre 2016, des données ont fait surface qui auraient été obtenues à partir du site Web chinois connu sous le nom de <a href=\"http://www.gfan.com\" target=\"_blank\" rel=\"noopener\">GFAN</a> et contenaient 22,5 millions de comptes. Bien qu&#39;il existe des preuves que les données sont légitimes, en raison de la difficulté de vérifier catégoriquement la violation chinoise, elles ont été signalées comme « non vérifiées ». Les données de la violation contiennent des adresses e-mail et IP, des noms d&#39;utilisateur et des mots de passe salés et hachés. <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>","Glofox2020-03-27":"En mars 2020, la société irlandaise de logiciels de gestion de <a href=\"https://www.irishtimes.com/business/technology/irish-start-up-glofox-investigates-possible-data-breach-1.4414837\" target=\"_blank\" rel=\"noopener\">gymnases Glofox a subi une violation de données qui a exposé 2,3 millions de dossiers d&#39;adhésion</a> . Les données comprenaient des adresses e-mail, des noms, des numéros de téléphone, des sexes, des dates de naissance et des mots de passe stockés sous forme de hachages MD5 non salés.","GoGames2015-10-24":"Vers octobre 2015, le site de mangas <a href=\"http://gogames.me\" target=\"_blank\" rel=\"noopener\">Go Games a</a> subi une violation de données. Les données exposées comprenaient 3,4 millions d&#39;enregistrements de clients, y compris les adresses e-mail et IP, les noms d&#39;utilisateur et les mots de passe stockés sous forme de hachages MD5 salés. Go Games n&#39;a pas répondu lorsqu&#39;il a été contacté au sujet de l&#39;incident. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","GoldSilver2018-10-21":"En octobre 2018, le site de formation et de services aux concessionnaires <a href=\"https://goldsilver.com/\" target=\"_blank\" rel=\"noopener\">Bullion GoldSilver a</a> subi une violation de données qui a exposé 243 000 adresses e-mail uniques couvrant des clients et des abonnés à la liste de diffusion. Une grande quantité d&#39;informations personnelles sur les clients a été obtenue, y compris les noms, adresses, numéros de téléphone, achats et mots de passe et les réponses aux questions de sécurité stockées sous forme de hachage MD5. Dans un petit nombre de cas, le passeport, les numéros de sécurité sociale et des données partielles de carte de crédit ont également été exposés. La violation de données et le code source appartenant à GoldSilver ont été publiés publiquement sur un service Web sombre où ils sont restés des mois plus tard. Lorsqu&#39;il a été informé de l&#39;incident, GoldSilver a indiqué que « tous les clients concernés ont été directement informés ».","gPotato2007-07-12":"En juillet 2007, le portail de jeux multijoueurs connu sous le nom de <a href=\"https://web.archive.org/web/20070710161412/http://gpotato.com/\" target=\"_blank\" rel=\"noopener\">gPotato</a> (lien vers les archives du site à l&#39;époque) a subi une violation de données et plus de 2 millions de comptes d&#39;utilisateurs ont été exposés. Le site a ensuite fusionné avec le <a href=\"http://www.webzen.com/\" target=\"_blank\" rel=\"noopener\">portail Webzen</a> où les comptes originaux existent encore aujourd&#39;hui. Les données exposées comprenaient les noms d&#39;utilisateur, les adresses e-mail et IP, les hachages MD5 et les attributs personnels tels que le sexe, la date de naissance, l&#39;adresse physique et les questions et réponses de sécurité stockées en texte brut.","GPSUnderground2016-07-01":"Au début de 2017, <a href=\"https://www.hackread.com/vbulletin-forums-hacked-accounts-sold-on-dark-web/\" target=\"_blank\" rel=\"noopener\">GPS Underground faisait partie d&#39;une collection de sites Web vBulletin compromis vendus en ligne</a> . La violation remontait à la mi-2016 et comprenait 670 000 enregistrements avec des noms d&#39;utilisateur, des adresses e-mail et IP, des dates de naissance et des hachages de mot de passe MD5 salés.","GTAGaming2016-08-01":"En août 2016, le forum <a href=\"https://motherboard.vice.com/read/grand-theft-auto-fan-site-hacked\" target=\"_blank\" rel=\"noopener\">GTAGaming de Grand Theft Auto a été piraté et près de 200 000 comptes d&#39;utilisateurs ont été divulgués</a> . Le forum basé sur vBulletin comprenait des noms d&#39;utilisateur, des adresses e-mail et des hachages de mot de passe.","HauteLook2018-08-07":"Mi-2018, le site de shopping de mode <a href=\"https://www.theregister.co.uk/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">HauteLook faisait partie d&#39;une flopée de sites qui ont été violés et leurs données ont ensuite été vendues début 2019</a> . Les données comprenaient plus de 28 millions d&#39;adresses e-mail uniques ainsi que les noms, les sexes, les dates de naissance et les mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Havenly2020-06-25":"En juin 2020, le site de design d&#39;intérieur <a href=\"https://www.bleepingcomputer.com/news/security/hacker-leaks-386-million-user-records-from-18-companies-for-free/\" target=\"_blank\" rel=\"noopener\">Havenly a subi une violation de données</a> qui a touché près de 1,4 million de membres du service. Les données exposées comprenaient des adresses e-mail, des noms, des numéros de téléphone, des emplacements géographiques et des mots de passe stockés sous forme de hachage SHA-1, qui ont ensuite été largement partagés entre les communautés de piratage en ligne. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","HealthNowNetworks2017-03-25":"En mars 2017, le service de télémarketing <a href=\"https://www.databreaches.net/leak-of-diabetic-patients-data-highlights-risks-of-giving-info-to-telemarketers\" target=\"_blank\" rel=\"noopener\">Health Now Networks a laissé une base de données contenant des centaines de milliers de dossiers médicaux exposés</a> . Il y avait plus de 900 000 dossiers au total contenant d&#39;importants volumes de renseignements personnels, notamment les noms, les dates de naissance, diverses conditions médicales et les notes de l&#39;opérateur sur la santé des individus. Les données comprenaient plus de 320 000 adresses e-mail uniques.","Hemmakvall2015-07-08":"En juillet 2015, la chaîne de magasins de vidéos suédoise <a href=\"http://www.hemmakvall.se/\" target=\"_blank\" rel=\"noopener\">Hemmakväll a</a> <a href=\"http://www.dn.se/ekonomi/hemmakvall-hackat-50000-kunders-uppgifter-pa-vift/\" target=\"_blank\" rel=\"noopener\">été piratée</a> et près de 50 000 enregistrements ont été jetés publiquement. Les données divulguées comprenaient divers attributs de leurs clients, notamment des adresses e-mail et physiques, des noms et des numéros de téléphone. Des mots de passe ont également été divulgués, stockés avec un algorithme de hachage MD5 faible.","HeroesOfNewerth2012-12-17":"En décembre 2012, le jeu d&#39;arène de combat en ligne multijoueur connu sous le nom de <a href=\"http://www.heroesofnewerth.com/\" target=\"_blank\" rel=\"noopener\">Heroes of Newerth a</a> <a href=\"https://www.reddit.com/r/HeroesofNewerth/comments/14zj2p/i_am_the_guy_who_hacked_hon/\" target=\"_blank\" rel=\"noopener\">été piraté</a> et plus de 8 millions de comptes ont été extraits du système. Les données compromises comprenaient des noms d&#39;utilisateur, des adresses e-mail et des mots de passe.","HIAPK2014-01-01":"Vers 2014, il est allégué que la boutique Android chinoise connue sous le nom de <a href=\"http://hiapk.com/\" target=\"_blank\" rel=\"noopener\">HIAPK a</a> subi une violation de données qui a touché 13,8 millions d&#39;abonnés uniques. Bien qu&#39;il existe des preuves que les données sont légitimes, en raison de la difficulté de vérifier catégoriquement la violation chinoise, elles ont été signalées comme « non vérifiées ». Les données de la violation contiennent des noms d&#39;utilisateur, des adresses e-mail et des hachages de mot de passe MD5 salés et ont été fournies à HIBP par Adam Davies, chercheur en sécurité et analyste de données White Hat. <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>","HLTV2016-06-19":"En juin 2016, le site Web « home of competition Counter Strike » <a href=\"http://www.hltv.org/news/18087-security-breach\" target=\"_blank\" rel=\"noopener\">HLTV a été piraté</a> et 611 000 comptes ont été exposés. L&#39;attaque a conduit à l&#39;exposition de noms, de noms d&#39;utilisateur, d&#39;adresses e-mail et de hachages bcrypt de mots de passe.","HomeChef2020-02-10":"Début 2020, le service de livraison de repas <a href=\"https://techcrunch.com/2020/05/20/home-chef-data-breach/\" target=\"_blank\" rel=\"noopener\">Home Chef a subi une violation de données</a> qui a ensuite été vendue en ligne. La violation a exposé les informations personnelles de près de 9 millions de clients, y compris les noms, les adresses IP, les codes postaux, les 4 derniers chiffres des numéros de carte de crédit et les mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","HoundDawgs2017-12-30":"En décembre 2017, le tracker de torrent danois connu sous le nom de <a href=\"https://torrentfreak.com/popular-danish-torrent-tracker-shuts-down-after-hack-180102/\" target=\"_blank\" rel=\"noopener\">HoundDawgs a subi une violation de données</a> . Plus de 55 Go de données ont été vidées publiquement et alors <a href=\"https://www.flashback.org/p62770812\" target=\"_blank\" rel=\"noopener\">qu&#39;il y avait initialement une controverse quant à la gravité de l&#39;incident</a> , les données contenaient en effet plus de 45 000 adresses e-mail uniques complètes de nombreux journaux d&#39;activité de torrent, d&#39;adresses IP et de mots de passe SHA1.","Houzz2018-05-23":"Mi-2018, le site de conception de logements <a href=\"https://help.houzz.com/s/article/security-update?language=en_US\" target=\"_blank\" rel=\"noopener\">Houzz a subi une violation de données</a> . La société a appris l&#39;incident plus tard dans l&#39;année, puis l&#39;a divulgué aux membres concernés en février 2019. Près de 49 millions d&#39;adresses e-mail uniques étaient en cause, ainsi que des noms, des adresses IP, des emplacements géographiques et des mots de passe salés ou des liens vers des profils de réseaux sociaux utilisés. pour s&#39;authentifier auprès du service. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","HTCMania2020-01-04":"En janvier 2020, le forum espagnol de téléphonie mobile <a href=\"https://www.htcmania.com\" target=\"_blank\" rel=\"noopener\">HTC Mania a</a> subi une violation de données du site basé sur vBulletin. L&#39;incident a révélé 1,5 million d&#39;adresses e-mail, de noms d&#39;utilisateur, d&#39;adresses IP, de dates de naissance, de hachages de mots de passe MD5 et d&#39;historiques de mots de passe salés. Les données de la violation ont ensuite été redistribuées sur des sites Web de piratage populaires.","Hub4Tech2017-01-01":"À une date inconnue vers 2017, le service indien de formation et d&#39;évaluation connu sous le nom de <a href=\"https://www.forumcommunity.net/\" target=\"_blank\" rel=\"noopener\">Hub4Tech a</a> subi une violation de données via une attaque par injection SQL. L&#39;incident a révélé près de 37 000 adresses e-mail et mots de passe uniques stockés sous forme de hachages MD5 non salés. Aucune réponse n&#39;a été reçue de Hub4Tech lorsqu&#39;il a été contacté au sujet de l&#39;incident.","Hurb2019-03-14":"Vers mars 2019, l&#39;agence de voyages en ligne brésilienne <a href=\"https://cybleinc.com/2020/07/24/around-43-million-user-records-belonging-to-two-online-platforms-leaked-on-darknet-for-free/\" target=\"_blank\" rel=\"noopener\">Hurb (anciennement Hotel Urbano) a subi une violation de données</a> . Les données sont ensuite apparues en ligne pour téléchargement l&#39;année suivante et comprenaient plus de 20 millions d&#39;enregistrements de clients avec adresses e-mail et IP, noms, dates de naissance, numéros de téléphone et mots de passe stockés sous forme de hachages MD5 non salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","IIMJobs2018-12-31":"En décembre 2018, le portail d&#39;emploi indien <a href=\"https://www.hackread.com/indian-job-portal-iimjobs-hacked-database-leaked/\" target=\"_blank\" rel=\"noopener\">IIMJobs a subi une violation de données qui a exposé 4,1 millions d&#39;adresses e-mail uniques</a> . Les données comprenaient également des noms, des numéros de téléphone, des emplacements géographiques, des dates de naissance, des titres de poste, des demandes d&#39;emploi et des lettres de motivation ainsi que des mots de passe stockés sous forme de hachages MD5 non salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","ILikeCheats2014-10-18":"En octobre 2014, le site Web de triche de jeu connu sous le nom d&#39;ILikeCheats a subi une violation de données qui a exposé 189 000 comptes. Le forum basé sur vBulletin a divulgué des noms d&#39;utilisateur, des adresses IP et e-mail et des hachages MD5 faibles de mots de passe. Les données ont été fournies avec le soutien de <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Imavex2021-08-20":"En août 2021, la société de développement de sites Web <a href=\"https://www.imavex.com/breach-information/\" target=\"_blank\" rel=\"noopener\">Imavex a subi une violation de données qui a exposé 878 000 adresses e-mail uniques</a> . Les données comprenaient des enregistrements d&#39;utilisateurs contenant des noms, des noms d&#39;utilisateur et des mots de passe, certains enregistrements contenant également le sexe et des données partielles de carte de crédit, y compris les 4 derniers chiffres de la carte et la date d&#39;expiration. Des centaines de milliers de soumissions de formulaires et de commandes via les clients Imavex ont également été exposées et contenaient d&#39;autres informations personnelles sur les auteurs et le contenu du formulaire.","iMesh2013-09-22":"En septembre 2013, le client de partage de médias et de fichiers connu sous le nom d&#39; <a href=\"http://www.ibtimes.co.uk/imesh-hack-more-51-million-user-records-former-filesharing-site-sale-dark-web-1565185\" target=\"_blank\" rel=\"noopener\">iMesh a été piraté et environ 50 millions de comptes ont été exposés</a> . Les données ont ensuite été mises en vente sur un site Web du marché noir à la mi-2016 et comprenaient des adresses e-mail et IP, des noms d&#39;utilisateur et des hachages MD5 salés.","imgur2013-09-01":"En septembre 2013, la communauté de partage d&#39;images en ligne <a href=\"http://www.zdnet.com/article/imgur-reveals-hackers-stole-login-data/\" target=\"_blank\" rel=\"noopener\">imgur a subi une violation de données</a> . Une sélection de données contenant 1,7 million d&#39;adresses e-mail et de mots de passe a fait surface plus de 4 ans plus tard en novembre 2017. Bien qu&#39;imgur ait stocké les mots de passe sous forme de hachages SHA-256, les données de la violation contenaient des mots de passe en texte brut suggérant que bon nombre des hachages d&#39;origine avaient été fissuré. imgur indique qu&#39;ils sont passés aux hachages bcrypt en 2016.","IndiaMART2021-05-23":"En août 2021, <a href=\"https://economictimes.indiatimes.com/industry/services/retail/data-breach-or-data-scraping-with-over-38-million-records-up-for-grabs-indiamart-has-some-answering-to-do/articleshow/85563628.cms\" target=\"_blank\" rel=\"noopener\">38 millions d&#39;enregistrements de la société de commerce électronique indienne IndiaMART ont été trouvés sur un forum de piratage populaire</a> . Datées de plusieurs mois plus tôt, les données comprenaient plus de 20 millions d&#39;adresses e-mail uniques ainsi que des noms, des numéros de téléphone et des adresses physiques. Il n&#39;est pas clair si IndiaMART a intentionnellement exposé les attributs de données dans le cadre de la conception prévue de la plate-forme ou si les données ont été obtenues en exploitant une vulnérabilité du service.","IndianRailways2019-10-28":"En novembre 2019, <a href=\"https://medium.com/dvuln/why-you-should-choo-choo-choose-to-have-a-vulnerability-disclosure-policy-2m-accounts-exposed-7cd7eaec4da5\" target=\"_blank\" rel=\"noopener\">le site Web d&#39;Indian Rail a laissé plus de 2 millions d&#39;enregistrements exposés sur une instance de base de données Firebase non protégée</a> . Les données exposées comprenaient 583 000 adresses e-mail uniques ainsi que des noms d&#39;utilisateur et des mots de passe stockés en texte brut.","Intelimost2019-03-10":"En mars 2019,<a href=\"https://techcrunch.com/2019/04/02/inside-a-spam-operation/\" target=\"_blank\" rel=\"noopener\">une opération de spam connue sous le nom d&#39;&quot;Intelimost&quot; a envoyé des millions d&#39;e-mails semblant provenir de personnes que les destinataires connaissaient</a> . Le chercheur en sécurité <a href=\"https://securitydiscovery.com/massive-spam-operation-uncovered-in-a-database-leak/\" target=\"_blank\" rel=\"noopener\">Bob Diachenko a trouvé plus de 3 millions d&#39;adresses e-mail uniques dans une base de données Elasticsearch exposée</a> , ainsi que des mots de passe en texte brut utilisés pour accéder à la boîte aux lettres de la victime et personnaliser le spam.","Interpals2015-11-04":"Fin 2015, le site de correspondance en ligne InterPals a vu son site Web piraté et 3,4 millions de comptes exposés. Les données compromises comprenaient des adresses e-mail, des emplacements géographiques, des dates de naissance et des hachages salés de mots de passe.","iPmart2015-07-01":"En 2015, le <a href=\"http://ipmart-forum.com\" target=\"_blank\" rel=\"noopener\">forum iPmart</a> (maintenant connu sous le nom de Mobi NUKE) a été piraté et les détails de plus de 2 millions de membres du forum ont été exposés. Le forum vBulletin incluait des adresses IP, des dates de naissance et des mots de passe stockés sous forme de hachages salés à l&#39;aide d&#39;une implémentation faible permettant à de nombreux d&#39;être rapidement craqués. 368 000 comptes supplémentaires ont été ajoutés à &quot;Have I Been Pwned&quot; en mars 2016, portant le total à plus de 2,4 millions.","ixigo2019-01-03":"En janvier 2019, le site de réservation de voyages et d&#39;hôtels <a href=\"https://techcrunch.com/2019/02/14/hacker-strikes-again/\" target=\"_blank\" rel=\"noopener\">ixigo a subi une violation de données</a> . Les données sont apparues à la vente sur un marché du Web sombre le mois suivant et comprenaient plus de 17 millions d&#39;adresses e-mail uniques ainsi que les noms, les sexes, les numéros de téléphone, les connexions aux profils Facebook et les mots de passe stockés sous forme de hachages MD5. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;BenjaminBlue@exploit.im&quot;.","James2020-03-25":"En juin 2020, <a href=\"https://www.binarydefense.com/threat_watch/seller-floods-forums-with-stolen-data/\" target=\"_blank\" rel=\"noopener\">14 violations de données non divulguées auparavant sont apparues à la vente,</a> y compris le service de livraison brésilien, &quot;James&quot;. La violation s&#39;est produite en mars 2020 et a exposé 1,5 million d&#39;adresses e-mail uniques, les emplacements des clients exprimés en longitude et latitude et les mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","JD2013-01-01":"En 2013 (date exacte inconnue), le service de commerce électronique chinois <a href=\"https://ecommercechinaagency.com/jd-ecommerce-giant-made-apology-user-data-leakage/\" target=\"_blank\" rel=\"noopener\">JD a subi une violation de données</a> qui a exposé 13 Go de données contenant 77 millions d&#39;adresses e-mail uniques. Les données comprenaient également des noms d&#39;utilisateur, des numéros de téléphone et des mots de passe stockés sous forme de hachage SHA-1. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;white_peacock@riseup.net&quot;.","Jefit2020-08-11":"En août 2020, l&#39;application de suivi d&#39;entraînement <a href=\"https://www.jefit.com/jefit-news-product-updates/jefit-data-incident-public-announcement\" target=\"_blank\" rel=\"noopener\">Jefit a subi une violation de données</a> . Les données ont ensuite été vendues au sein de la communauté du piratage et comprenaient plus de 9 millions d&#39;adresses e-mail et IP, noms d&#39;utilisateur et mots de passe stockés sous forme de hachages vBulletin ou argon2. Plusieurs millions de mots de passe piratés sont apparus plus tard dans une large circulation.","JobAndTalent2018-02-01":"Vers février 2018, <a href=\"https://www.zdnet.com/article/hacker-puts-up-for-sale-third-round-of-hacked-databases-on-the-dark-web/\" target=\"_blank\" rel=\"noopener\">le site Web d&#39;emploi Jobandtalent a subi une violation de données qui est ensuite apparue à la vente aux côtés d&#39;autres violations un an plus tard</a> . L&#39;incident a touché 11 millions d&#39;abonnés et a exposé leurs noms, adresses e-mail et IP et mots de passe stockés sous forme de hachage SHA-1 salé.","JobStreet2012-03-07":"En octobre 2017, le site Web malaisien <a href=\"https://www.lowyat.net/2017/145654/personal-data-millions-malaysians-sale-source-breach-still-unknown/\" target=\"_blank\" rel=\"noopener\">lowyat.net a publié un article sur un ensemble massif de données violées affectant des millions de Malaisiens</a> après que quelqu&#39;un l&#39;ait mis en vente sur leurs forums. Les données couvraient plusieurs violations distinctes, y compris <a href=\"https://www.jobstreet.com/\" target=\"_blank\" rel=\"noopener\">le site Web d&#39;emplois JobStreet</a> qui contenait près de 4 millions d&#39;adresses e-mail uniques. Les dates de la violation indiquent que l&#39;incident s&#39;est produit en mars 2012. Les données sont ensuite apparues librement téléchargeables sur un service caché de Tor et contenaient des informations détaillées sur les demandeurs d&#39;emploi, notamment les noms, les sexes, les dates de naissance, les numéros de téléphone, les adresses physiques et les mots de passe.","KayoMoe2018-09-11":"En septembre 2018, une collection de près de 42 millions de paires d&#39;adresses e-mail et de mots de passe en texte brut a été téléchargée sur le service de partage de fichiers anonyme <a href=\"https://kayo.moe/\" target=\"_blank\" rel=\"noopener\">kayo.moe</a> . L&#39;opérateur du service a contacté HIBP pour signaler les données qui, après une enquête plus approfondie, se sont avérées être une grande liste de bourrage d&#39;informations d&#39;identification. Pour plus d&#39;informations, lisez à propos de <a href=\"https://www.troyhunt.com/the-42m-record-kayo-moe-credential-stuffing-data\" target=\"_blank\" rel=\"noopener\">The 42M Record kayo.moe Credential Stuffing Data</a> .","Kickstarter2014-02-16":"En février 2014, la plateforme de financement participatif <a href=\"https://www.kickstarter.com/blog/important-kickstarter-security-notice\" target=\"_blank\" rel=\"noopener\">Kickstarter a annoncé avoir subi une violation de données</a> . La violation contenait près de 5,2 millions d&#39;adresses e-mail uniques, des noms d&#39;utilisateur et des hachages SHA1 de mots de passe salés.","Kreditplus2020-06-23":"En juin 2020, le service de crédit indonésien <a href=\"https://nakedsecurity.sophos.com/2020/07/02/133m-records-for-sale-as-fruits-of-data-breach-spree-keep-raining-down/\" target=\"_blank\" rel=\"noopener\">Kreditplus a subi une violation de données</a> qui a exposé 896 000 enregistrements contenant 769 000 adresses e-mail uniques. La violation a exposé de nombreuses informations personnelles, notamment les noms, la composition de la famille, des informations sur les conjoints, les revenus et les dépenses, les religions et les informations sur l&#39;emploi. Les données ont été fournies à HIBP par <a href=\"https://breachbase.pw/\" target=\"_blank\" rel=\"noopener\">violationbase.pw</a> .","Lanwar2018-07-28":"En juillet 2018, le personnel du <a href=\"https://lanwar.com/\" target=\"_blank\" rel=\"noopener\">site de jeux Lanwar a</a> découvert une violation de données qui, selon eux, remonte aux mois précédents. Les données contenaient 45 000 noms, adresses e-mail, noms d&#39;utilisateur et mots de passe en texte brut. Un membre du personnel de Lanwar a lui-même soumis la violation à HIBP et a également contacté les autorités compétentes au sujet de l&#39;incident après avoir identifié une tentative de phishing pour extorquer du Bitcoin à un utilisateur.","Lastfm2012-03-22":"En mars 2012, le site de musique <a href=\"https://techcrunch.com/2016/09/01/43-million-passwords-hacked-in-last-fm-breach/\" target=\"_blank\" rel=\"noopener\">Last.fm a été piraté</a> et 43 millions de comptes d&#39;utilisateurs ont été exposés. Alors que <a href=\"http://www.last.fm/passwordsecurity\" target=\"_blank\" rel=\"noopener\">Last.fm était au courant d&#39;un incident en 2012</a> , l&#39;ampleur du piratage n&#39;était pas connue jusqu&#39;à ce que les données soient rendues publiques en septembre 2016. La violation comprenait 37 millions d&#39;adresses e-mail uniques, des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachages MD5 non salés.","Lazada2020-07-30":"En octobre 2020, la <a href=\"https://www.bleepingcomputer.com/news/security/over-1m-lazada-redmart-accounts-sold-online-after-data-breach/\" target=\"_blank\" rel=\"noopener\">nouvelle de la violation de données Lazada RedMart</a> contenant des enregistrements aussi récents que juillet 2020 et vendue via un marché en ligne a été annoncée. Au total, les données contenaient 1,1 million d&#39;adresses e-mail de clients, ainsi que des noms, des numéros de téléphone, des adresses physiques, des numéros de carte de crédit partiels et des mots de passe stockés sous forme de hachage SHA-1.","LeadHunter2020-03-04":"En mars 2020, <a href=\"https://www.troyhunt.com/the-unattributable-lead-hunter-data-breach\" target=\"_blank\" rel=\"noopener\">une énorme quantité d&#39;informations personnelles appelées « Lead Hunter » a</a> été fournie à HIBP après avoir été retrouvée exposée sur un serveur Elasticsearch accessible au public. Les données contenaient 69 millions d&#39;adresses e-mail uniques sur 110 millions de lignes de données accompagnées d&#39;informations personnelles supplémentaires, notamment des noms, des numéros de téléphone, des sexes et des adresses physiques. Au moment de la publication, la violation ne pouvait être attribuée aux personnes responsables de l&#39;obtenir et de l&#39;exposer. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","LeagueOfLegends2012-06-11":"En juin 2012, le jeu en ligne multijoueur <a href=\"https://www.cio.com/article/2395205/security0/european-league-of-legends-game-players-have-their-account-data-compromised.html\" target=\"_blank\" rel=\"noopener\">League of Legends a subi une violation de données</a> . À l&#39;époque, le service comptait plus de 32 millions de comptes enregistrés et la violation affectait divers attributs de données personnelles, notamment les mots de passe &quot;cryptés&quot;. En 2018, un sous-ensemble d&#39;enregistrements de 339 000 données a émergé avec des adresses e-mail, des noms d&#39;utilisateur et des mots de passe en texte brut, probablement craqués à partir de ceux d&#39;origine protégés par cryptographie.","Ledger2020-06-25":"En juin 2020, le fabricant de portefeuilles cryptographiques matériels <a href=\"https://www.ledger.com/addressing-the-july-2020-e-commerce-and-marketing-data-breach\" target=\"_blank\" rel=\"noopener\">Ledger a subi une violation de données qui a exposé plus d&#39;un million d&#39;adresses e-mail</a> . Les données ont été initialement vendues avant d&#39;être vidées publiquement en décembre 2020 et comprenaient des noms, des adresses physiques et des numéros de téléphone. Les données ont été fournies à HIBP par <a href=\"https://twitter.com/UnderTheBreach\" target=\"_blank\" rel=\"noopener\">Alon Gal, CTO de la société de renseignement sur la cybercriminalité Hudson Rock</a> .","Leet2016-09-10":"En août 2016, le service de création et d&#39;exécution de serveurs d&#39;édition Pocket Minecraft connu sous le nom de <a href=\"http://news.softpedia.com/news/data-for-6-million-minecraft-gamers-stolen-from-leet-cc-servers-507445.shtml\" target=\"_blank\" rel=\"noopener\">Leet a été signalé comme ayant subi une violation de données qui a touché 6 millions d&#39;abonnés</a> . L&#39;incident signalé par Softpedia aurait eu lieu plus tôt dans l&#39;année, bien que l&#39;ensemble de données envoyé à HIBP date de début septembre mais ne contenait que 2 millions d&#39;abonnés. Les données comprenaient les noms d&#39;utilisateur, les adresses e-mail et IP et les hachages SHA512. 3 millions de comptes supplémentaires ont été obtenus et ajoutés à HIBP plusieurs jours après le chargement des données initiales, portant le total à plus de 5 millions.","Lifebear2019-02-28":"Au début de 2019, l&#39;application de calendrier japonaise <a href=\"https://www.zdnet.com/article/round-4-hacker-returns-and-puts-26mil-user-records-for-sale-on-the-dark-web/\" target=\"_blank\" rel=\"noopener\">Lifebear est apparue à la vente sur un marché du Web sombre parmi une multitude d&#39;autres sites Web piratés</a> . La violation a exposé près de 3,7 millions d&#39;adresses e-mail, de noms d&#39;utilisateur et de mots de passe uniques stockés sous forme de hachages MD5 salés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;nano@databases.pw&quot;.","Lifeboat2016-01-01":"En janvier 2016, la communauté Minecraft connue sous le nom de Lifeboat a <a href=\"https://motherboard.vice.com/read/another-day-another-hack-7-million-emails-and-hashed-passwords-for-minecraft\" target=\"_blank\" rel=\"noopener\">été piratée et plus de 7 millions de comptes ont fuité</a> . Lifeboat était au courant de l&#39;incident depuis trois mois avant que la violation ne soit rendue publique, mais a choisi de ne pas en informer les clients. Les données divulguées comprenaient des noms d&#39;utilisateur, des adresses e-mail et des mots de passe stockés sous forme de hachages MD5 simples.","Liker2021-03-08":"<a href=\"https://liker.com/\" target=\"_blank\" rel=\"noopener\">En mars 2021, Liker, le</a> &quot;réseau social plus gentil et plus intelligent&quot; autoproclamé, a subi une violation de données, prétendument en représailles à la violation de données de Gab et au grattage des données de Parler. Le site est resté hors ligne après la violation qui a exposé 465 000 adresses e-mail en plus des noms, des dates de naissance, des niveaux d&#39;éducation, des messages privés, des questions de sécurité et des réponses en texte brut, des mots de passe stockés sous forme de hachage bcrypt et d&#39;autres attributs de données personnelles. Liker n&#39;a pas répondu lorsqu&#39;il a été contacté au sujet de la violation.","LinkedIn2012-05-05":"En mai 2016, <a href=\"https://www.troyhunt.com/observations-and-thoughts-on-the-linkedin-data-breach\" target=\"_blank\" rel=\"noopener\">LinkedIn avait 164 millions d&#39;adresses e-mail et de mots de passe exposés</a> . Initialement piratées en 2012, les données sont restées hors de vue jusqu&#39;à ce qu&#39;elles soient proposées à la vente sur un site de dark market 4 ans plus tard. Les mots de passe de la violation ont été stockés sous forme de hachages SHA1 sans sel, dont la grande majorité ont été rapidement déchiffrés dans les jours qui ont suivi la publication des données.","LinkedInScrape2021-04-08":"Au cours du premier semestre 2021, <a href=\"https://www.businessinsider.com.au/linkedin-data-scraped-500-million-users-for-sale-online-2021-4\" target=\"_blank\" rel=\"noopener\">LinkedIn a été la cible d&#39;attaquants qui ont extrait les données de centaines de millions de profils publics et les ont ensuite revendus en ligne</a> . Bien que le grattage ne constitue pas une violation de données et n&#39;ait pas permis d&#39;accéder à des données personnelles non destinées à être accessibles au public, les données étaient toujours monétisées et ensuite largement diffusées dans les cercles de piratage. Les données récupérées contiennent environ 400 millions d&#39;enregistrements avec 125 millions d&#39;adresses e-mail uniques, ainsi que des noms, des emplacements géographiques, des sexes et des titres de poste. LinkedIn aborde spécifiquement l&#39;incident dans son article sur <a href=\"https://news.linkedin.com/2021/june/an-update-from-linkedin\" target=\"_blank\" rel=\"noopener\">Une mise à jour sur le rapport des données grattées</a> .","LinuxForums2018-05-01":"En mai 2018, <a href=\"http://www.linuxforums.org\" target=\"_blank\" rel=\"noopener\">le site Web Linux Forums a</a> subi une violation de données qui a entraîné la divulgation de 276 000 adresses e-mail uniques. Fonctionnant sur une ancienne version de vBulletin, la violation a également révélé des noms d&#39;utilisateur, des adresses IP et des hachages de mot de passe MD5 salés. Les forums Linux n&#39;ont pas répondu aux multiples tentatives de les contacter au sujet de la violation.","LittleMonsters2017-01-01":"Vers janvier 2017, <a href=\"https://www.heise.de/security/meldung/Little-Monsters-Nutzerdaten-aus-Lady-Gagas-Social-Network-sollen-geleakt-sein-3646447.html\" target=\"_blank\" rel=\"noopener\">le site de fans de Lady Gaga connu sous le nom de &quot;Little Monsters&quot; a subi une violation de données qui a touché 1 million de comptes</a> . Les données contenaient des noms d&#39;utilisateur, des adresses e-mail, des dates de naissance et des hachages bcrypt de mots de passe.","LiveAuctioneers2020-06-19":"En juin 2020, la place de marché d&#39;antiquités en ligne <a href=\"https://portswigger.net/daily-swig/liveauctioneers-data-breach-millions-of-cracked-passwords-for-sale-say-researchers\" target=\"_blank\" rel=\"noopener\">LiveAuctioneers a subi une violation de données</a> qui a ensuite été vendue en ligne puis largement redistribuée dans la communauté des hackers. Les données contenaient 3,4 millions d&#39;enregistrements, notamment des noms, des adresses e-mail et IP, des adresses physiques, des numéros de téléphone et des mots de passe stockés sous forme de hachages MD5 non salés. Les données ont été fournies à HIBP par <a href=\"https://breachbase.pw/\" target=\"_blank\" rel=\"noopener\">violationbase.pw</a> .","LiveJournal2017-01-01":"À la mi-2019, la <a href=\"https://news.ycombinator.com/item?id=20426997&fbclid=IwAR22KoBod2B44XzYbPziwh1RoT_M8ll3Uf8Ods7TpF8mPdSGo3PKYQEx9_k\" target=\"_blank\" rel=\"noopener\">nouvelle d&#39;une prétendue violation de données LiveJournal a éclaté</a> . Cela fait suite à <a href=\"https://twitter.com/rahaeli/status/1265316773508927488\" target=\"_blank\" rel=\"noopener\">plusieurs rapports d&#39;abus d&#39;informations d&#39;identification contre Dreamwidth à partir de 2018</a> , un fork de LiveJournal avec un croisement important dans la base d&#39;utilisateurs. La violation remonterait à 2017 et contiendrait 26 millions de noms d&#39;utilisateur et d&#39;adresses e-mail uniques (dont l&#39;existence a été confirmée sur LiveJournal) ainsi que des mots de passe en texte brut. Une archive des données a ensuite été partagée sur un forum de piratage populaire en mai 2020 et largement redistribuée. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;nano@databases.pw&quot;.","Livpure2020-08-29":"En août 2020, le détaillant indien <a href=\"https://cloudsek.com/threatintelligence/over-a-million-pii-of-livpure-customers-leak-on-cybercrime-forum/\" target=\"_blank\" rel=\"noopener\">Livpure a subi une violation de données</a> qui a exposé plus d&#39;un million d&#39;achats de clients avec 270 000 adresses e-mail uniques. Les données comprenaient également les noms, les numéros de téléphone, les adresses physiques et les détails des articles achetés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;white_peacock@riseup.net&quot;.","LizardSquad2015-01-16":"En janvier 2015, le collectif de hackers connu sous le nom de « Lizard Squad » a créé un service DDoS du nom de « Lizard Stresser » qui pourrait être acheté pour lancer des attaques contre des cibles en ligne. Peu de temps après, le service a <a href=\"https://krebsonsecurity.com/2015/01/another-lizard-arrested-lizard-lair-hacked/\">subi une violation de données</a> qui a entraîné la divulgation publique de plus de 13 000 comptes d&#39;utilisateurs, y compris des mots de passe stockés en clair.","Lookbook2012-08-24":"En août 2012, le site de mode <a href=\"https://www.hackread.com/hacker-selling-million-lookbook-accounts/\" target=\"_blank\" rel=\"noopener\">Lookbook a subi une violation de données</a> . Les données ont par la suite été mises en vente en juin 2016 et comprenaient 1,1 million de noms d&#39;utilisateur, adresses e-mail et IP, dates de naissance et mots de passe en texte brut.","LOTR2013-08-01":"En août 2013, le jeu vidéo interactif <a href=\"https://www.lotro.com\" target=\"_blank\" rel=\"noopener\">Lord of the Rings Online a</a> subi une violation de données qui a exposé plus de 1,1 million de comptes de joueurs. Les données étaient activement échangées sur des forums clandestins et comprenaient des adresses e-mail, des dates de naissance et des hachages de mots de passe.","LoungeBoard2013-08-01":"À un moment donné en 2013, 45 000 comptes ont été piratés <a href=\"http://leak.sx/thread-186921\" target=\"_blank\" rel=\"noopener\">du &quot;Forum de discussion générale&quot; du Lounge Board, puis vidés publiquement</a> . Lounge Board était un forum MyBB lancé en 2012 et interrompu à la mi-2013 (la dernière activité dans les journaux datait d&#39;août 2013).","LuminPDF2019-04-01":"En avril 2019, le service de gestion de <a href=\"https://www.zdnet.com/article/data-of-24-3-million-lumin-pdf-users-shared-on-hacking-forum/\" target=\"_blank\" rel=\"noopener\">PDF Lumin PDF a subi une violation de données</a> . La violation n&#39;a été divulguée publiquement qu&#39;en septembre, lorsque 15,5 millions d&#39;enregistrements de données d&#39;utilisateurs ont été téléchargés sur un forum de piratage populaire. Les données avaient été laissées publiquement exposées dans une instance MongoDB, après quoi Lumin PDF aurait été &quot;contacté plusieurs fois, mais ignoré toutes les requêtes&quot;. Les données exposées comprenaient les noms, les adresses e-mail, le sexe, la langue parlée et soit un hachage de mot de passe bcrypt, soit un jeton d&#39;authentification Google. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","MailRu2014-09-10":"En septembre 2014, plusieurs gros dumps de comptes d&#39;utilisateurs sont apparus sur le <a href=\"https://forum.btcsec.com/\" target=\"_blank\" rel=\"noopener\">Forum russe de sécurité Bitcoin,</a> dont un avec près de 5 millions d&#39;adresses e-mail et de mots de passe, principalement sur le domaine mail.ru. Bien qu&#39;il soit <a href=\"http://globalvoicesonline.org/2014/09/10/russia-email-yandex-mailru-passwords-hacking/\" target=\"_blank\" rel=\"noopener\">peu probable qu&#39;elles soient le résultat d&#39;une attaque directe contre mail.ru</a> , les informations d&#39;identification ont été confirmées par beaucoup comme légitimes pour d&#39;autres services auxquels ils s&#39;étaient abonnés. D&#39;autres données prétendument valides pour mail.ru et contenant des adresses e-mail et des mots de passe en texte brut ont été ajoutées en janvier 2018, ce qui porte le total à plus de 16 millions d&#39;enregistrements. L&#39;incident a également été signalé comme « non vérifié », un concept qui a été <a href=\"https://www.troyhunt.com/introducing-unverified-breaches-to-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">introduit après le chargement initial des données en 2014</a> .","MajorGeeks2015-11-15":"En novembre 2015, près de 270 000 comptes du forum d&#39;assistance <a href=\"http://www.majorgeeks.com\" target=\"_blank\" rel=\"noopener\">MajorGeeks ont été piratés.</a> Les comptes étaient activement vendus et échangés en ligne et comprenaient des adresses e-mail, des hachages de mots de passe salés et des adresses IP.","MangaTraders2014-06-09":"En juin 2014, le site de trading Manga <a href=\"http://www.mangatraders.com\" target=\"_blank\" rel=\"noopener\">Mangatraders.com a</a> vu les noms d&#39;utilisateur et les mots de passe de plus de 900 000 utilisateurs <a href=\"http://boards.4chan.org/a/thread/108603065/mangatraders-has-been-hacked-emails-and-passwords\" target=\"_blank\" rel=\"noopener\">divulgués sur Internet</a> (environ 855 000 des e-mails étaient uniques). Les mots de passe ont été faiblement hachés avec une seule itération de MD5, les laissant vulnérables à un piratage facile.","MangaDex2021-03-22":"En mars 2021, le site de fans de mangas <a href=\"https://portswigger.net/daily-swig/mangadex-website-taken-offline-following-cyber-attack-data-breach\" target=\"_blank\" rel=\"noopener\">MangaDex a subi une violation de données</a> qui a entraîné l&#39;exposition de près de 3 millions d&#39;abonnés. Les données comprenaient les adresses e-mail et IP, les noms d&#39;utilisateur et les mots de passe stockés sous forme de hachage bcrypt. Les données ont ensuite été diffusées au sein de groupes de piratage.","MangaFox2016-06-01":"Vers juillet 2016, le site Web manga connu sous le nom de <a href=\"http://mangafox.me\" target=\"_blank\" rel=\"noopener\">mangafox.me a</a> subi une violation de données. Le forum basé sur vBulletin a exposé 1,3 million de comptes, y compris les noms d&#39;utilisateur, les adresses e-mail et IP, les dates de naissance et les hachages de mot de passe MD5 salés.","Mashable2020-06-01":"Vers la mi-2020, <a href=\"https://portswigger.net/daily-swig/data-breach-at-mashable-leaks-users-nbsp-personal-information-online\" target=\"_blank\" rel=\"noopener\">Mashable a subi une violation de données</a> qui s&#39;est ensuite révélée publique en novembre 2020. Les données comprenaient 1,4 million d&#39;adresses e-mail uniques ainsi que les noms, les sexes, les jetons d&#39;authentification expirés, les emplacements physiques, les liens vers les profils de réseaux sociaux et les jours et mois. de naissance. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","MasterDeeds2017-03-14":"En mars 2017, un fichier de sauvegarde de la base de données de 27 Go nommé « Master Deeds » a été envoyé à HIBP par un partisan du projet. Après une analyse détaillée plus tard dans l&#39;année, le fichier s&#39;est avéré contenir les données personnelles de dizaines de millions de résidents sud-africains vivants et décédés. Les données comprenaient de nombreux attributs personnels tels que les noms, adresses, ethnies, sexes, dates de naissance, numéros d&#39;identification personnels émis par le gouvernement et 2,2 millions d&#39;adresses e-mail. Au moment de la publication,<a href=\"https://www.iafrikan.com/2017/10/18/dracore-data-sciences/\" target=\"_blank\" rel=\"noopener\">il est allégué que les données provenaient de Dracore Data Sciences</a> (Dracore n&#39;a pas encore confirmé ou infirmé publiquement que les données provenaient de leurs systèmes). Le 18 octobre 2017, il a été constaté que le fichier avait été publié sur un serveur Web accessible au public où il se trouvait à la racine d&#39;une adresse IP avec la liste des répertoires activée. Le dossier était daté du 8 avril 2015.","MastercardPricelessSpecials2019-08-20":"En août 2019, <a href=\"https://www.spiegel.de/netzwelt/web/mastercard-datenleck-bei-bonusprogramm-a-1282697.html\" target=\"_blank\" rel=\"noopener\">le programme de bonus allemand Mastercard &quot;Priceless Specials&quot; a subi une violation de données</a> . Les données personnelles de près de 90 000 membres du programme ont ensuite été largement diffusées en ligne et comprenaient des noms, des adresses e-mail et IP, des numéros de téléphone et des données partielles de carte de crédit. À la suite de l&#39;incident, le programme a par la suite été suspendu.","Mathway2020-01-13":"En janvier 2020, le site Web de résolution de mathématiques <a href=\"https://www.zdnet.com/article/25-million-user-records-leak-online-from-popular-math-app-mathway/\" target=\"_blank\" rel=\"noopener\">Mathway a subi une violation de données qui a exposé plus de 25 millions d&#39;enregistrements</a> . Les données ont ensuite été vendues sur un marché du Web sombre et comprenaient des noms, des identifiants Google et Facebook, des adresses e-mail et des hachages de mots de passe salés.","MCBans2016-10-27":"En octobre 2016, le service d&#39;interdiction de Minecraft connu sous le nom de <a href=\"https://www.mcbans.com/\" target=\"_blank\" rel=\"noopener\">MCBans a</a> subi une violation de données entraînant l&#39;exposition de 120 000 enregistrements d&#39;utilisateurs uniques. Les données contenaient des adresses e-mail et IP, des noms d&#39;utilisateur et des hachages de mots de passe de format inconnu. Le site a déjà été signalé comme compromis dans le répertoire de la base de données violée <a href=\"https://vigilante.pw/\" target=\"_blank\" rel=\"noopener\">Vigilante.pw.</a>","MDPI2016-08-30":"En août 2016, l&#39;éditeur suisse en libre accès savant connu sous le nom de <a href=\"http://mdpi.com\" target=\"_blank\" rel=\"noopener\">MDPI</a> disposait de 17,5 Go de données obtenues à partir d&#39;une instance de base de données Mongo non protégée. Les données contenaient des échanges de courriers électroniques entre MDPI et leurs auteurs et réviseurs, qui comprenaient 845 000 adresses électroniques uniques. MDPI a confirmé que le système est depuis protégé et qu&#39;aucune donnée à caractère sensible n&#39;a été impactée. À ce titre, ils ont conclu que la notification à leurs abonnés n&#39;était pas nécessaire en raison du fait que tous leurs auteurs et réviseurs sont disponibles en ligne sur leur site Web.","Minted2020-05-06":"En mai 2020, le marché en ligne des artistes indépendants <a href=\"https://www.bleepingcomputer.com/news/security/minted-discloses-data-breach-after-5m-user-records-sold-online/\" target=\"_blank\" rel=\"noopener\">Minted a subi une violation de données</a> qui a exposé 4,4 millions d&#39;enregistrements de clients uniques vendus par la suite sur un marché du Web sombre. Les données exposées comprenaient également des noms, des adresses physiques, des numéros de téléphone et des mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","MMGFusion2020-12-20":"En décembre 2020, le service de gestion de cabinet dentaire <a href=\"https://www.riskbasedsecurity.com/2021/02/19/dark-web-roundup-january-2021/\" target=\"_blank\" rel=\"noopener\">MMG Fusion a été victime d&#39;une violation de données</a> qui a exposé 2,6 millions d&#39;adresses e-mail uniques. Les données comprenaient également les rendez-vous des patients, les noms, les numéros de téléphone, les dates de naissance, les sexes et les adresses physiques. Un petit nombre d&#39;enregistrements incluaient également des mots de passe stockés sous forme de hachages bcrypt.","MoDaCo2016-01-01":"Vers janvier 2016, la communauté Android basée au Royaume-Uni connue sous le nom de <a href=\"http://www.modaco.com\" target=\"_blank\" rel=\"noopener\">MoDaCo a</a> subi une violation de données qui a exposé 880 000 identités d&#39;abonnés. Les données comprenaient les adresses e-mail et IP, les noms d&#39;utilisateur et les mots de passe stockés sous forme de hachages MD5 salés.","Moneycontrol2017-09-07":"En avril 2021, des <a href=\"https://www.opindia.com/2021/04/personal-details-of-over-seven-lakh-moneycontrol-users-up-for-sale/\" target=\"_blank\" rel=\"noopener\">pirates ont mis en vente des données provenant de la plateforme financière indienne en ligne Moneycontrol</a> . Les données comprenaient 763 000 adresses e-mail uniques (prétendument un sous-ensemble d&#39;une violation de compte plus importante de 40 millions), ainsi que des emplacements géographiques, des numéros de téléphone, des sexes, des dates de naissance et des mots de passe en texte brut. La date de la violation d&#39;origine n&#39;est pas claire, bien que les données violées indiquent que le fichier a été créé en septembre 2017 et Moneycontrol a déclaré que la violation est « un ancien ensemble de données ».","MoreleNet2018-10-10":"En octobre 2018, le site de commerce électronique polonais <a href=\"https://niebezpiecznik.pl/post/morele-potwierdza-ze-wykradziono-dane-klientow/\" target=\"_blank\" rel=\"noopener\">Morele.net a subi une violation de données</a> . L&#39;incident a révélé près de 2,5 millions d&#39;adresses e-mail uniques ainsi que des numéros de téléphone, des noms et des mots de passe stockés sous forme de hachage md5crypt.","MortalOnline2018-06-17":"En juin 2018, le jeu de rôle en ligne massivement multijoueur (MMORPG) <a href=\"https://account.mortalonline.com/breach.html\" target=\"_blank\" rel=\"noopener\">Mortal Online a subi une violation de données</a> . Un fichier contenant 570 000 adresses e-mail et mots de passe piratés a ensuite été diffusé en ligne. Un fichier plus volumineux et plus complet contenant 607 000 adresses e-mail avec des hachages de mot de passe MD5 non salés d&#39;origine ainsi que des noms, des noms d&#39;utilisateur et des adresses physiques a ensuite été fourni et la violation d&#39;origine dans HIBP a été mise à jour en conséquence. Les données ont été fournies à HIBP par Adam Davies, chercheur en sécurité Whitehat et analyste de données.","MPGH2015-10-22":"En octobre 2015, le site Web de piratage de jeux multijoueurs <a href=\"http://www.mpgh.net\">MPGH a été piraté</a> et 3,1 millions de comptes d&#39;utilisateurs ont été divulgués. La violation du forum vBulletin contenait des noms d&#39;utilisateur, des adresses e-mail, des adresses IP et des hachages salés de mots de passe.","MrExcel2016-12-05":"En décembre 2016, le forum du site de conseils et solutions Microsoft Excel <a href=\"http://www.mrexcel.com/details-of-data-breach-at-mrexcel-com/\" target=\"_blank\" rel=\"noopener\">Mr Excel a subi une violation de données</a> . Le piratage du forum vBulletin a conduit à l&#39;exposition de plus de 366 000 comptes ainsi que des adresses e-mail et IP, des dates de naissance et des mots de passe salés hachés avec MD5. Le propriétaire du forum MrExcel a ensuite soumis lui-même les données à HIBP.","mSpy2015-05-14":"En mai 2015, le logiciel de « surveillance » connu sous le nom de <a href=\"http://www.mspy.com\" target=\"_blank\" rel=\"noopener\">mSpy a</a> subi une <a href=\"http://krebsonsecurity.com/2015/05/mobile-spy-software-maker-mspy-hacked-customer-data-leaked/#more-30913\" target=\"_blank\" rel=\"noopener\">importante violation de données</a> . Le logiciel (prétendument utilisé pour espionner des victimes sans méfiance), stockait de nombreuses informations personnelles au sein de leur service en ligne qui, après avoir été violées, étaient mises gratuitement à disposition sur Internet.","MuslimDirectory2014-02-17":"En février 2014, le guide britannique des services et des affaires connu sous le nom de Muslim Directory a été <a href=\"http://www.cyberwarnews.info/2014/02/17/muslim-directory-hacked-38903-user-credentials-leaked/\" target=\"_blank\" rel=\"noopener\">attaqué par le pirate informatique connu sous le nom de @th3inf1d3l</a> . Les données ont donc été vidées publiquement et comprenaient les comptes Web de dizaines de milliers d&#39;utilisateurs qui contenaient des données telles que leurs noms, adresse personnelle, groupe d&#39;âge, e-mail, activité sur le site Web et mot de passe en texte clair.","MyFHA2015-02-18":"Vers février 2015, le site de financement <a href=\"https://web.archive.org/web/20180324231131/http://myfha.net/\" target=\"_blank\" rel=\"noopener\">immobilier MyFHA a</a> subi une violation de données qui a divulgué les informations personnelles de près d&#39;un million de personnes. Les données comprenaient de nombreuses informations personnelles relatives au financement immobilier, notamment des informations de contact personnelles, des statuts de crédit, des revenus du ménage, des montants de prêt et des notes sur la situation personnelle, faisant souvent référence à des problèmes juridiques, des divorces et des problèmes de santé. Plusieurs parties ont contacté HIBP avec les données, après quoi MyFHA a été alerté à la mi-juillet et a reconnu la légitimité de la violation, puis a mis le site hors ligne.","MyFitnessPal2018-02-01":"En février 2018, le service de régime et d&#39;exercice <a href=\"https://content.myfitnesspal.com/security-information/FAQ.html\" target=\"_blank\" rel=\"noopener\">MyFitnessPal a subi une violation de données</a> . L&#39;incident a révélé 144 millions d&#39;adresses e-mail uniques ainsi que des noms d&#39;utilisateur, des adresses IP et des mots de passe stockés sous forme de hachage SHA-1 et bcrypt (le premier pour les comptes antérieurs, le second pour les comptes plus récents). En 2019, <a href=\"https://www.theregister.co.uk/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">les données sont apparues en vente sur un marché du Web sombre</a> (avec plusieurs autres violations importantes) et ont ensuite commencé à circuler plus largement. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;BenjaminBlue@exploit.im&quot;.","MyHeritage2017-10-26":"En octobre 2017, le site de généalogie <a href=\"https://blog.myheritage.com/2018/06/myheritage-statement-about-a-cybersecurity-incident/\" target=\"_blank\" rel=\"noopener\">MyHeritage a subi une violation de données</a> . L&#39;incident a été signalé 7 mois plus tard après qu&#39;un chercheur en sécurité a découvert les données et contacté MyHeritage. Au total, plus de 92 millions d&#39;enregistrements de clients ont été exposés et comprenaient des adresses e-mail et des hachages de mot de passe SHA-1 salés. En 2019, <a href=\"https://www.theregister.co.uk/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">les données sont apparues en vente sur un marché du Web sombre</a> (avec plusieurs autres violations importantes) et ont ensuite commencé à circuler plus largement. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;BenjaminBlue@exploit.im&quot;.","MySpace2008-07-01":"Vers 2008, <a href=\"http://motherboard.vice.com/read/427-million-myspace-passwords-emails-data-breach\" target=\"_blank\" rel=\"noopener\">MySpace a subi une violation de données qui a exposé près de 360 millions de comptes</a> . En mai 2016, les données ont été proposées à la vente sur le site Web du marché noir « Real Deal » et comprenaient les adresses e-mail, les noms d&#39;utilisateur et les hachages SHA1 des 10 premiers caractères du mot de passe convertis en minuscules et stockés sans sel. La date exacte de la violation est inconnue, mais l&#39; <a href=\"https://www.troyhunt.com/dating-the-ginormous-myspace-breach\" target=\"_blank\" rel=\"noopener\">analyse des données suggère qu&#39;il s&#39;est écoulé 8 ans avant d&#39;être rendues publiques</a> .","NemoWeb2016-09-04":"En septembre 2016, près de 21 Go de données du site Web français utilisé pour les &quot;moyens d&#39;échange standardisés et décentralisés pour la publication d&#39;articles de groupes de discussion&quot; <a href=\"http://www.nemoweb.net/\" target=\"_blank\" rel=\"noopener\">NemoWeb ont</a> été divulgués à partir de ce qui semble avoir été une base de données Mongo non protégée. Les données consistaient en un grand volume d&#39;e-mails envoyés au service et comprenaient près de 3,5 millions d&#39;adresses uniques, bien que beaucoup d&#39;entre elles soient générées automatiquement. Plusieurs tentatives ont été faites pour contacter les opérateurs de NemoWeb mais aucune réponse n&#39;a été reçue.","Neopets2013-05-05":"En mai 2016, <a href=\"http://motherboard.vice.com/read/neopets-hack-another-day-another-hack-tens-of-millions-of-neopets-accounts\" target=\"_blank\" rel=\"noopener\">un ensemble de données piratées provenant du site Web virtuel pour animaux de compagnie « Neopets » a été retrouvé en train d&#39;être échangé en ligne</a> . Prétendument piratées « plusieurs années auparavant », les données contiennent des informations personnelles sensibles, notamment les dates de naissance, les sexes et les noms, ainsi que près de 27 millions d&#39;adresses e-mail uniques. Les mots de passe étaient stockés en clair et les adresses IP étaient également présentes dans la violation.","NetEase2015-10-19":"En octobre 2015, le site chinois connu sous le nom de <a href=\"http://www.163.com\" target=\"_blank\" rel=\"noopener\">NetEase</a> (situé à <a href=\"http://www.163.com\" target=\"_blank\" rel=\"noopener\">163.com</a> ) a été <a href=\"http://news.mydrivers.com/1/452/452173.htm\" target=\"_blank\" rel=\"noopener\">signalé comme ayant subi une violation de données qui a touché des centaines de millions d&#39;abonnés</a> . Bien qu&#39;il existe des preuves que les données elles-mêmes sont légitimes (plusieurs abonnés HIBP ont confirmé qu&#39;un mot de passe qu&#39;ils utilisent figure dans les données), en raison de la difficulté de vérifier avec force la violation chinoise, elle a été signalée comme « non vérifiée ». Les données de la violation contiennent des adresses e-mail et des mots de passe en texte brut. <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>","Neteller2010-05-17":"En mai 2010, le service de portefeuille électronique connu sous le nom de Neteller a <a href=\"http://www.forbes.com/sites/thomasbrewster/2015/11/30/paysafe-optimal-neteller-moneybookers-gambling-cyberattacks-data-breach/\" target=\"_blank\" rel=\"noopener\">subi une violation de données qui a exposé plus de 3,6 millions de clients</a> . La violation n&#39;a été découverte qu&#39;en octobre 2015 et comprenait des noms, des adresses e-mail, des adresses personnelles et des soldes de compte.","NetGalley2020-12-21":"En décembre 2020, le site de promotion de livres <a href=\"https://www.bleepingcomputer.com/news/security/netgalley-discloses-data-breach-after-website-was-hacked/\" target=\"_blank\" rel=\"noopener\">NetGalley a subi une violation de données</a> . L&#39;incident a révélé 1,4 million d&#39;adresses e-mail uniques ainsi que des noms, des noms d&#39;utilisateur, des adresses physiques et IP, des numéros de téléphone, des dates de naissance et des mots de passe stockés sous forme de hachages SHA-1 salés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à pompompurin@riseup.net.","Netlog2012-11-01":"En juillet 2018, le site de réseau social belge <a href=\"https://oag.ca.gov/system/files/Communication%20to%20Users%20-%20FINAL_0.pdf\" target=\"_blank\" rel=\"noopener\">Netlog a identifié une violation de données de leurs systèmes remontant à novembre 2012 (PDF)</a> . Bien que le service ait été interrompu en 2015, la violation de données a toujours touché 49 millions d&#39;abonnés pour lesquels des adresses e-mail et des mots de passe en texte brut ont été exposés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","NextGenUpdate2014-04-22":"Au début de 2014, le site Web de jeux vidéo <a href=\"http://www.nextgenupdate.com\" target=\"_blank\" rel=\"noopener\">NextGenUpdate</a> aurait <a href=\"https://leakforums.org/thread-265363\" target=\"_blank\" rel=\"noopener\">subi une violation de données</a> qui aurait divulgué près de 1,2 million de comptes. Parmi les violations de données figuraient les noms d&#39;utilisateur, les adresses e-mail, les adresses IP et les mots de passe salés et hachés.","NexusMods2013-07-22":"En décembre 2015, le site de modding de jeux Nexus Mods a <a href=\"http://www.nexusmods.com/games/news/12670/\" target=\"_blank\" rel=\"noopener\">publié une déclaration informant les utilisateurs qu&#39;ils avaient été piratés</a> . Ils ont par la suite daté le piratage comme ayant eu lieu en juillet 2013, bien qu&#39;il existe des preuves suggérant que les données étaient échangées des mois avant cela. La violation contenait des noms d&#39;utilisateur, des adresses e-mail et des mots de passe stockés sous forme de hachage salé.","Nihonomaru2015-12-01":"Fin 2015, la communauté des animes connue sous le nom de Nihonomaru a vu son forum vBulletin piraté et 1,7 million de comptes exposés. Les données compromises comprenaient des adresses e-mail et IP, des noms d&#39;utilisateur et des hachages salés de mots de passe.","Nitro2020-09-28":"En septembre 2020, <a href=\"https://www.bleepingcomputer.com/news/security/massive-nitro-data-breach-impacts-microsoft-google-apple-more/\" target=\"_blank\" rel=\"noopener\">le service Nitro PDF a subi une violation de données massive qui a exposé plus de 70 millions d&#39;adresses e-mail uniques</a> . La violation a également exposé les noms, les hachages de mot de passe bcrypt et les titres des documents convertis. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Nival2016-02-29":"En février 2016, la société de jeux russe <a href=\"http://nival.com\" target=\"_blank\" rel=\"noopener\">Nival a</a> été la cible d&#39;une attaque qui a par conséquent été <a href=\"https://www.reddit.com/r/pwned/comments/47u1bf/operation_wrath_of_anakin_evolved\" target=\"_blank\" rel=\"noopener\">détaillée sur Reddit</a> . Prétendument pour protester contre « la politique étrangère de la Russie à l&#39;égard de l&#39;Ukraine », Nival était l&#39;un des nombreux sites russes impliqués dans la brèche et a touché plus de 1,5 million de comptes, y compris des informations personnelles sensibles.","Nulled2016-05-06":"En mai 2016, le forum communautaire de cracking connu sous le nom de <a href=\"http://nulled.cr/\" target=\"_blank\" rel=\"noopener\">Nulled.cr a</a> été piraté et 599 000 comptes d&#39;utilisateurs ont été divulgués publiquement. Les données compromises comprenaient des adresses e-mail et IP, des hachages de mots de passe MD5 salés faibles et des centaines de milliers de messages privés entre les membres.","OGUsers2018-12-26":"En mai 2019, le forum de piratage de compte et d&#39;échange de carte SIM <a href=\"https://krebsonsecurity.com/2019/05/account-hijacking-forum-ogusers-hacked/\" target=\"_blank\" rel=\"noopener\">OGusers a subi une violation de données</a> . La violation a exposé une sauvegarde de base de données de décembre 2018 qui a été publiée sur un forum de piratage rival. Il y avait 161 000 adresses e-mail uniques réparties sur 113 000 utilisateurs du forum et d&#39;autres tables dans la base de données. Les données exposées comprenaient également des noms d&#39;utilisateur, des adresses IP, des messages privés et des mots de passe stockés sous forme de hachages MD5 salés.","OGUsers20202020-04-02":"En avril 2020, le forum de piratage de compte et d&#39;échange de carte SIM <a href=\"https://www.zdnet.com/article/hacking-forum-gets-hacked-for-the-second-time-in-a-year/\" target=\"_blank\" rel=\"noopener\">OGUsers a subi sa deuxième violation de données en moins d&#39;un an</a> . Comme pour la violation précédente, les données exposées comprenaient les adresses e-mail et IP, les noms d&#39;utilisateur, les messages privés et les mots de passe stockés sous forme de hachages MD5 salés. Un total de 263 000 adresses e-mail sur des comptes d&#39;utilisateurs et d&#39;autres tableaux ont été publiés sur un forum de piratage rival.","OnlinerSpambot2017-08-28":"En août 2017, un spambot du nom de <a href=\"https://benkowlab.blogspot.com.au/2017/08/from-onliner-spambot-to-millions-of.html\" target=\"_blank\" rel=\"noopener\">Onliner Spambot a été identifié par le chercheur en sécurité Benkow moʞuƎq</a> . Le logiciel malveillant contenait un composant basé sur un serveur situé sur une adresse IP aux Pays-Bas qui a exposé un grand nombre de fichiers contenant des informations personnelles. Au total, il y avait 711 millions d&#39;adresses e-mail uniques, dont beaucoup étaient également accompagnées des mots de passe correspondants. Un article complet sur les données trouvées se trouve dans l&#39;article de blog intitulé <a href=\"https://www.troyhunt.com/inside-the-massive-711-million-record-onliner-spambot-dump\" target=\"_blank\" rel=\"noopener\">Inside the Massive 711 Million Record Onliner Spambot Dump</a> .","Onverse2016-01-01":"En janvier 2016, le monde virtuel en ligne connu sous le nom d&#39; <a href=\"http://www.onverse.com\" target=\"_blank\" rel=\"noopener\">Onverse a</a> été piraté et 800 000 comptes ont été exposés. En plus des adresses e-mail et IP, le site a également exposé des hachages de mot de passe MD5 salés.","OpenCSGO2017-11-28":"En décembre 2017, le site d&#39;achat de skins Counter-Strike connu sous le nom d&#39; <a href=\"http://opencsgo.com\" target=\"_blank\" rel=\"noopener\">Open CS:GO</a> (Counter-Strike : Global Offensive) a subi une violation de données (adresse depuis la redirection vers dropgun.com). Le fichier de 10 Go contenait une grande quantité d&#39;informations personnelles, notamment des adresses e-mail et IP, des numéros de téléphone, des adresses physiques et des historiques d&#39;achat. <a href=\"https://www.troyhunt.com/streamlining-data-breach-disclosures-a-step-by-step-process\" target=\"_blank\" rel=\"noopener\">De nombreuses tentatives ont été faites pour contacter Open CS:GO au sujet de l&#39;incident</a> , mais aucune réponse n&#39;a été reçue.","OrderSnapp2020-06-29":"En juin 2020, le fournisseur de solutions de restauration <a href=\"https://www.riskbasedsecurity.com/2021/01/25/shinyhunters-wave-3-one-hacker-exposes-over-125-million-credentials/\" target=\"_blank\" rel=\"noopener\">OrderSnapp a subi une violation de données</a> qui a exposé 1,3 million d&#39;adresses e-mail uniques. Les données concernées comprenaient également les noms, les numéros de téléphone, les dates de naissance et les mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","OVH2015-05-01":"Mi-2015, le forum de l&#39;hébergeur <a href=\"https://www.ovh.com\" target=\"_blank\" rel=\"noopener\">OVH a</a> subi une violation de données. Le forum vBulletin contenait 453 000 comptes, y compris les noms d&#39;utilisateur, les adresses e-mail et IP et les mots de passe stockés sous forme de hachage MD5 salé.","OwnedCore2013-08-01":"Vers août 2013, le forum des exploits de World of Warcraft connu sous le nom de <a href=\"http://www.ownedcore.com\" target=\"_blank\" rel=\"noopener\">OwnedCore a</a> été piraté et plus de 880 000 comptes ont été exposés. Le forum vBulletin incluait des adresses IP et des mots de passe stockés sous forme de hachages salés à l&#39;aide d&#39;une implémentation faible permettant à de nombreux d&#39;être rapidement craqués.","Oxfam2021-01-20":"En janvier 2021, <a href=\"https://www.oxfam.org.au/updates-suspected-data-incident/\" target=\"_blank\" rel=\"noopener\">Oxfam Australie a été victime d&#39;une violation de données</a> qui a révélé 1,8 million d&#39;adresses e-mail uniques de sympathisants de l&#39;association. Les données ont été mises en vente sur un forum de piratage populaire et comprenaient également des noms, des numéros de téléphone, des adresses, des sexes et des dates de naissance. Un petit nombre de personnes ont également eu des données partielles de carte de crédit exposées (les 6 premiers et les 3 derniers chiffres de la carte, plus le type et l&#39;expiration de la carte) et dans certains cas, le nom de la banque, le numéro de compte et le BSB ont également été exposés. Les données ont ensuite été mises à disposition gratuitement sur le forum de piratage plus tard le mois suivant.","PaddyPower2010-10-25":"En octobre 2010, le bookmaker irlandais <a href=\"http://www.telegraph.co.uk/technology/internet-security/11005558/Irish-government-disappointed-over-Paddy-Power-hack.html\" target=\"_blank\" rel=\"noopener\">Paddy Power a subi une violation de données</a> qui a exposé 750 000 enregistrements de clients avec près de 600 000 adresses e-mail uniques. La violation n&#39;a été divulguée qu&#39;en juillet 2014 et contenait de nombreuses informations personnelles, notamment des noms, des adresses, des numéros de téléphone et des questions et réponses de sécurité en texte brut.","ParkMobile2021-03-21":"En mars 2021, le service d&#39;application de stationnement mobile <a href=\"https://krebsonsecurity.com/2021/04/parkmobile-breach-exposes-license-plate-data-mobile-numbers-of-21m-users/\" target=\"_blank\" rel=\"noopener\">ParkMobile a subi une violation de données qui a exposé 21 millions de données personnelles de clients</a> . Les données concernées comprenaient les adresses e-mail, les noms, les numéros de téléphone, les plaques d&#39;immatriculation des véhicules et les mots de passe stockés sous forme de hachages bcrypt. Le mois suivant, les données sont apparues sur un forum de piratage public où elles ont été largement redistribuées.","Patreon2015-10-01":"En octobre 2015, le site de financement participatif <a href=\"http://www.zdnet.com/article/patreon-hacked-anonymous-patrons-exposed/\" target=\"_blank\" rel=\"noopener\">Patreon a été piraté</a> et plus de 16 Go de données ont été rendus publics. Le vidage comprenait près de 14 Go d&#39;enregistrements de base de données avec plus de 2,3 millions d&#39;adresses e-mail uniques, des millions de messages personnels et de mots de passe stockés sous forme de hachage bcrypt.","PayAsUGym2016-12-15":"En décembre 2016, <a href=\"https://twitter.com/real_1x0123/status/809443917984911364\" target=\"_blank\" rel=\"noopener\">un attaquant a pénétré le site Web de PayAsUGym,</a> exposant plus de 400 000 données personnelles de clients. Les données ont donc été divulguées publiquement et largement diffusées via Twitter. Les données divulguées contenaient des informations personnelles, notamment des adresses e-mail et des mots de passe hachés à l&#39;aide de MD5 sans sel.","Peatix2019-01-20":"En janvier 2019, la plateforme d&#39;organisation d&#39;événements <a href=\"https://www.zdnet.com/article/hacker-leaks-the-user-data-of-event-management-app-peatix/\" target=\"_blank\" rel=\"noopener\">Peatix a subi une violation de données</a> . L&#39;incident a révélé 4,2 millions d&#39;adresses e-mail, de noms et de mots de passe salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Pemiblanc2018-04-02":"En avril 2018, une liste de bourrage d&#39;informations d&#39;identification contenant 111 millions d&#39;adresses e-mail et de mots de passe connue sous le nom de <a href=\"https://www.troyhunt.com/the-111-million-pemiblanc-credential-stuffing-list\" target=\"_blank\" rel=\"noopener\">Pemiblanc a</a> été découverte sur un serveur français. La liste contenait des adresses e-mail et des mots de passe collectés à partir de différentes violations de données et utilisés pour lancer des attaques de prise de contrôle de compte contre d&#39;autres services. <a href=\"https://www.troyhunt.com/the-111-million-pemiblanc-credential-stuffing-list\" target=\"_blank\" rel=\"noopener\">En savoir plus sur l&#39;incident.</a>","PeoplesEnergy2020-12-16":"En décembre 2020, la compagnie d&#39;électricité britannique <a href=\"https://www.bbc.com/news/technology-55350995\" target=\"_blank\" rel=\"noopener\">People&#39;s Energy a subi une violation de données</a> . La violation a exposé près de 7 Go de fichiers contenant 359 000 adresses e-mail uniques ainsi que des noms, numéros de téléphone, adresses physiques et dates de naissance. L&#39;incident comprenait également les adresses e-mail du personnel de People&#39;s Energy et les hachages de mot de passe bcrypt (aucun mot de passe client n&#39;a été exposé). Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à pompompurin@riseup.net.","PetFlow2017-12-09":"En décembre 2017, le service de livraison de soins pour animaux <a href=\"https://techcrunch.com/2019/02/14/hacker-strikes-again/\" target=\"_blank\" rel=\"noopener\">PetFlow a subi une violation de données qui est par conséquent apparue à la vente sur un marché du dark web</a> . Près d&#39;un million de comptes ont été touchés et des adresses e-mail et des mots de passe exposés ont été stockés sous forme de hachages MD5 non salés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;nano@databases.pw&quot;.","PhoneHouse2021-04-08":"En avril 2021, le détaillant espagnol <a href=\"https://thetechzone.online/cyberattack-on-phone-house-with-ransomware-and-possible-data-breach/\" target=\"_blank\" rel=\"noopener\">Phone House aurait subi une attaque de ransomware qui aurait également exposé d&#39;importants volumes de données client</a> . Attribuée au ransomware Babuk, une collection de données prétendument un sous-ensemble d&#39;un corpus plus important a été publiée sur un site Web sombre et contenait 5,2 millions d&#39;adresses e-mail ainsi que les noms, nationalités, sexes, dates de naissance, numéros de téléphone et adresses physiques. Phone House a été menacé de nouvelles libérations si une rançon n&#39;est pas payée.","PHPFreaks2015-10-27":"En octobre 2015, le forum de discussion <a href=\"http://forums.phpfreaks.com/topic/298874-alert-the-phpfreaks-forum-members-data-appears-to-have-been-stolen\" target=\"_blank\" rel=\"noopener\">PHP PHP Freaks a été piraté</a> et 173 000 comptes d&#39;utilisateurs ont été divulgués publiquement. La violation comprenait plusieurs attributs de données personnelles ainsi que des mots de passe salés et hachés.","Pixlr2020-10-07":"En octobre 2020, l&#39;application de retouche photo en ligne <a href=\"https://www.bleepingcomputer.com/news/security/hacker-posts-19-million-pixlr-user-records-for-free-on-forum/\" target=\"_blank\" rel=\"noopener\">Pixlr a subi une violation de données</a> exposant 1,9 million d&#39;abonnés. Les données concernées comprenaient les noms, les adresses e-mail, les profils de réseaux sociaux, le pays d&#39;inscription et les mots de passe stockés sous forme de hachage SHA-512. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","piZap2017-12-07":"Vers décembre 2017, le site de retouche photo en ligne <a href=\"https://www.zdnet.com/article/hacker-puts-up-for-sale-third-round-of-hacked-databases-on-the-dark-web/\" target=\"_blank\" rel=\"noopener\">piZap a subi une violation de données</a> . Les données ont ensuite été mises en vente sur un marché du Web sombre avec une collection d&#39;autres violations de données en février 2019. Un total de 42 millions d&#39;adresses e-mail uniques ont été incluses dans la violation aux côtés des noms, des sexes et des liens vers des profils Facebook lorsque le réseau social plate-forme multimédia a été utilisée pour s&#39;authentifier auprès de piZap. Lorsque des comptes ont été créés directement sur piZap sans utiliser Facebook pour l&#39;authentification, les mots de passe stockés sous forme de hachage SHA-1 ont également été exposés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","PlutoTV2018-10-12":"En octobre 2018, le service de télévision sur Internet <a href=\"https://www.vice.com/en/article/88a8ma/pluto-tv-hacked-data-breach\" target=\"_blank\" rel=\"noopener\">Pluto TV a subi une violation de données</a> qui a ensuite été largement partagée dans les communautés de piratage. Pluto TV &quot;a décidé de ne pas informer de manière proactive les utilisateurs de la violation&quot; qui contenait 3,2 millions d&#39;adresses e-mail et IP uniques, noms, noms d&#39;utilisateur, sexes, dates de naissance et mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Pokebip2015-07-28":"En juillet 2015, le site Pokémon français <a href=\"https://www.pokebip.com/news3382__message_de_securite_de_l_equipe_pokebip_.html\" target=\"_blank\" rel=\"noopener\">Pokébip a subi une violation de données</a> qui a exposé 657 000 identités d&#39;abonnés. Les données comprenaient les adresses e-mail et IP, les noms d&#39;utilisateur et les mots de passe stockés sous forme de hachages MD5 non salés.","PokemonCreed2014-08-08":"En août 2014, le site Web Pokémon RPG <a href=\"http://pokemoncreed.net\" target=\"_blank\" rel=\"noopener\">Pokémon Creed a</a> été piraté après une dispute avec le site rival, <a href=\"http://pkmndusk.in\" target=\"_blank\" rel=\"noopener\">Pokémon Dusk</a> . Dans un <a href=\"https://www.facebook.com/ramandeep.s.dehal/posts/749666358442465\" target=\"_blank\" rel=\"noopener\">article sur Facebook</a> , &quot;Cruz Dusk&quot; a annoncé le piratage, puis a collé la base de données MySQL sur <a href=\"http://pkmndusk.in\" target=\"_blank\" rel=\"noopener\">pkmndusk.in</a> . Les données violées comprenaient plus de 116 000 noms d&#39;utilisateur, adresses e-mail et mots de passe en texte brut.","PoliceOne2014-07-01":"En février 2017, le site Web des forces de l&#39;ordre <a href=\"http://www.zdnet.com/article/police-forum-hacked-thousands-of-records-for-sale-on-dark-web/\" target=\"_blank\" rel=\"noopener\">PoliceOne a confirmé avoir subi une violation de données</a> . La violation contenait plus de 700 000 comptes qui étaient mis en vente par un courtier en données et incluaient des adresses e-mail et IP, des noms d&#39;utilisateur et des hachages de mot de passe MD5 salés. Le fichier dans lequel les données étaient contenues indiquait que la violation originale remontait à juillet 2014.","Poshmark2018-05-16":"À la mi-2018, le marché du commerce social <a href=\"https://techcrunch.com/2019/08/01/poshmark-confirms-data-breach/\" target=\"_blank\" rel=\"noopener\">Poshmark a subi une violation de données</a> qui a exposé 36 millions de comptes d&#39;utilisateurs. Les données compromises comprenaient des adresses e-mail, des noms, des noms d&#39;utilisateur, des sexes, des emplacements et des mots de passe stockés sous forme de hachages bcrypt. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","Powerbot2014-09-01":"Vers septembre 2014, le site Web du bot RuneScape <a href=\"https://www.powerbot.org\" target=\"_blank\" rel=\"noopener\">Powerbot a</a> subi une violation de données entraînant l&#39;exposition de plus d&#39;un demi-million d&#39;enregistrements d&#39;utilisateurs uniques. Les données contenaient des adresses e-mail et IP, des noms d&#39;utilisateur et des hachages MD5 de mots de passe salés. Le site a déjà été signalé comme compromis dans le répertoire de la base de données violée <a href=\"https://vigilante.pw/\" target=\"_blank\" rel=\"noopener\">Vigilante.pw.</a>","ProctorU2020-06-26":"En juin 2020, le service d&#39;examen en ligne <a href=\"https://www.smh.com.au/national/hackers-hit-university-online-exam-tool-20200806-p55j6h.html\" target=\"_blank\" rel=\"noopener\">ProctorU a subi une violation de données</a> qui a ensuite été largement partagée entre les communautés de piratage en ligne. La violation contenait 444 000 enregistrements d&#39;utilisateurs, notamment des noms, des adresses e-mail et physiques, des numéros de téléphone et des mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://breachbase.pw/\" target=\"_blank\" rel=\"noopener\">violationbase.pw</a> .","ProgrammingForums2015-12-01":"Vers la fin de 2015, le forum de <a href=\"http://www.programmingforums.org/\" target=\"_blank\" rel=\"noopener\">programmation de programmingforums.org a</a> subi une violation de données entraînant l&#39;exposition de 707 000 enregistrements d&#39;utilisateurs uniques. Les données contenaient des adresses e-mail et IP, des noms d&#39;utilisateur et des hachages MD5 de mots de passe salés. Le site a déjà été signalé comme compromis dans le répertoire de la base de données violée <a href=\"https://vigilante.pw/\" target=\"_blank\" rel=\"noopener\">Vigilante.pw.</a>","Promo2020-06-22":"En juillet 2020, la promo autoproclamée « Premier créateur de vidéos marketing au monde » a <a href=\"https://support.promo.com/en/articles/4276475-promo-data-breach-faq\" target=\"_blank\" rel=\"noopener\">subi une violation de données</a> qui a ensuite été largement partagée sur un forum de piratage. L&#39;incident a révélé 22 millions d&#39;enregistrements contenant près de 15 millions d&#39;adresses e-mail uniques, ainsi que des adresses IP, des sexes, des noms et des hachages de mots de passe SHA-256 salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Promofarma2019-08-03":"En août 2019, <a href=\"https://www.zdnet.com/article/data-of-21-million-mixcloud-users-put-up-for-sale-on-the-dark-web/\" target=\"_blank\" rel=\"noopener\">une violation de données de la pharmacie en ligne espagnole Promofarma est apparue à la vente sur une place de marché du dark web</a> . La violation a exposé plus de 2,7 millions d&#39;enregistrements et contenait près de 1,3 million d&#39;adresses e-mail uniques de clients. Les données comprenaient également les noms des clients et ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","PropTiger2018-01-30":"En janvier 2018, le site Web immobilier indien <a href=\"https://www.proptiger.com/\" target=\"_blank\" rel=\"noopener\">PropTiger a</a> subi une violation de données qui a entraîné l&#39;exposition d&#39;un fichier de base de données de 3,46 Go, puis son partage abondant sur un forum de piratage populaire 2 ans plus tard. Les données exposées contenaient à la fois des enregistrements d&#39;utilisateurs et des historiques de connexion avec plus de 2 millions d&#39;adresses e-mail de clients uniques. Les données exposées comprenaient également des attributs personnels supplémentaires tels que les noms, les dates de naissance, les sexes, les adresses IP et les mots de passe stockés sous forme de hachages MD5. PropTiger a indiqué qu&#39;il pensait que la convivialité des données était &quot;limitée&quot; en raison de la façon dont certains attributs de données ont été générés et stockés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","PS3Hax2015-07-01":"Vers juillet 2015, le forum de <a href=\"http://www.ps3hax.net\" target=\"_blank\" rel=\"noopener\">piratage et de modification de Sony Playstation connu sous le nom de PS3Hax a</a> été piraté et plus de 447 000 comptes ont été exposés. Le forum vBulletin incluait des adresses IP et des mots de passe stockés sous forme de hachages salés à l&#39;aide d&#39;une implémentation faible permettant à de nombreux d&#39;être rapidement craqués.","PSX-Scene2015-02-01":"Vers février 2015, le forum Sony Playstation connu sous le nom de <a href=\"http://psx-scene.com\" target=\"_blank\" rel=\"noopener\">PSX-Scene a</a> été piraté et plus de 340 000 comptes ont été exposés. Le forum vBulletin incluait des adresses IP et des mots de passe stockés sous forme de hachages salés à l&#39;aide d&#39;une implémentation faible permettant à de nombreux d&#39;être rapidement craqués.","QIP2011-06-01":"Mi-2011, le service de messagerie instantanée russe connu sous le nom de <a href=\"http://securityaffairs.co/wordpress/51118/data-breach/qip-data-breach.html\" target=\"_blank\" rel=\"noopener\">QIP (Quiet Internet Pager) a subi une violation de données</a> . L&#39;attaque a entraîné la divulgation de plus de 26 millions de comptes uniques, y compris des adresses e-mail et des mots de passe, les données apparaissant finalement en public des années plus tard.","QuantumBooter2014-03-18":"En mars 2014, le <a href=\"http://www.webopedia.com/TERM/B/booter_services.html\">service de démarrage</a> Quantum Booter (également appelé Quantum Stresser) a subi une violation qui a conduit à la divulgation de sa base de données interne. Les données divulguées comprenaient des discussions privées relatives aux activités malveillantes que les utilisateurs de Quantum Booter effectuaient contre des adversaires en ligne, y compris les adresses IP de ceux qui utilisaient le service pour monter des attaques DDoS.","Quidd2019-07-01":"En 2019, le marché en ligne pour l&#39;échange d&#39;autocollants, de cartes, de jouets et d&#39;autres objets de collection, <a href=\"https://www.zdnet.com/article/account-details-for-4-million-quidd-users-shared-on-hacking-forum/\" target=\"_blank\" rel=\"noopener\">Quidd a subi une violation de données</a> . La violation a exposé près de 4 millions d&#39;adresses e-mail, de noms d&#39;utilisateur et de mots de passe d&#39;utilisateurs stockés sous forme de hachages bcrypt. Les données ont ensuite été vendues puis redistribuées abondamment via des forums de piratage.","QuinStreet2015-12-14":"Vers la fin de 2015, le fabricant de « produits de marketing de performance » <a href=\"http://quinstreet.com/\" target=\"_blank\" rel=\"noopener\">QuinStreet a</a> vu un certain nombre de ses actifs en ligne compromis. L&#39;attaque a touché 28 sites distincts, principalement des forums technologiques tels que <a href=\"http://quinstreet.com/\" target=\"_blank\" rel=\"noopener\">flashkit.com</a> , <a href=\"http://quinstreet.com/\" target=\"_blank\" rel=\"noopener\">codeguru.com</a> et <a href=\"http://quinstreet.com/\" target=\"_blank\" rel=\"noopener\">webdeveloper.com</a> ( <a href=\"http://pastebin.com/raw/6p50GgCV\" target=\"_blank\" rel=\"noopener\">consultez la liste complète des sites</a> ). QuinStreet a indiqué que les utilisateurs concernés ont été informés et les mots de passe réinitialisés. Les données contenaient des détails sur plus de 4,9 millions de personnes et comprenaient des adresses e-mail, des dates de naissance et des hachages MD5 salés.","R2Games2015-11-01":"Fin 2015, le site Web de jeux <a href=\"https://www.r2games.com\" target=\"_blank\" rel=\"noopener\">R2Games a</a> été piraté et plus de 2,1 millions d&#39;enregistrements personnels ont été divulgués. Le forum vBulletin incluait des adresses IP et des mots de passe stockés sous forme de hachages salés à l&#39;aide d&#39;une implémentation faible permettant à de nombreux d&#39;être rapidement craqués. 11 millions de comptes supplémentaires ont été ajoutés à « Have I Been Pwned » en mars 2016 et 9 millions supplémentaires en juillet 2016, portant le total à plus de 22 millions.","Raychat2021-01-31":"En janvier 2021, la défunte plate-forme de médias sociaux iranienne <a href=\"https://www.gizmodo.com.au/2021/02/iranian-chat-app-gets-its-data-wiped-out-in-a-cyberattack/\" target=\"_blank\" rel=\"noopener\">Raychat a subi une violation de données qui a exposé 939 000 adresses e-mail uniques</a> . Les données comprenaient des noms, des adresses IP, des chaînes d&#39;agent utilisateur de navigateur et des mots de passe stockés sous forme de hachages bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","RbxRocks2018-08-06":"En août 2018, le site de trading Roblox <a href=\"https://rbx.rocks/\" target=\"_blank\" rel=\"noopener\">Rbx.Rocks a</a> subi une violation de données. Près de 25 000 enregistrements ont été envoyés à HIBP en novembre et comprenaient des noms, des adresses e-mail et des mots de passe stockés sous forme de hachage bcrypt. En juillet 2019, 125 000 enregistrements supplémentaires ont émergé, portant la taille totale de l&#39;incident à 150 000. Le site Web s&#39;est depuis déconnecté avec un message indiquant que &quot;Rbx.Rocks v2.0 est actuellement en construction&quot;.","Reincubate2017-05-11":"En octobre 2020, la société de données d&#39;applications <a href=\"https://reincubate.com/blog/security-incident-oct-2020/\" target=\"_blank\" rel=\"noopener\">Reincubate a subi une violation de données</a> qui a révélé une sauvegarde de novembre 2017 (le dernier enregistrement des données est apparu plusieurs mois plus tôt). Les données comprenaient plus de 616 000 adresses e-mail, noms et mots de passe uniques stockés sous forme de hachages PBKDF2.","RetinaX2017-02-23":"En février 2017, le développeur du logiciel de surveillance des appareils mobiles Retina-X a été piraté et les données des clients ont été téléchargées avant d&#39;être effacées de leurs serveurs. L&#39;incident a été couvert dans l&#39;article de Motherboard intitulé <a href=\"https://motherboard.vice.com/en_us/article/inside-stalkerware-surveillance-market-flexispy-retina-x\" target=\"_blank\" rel=\"noopener\">Inside the &#39;Stalkerware&#39; Surveillance Market, Where Ordinary People Tape Each Other&#39;s Phones</a> . Le service, utilisé pour surveiller les appareils mobiles, avait 71 000 adresses e-mail et des hachages MD5 sans sel exposé. Retina-X a <a href=\"http://www.phonesheriff.com/blog/retina-x-studios-server-breached-by-hackers/\" target=\"_blank\" rel=\"noopener\">révélé l&#39;incident dans un article de blog</a> le 27 avril 2017.","Reverb-Nation2014-01-01":"En janvier 2014, le service en ligne d&#39;aide aux musiciens dans la construction de leur carrière <a href=\"https://www.scmagazine.com/2014-breach-prompts-reverbnation-to-notify-customers/article/532492/\" target=\"_blank\" rel=\"noopener\">ReverbNation a subi une violation de données qui n&#39;a été identifiée qu&#39;en septembre de l&#39;année suivante</a> . La violation contenait plus de 7 millions de comptes avec des adresses e-mail uniques et des mots de passe SHA1 salés.","RiverCityMedia2017-01-01":"En janvier 2017, <a href=\"https://web.archive.org/web/20170426084052/https://mackeeper.com/blog/post/339-spammergate-the-fall-of-an-empire\" target=\"_blank\" rel=\"noopener\">une énorme mine de données de River City Media a été découverte en ligne</a> . Les données se sont avérées contenir près de 1,4 milliard d&#39;enregistrements, notamment des adresses e-mail et IP, des noms et des adresses physiques, tous utilisés dans le cadre d&#39;une énorme opération de spam. Une fois dédupliquées, il y avait 393 millions d&#39;adresses e-mail uniques dans les données exposées.","Roll202018-12-26":"En décembre 2018, le site Web de jeux de rôle sur table <a href=\"https://app.roll20.net/forum/post/7209691/roll20-security-breach\" target=\"_blank\" rel=\"noopener\">Roll20 a subi une violation de données</a> . Près de 4 millions de clients ont été touchés par la violation et ont eu des adresses e-mail et IP, des noms, des hachages bcrypt de mots de passe et les 4 derniers chiffres de cartes de crédit exposés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","Romwe2018-06-01":"Mi-2018, le détaillant basé à Hong Kong <a href=\"https://finance.yahoo.com/finance/news/romwe-informs-shoppers-data-security-203054849.html\" target=\"_blank\" rel=\"noopener\">Romwe a subi une violation de données qui a exposé près de 20 millions de clients</a> . Les données ont ensuite été vendues en ligne et comprennent les noms, numéros de téléphone, adresses e-mail et IP, les emplacements géographiques des clients et les mots de passe stockés sous forme de hachage SHA-1 salé. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","RussianAmerica2017-01-01":"Vers 2017, le site Web destiné aux russophones en Amérique, connu sous le nom de <a href=\"http://www.russianamerica.com/\" target=\"_blank\" rel=\"noopener\">Russian America, a</a> subi une violation de données. L&#39;incident a révélé 183 000 enregistrements uniques, notamment des noms, des adresses e-mail, des numéros de téléphone et des mots de passe stockés à la fois en texte brut et sous forme de hachage MD5. L&#39;Amérique russe a été contactée au sujet de la violation mais n&#39;a pas répondu.","Scentbird2020-06-22":"En juin 2020, le service de parfums en ligne <a href=\"https://www.bleepingcomputer.com/news/security/hacker-leaks-386-million-user-records-from-18-companies-for-free/\" target=\"_blank\" rel=\"noopener\">Scentbird a subi une violation de données</a> qui a exposé les informations personnelles de plus de 5,8 millions de clients. Les informations personnelles, notamment les noms, les adresses e-mail, le sexe, les dates de naissance, les mots de passe stockés sous forme de hachage bcrypt et les indicateurs de force du mot de passe ont tous été exposés. Les données ont été fournies à HIBP par <a href=\"https://breachbase.pw/\" target=\"_blank\" rel=\"noopener\">violationbase.pw</a> .","Seedpeer2015-07-12":"En juillet 2015, le site torrent Seedpeer a été piraté et 282 000 enregistrements de membres ont été exposés. Les données comprenaient des noms d&#39;utilisateur, des adresses e-mail et des mots de passe stockés sous forme de hachages MD5 faibles.","Sephora2017-01-09":"Vers janvier 2017, le magasin de beauté <a href=\"https://www.zdnet.com/article/sephora-data-breach-hits-southeast-asia-and-anz-customers/\" target=\"_blank\" rel=\"noopener\">Sephora a subi une violation de données</a> . Impactant les clients en Asie du Sud-Est, en Australie et en Nouvelle-Zélande, 780 000 adresses e-mail uniques ont été incluses dans la brèche aux côtés des noms, des sexes, des dates de naissance, des ethnies et d&#39;autres informations personnelles. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","ShareThis2018-07-09":"En juillet 2018, le service de partage et de partage de signets sur les réseaux sociaux <a href=\"https://www.sharethis.com/data-privacy-incident/\" target=\"_blank\" rel=\"noopener\">ShareThis a subi une violation de données</a> . L&#39;incident a révélé 41 millions d&#39;adresses e-mail uniques ainsi que des noms et, dans certains cas, des dates de naissance et des hachages de mot de passe. En 2019, <a href=\"https://www.theregister.co.uk/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">les données sont apparues en vente sur un marché du Web sombre</a> (avec plusieurs autres violations importantes) et ont ensuite commencé à circuler plus largement. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","SHEIN2018-06-01":"En juin 2018, le détaillant de mode en ligne <a href=\"https://www.zdnet.com/article/shein-fashion-retailer-announces-breach-affecting-6-42-million-users/\" target=\"_blank\" rel=\"noopener\">SHEIN a subi une violation de données</a> . La société a découvert la violation 2 mois plus tard en août, puis a divulgué l&#39;incident un mois plus tard. Au total, 39 millions d&#39;adresses e-mail uniques ont été trouvées dans la brèche aux côtés des hachages de mot de passe MD5. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","ShopBack2020-09-17":"En septembre 2020, le programme de récompense cashback <a href=\"https://support.shopback.com.au/hc/en-us/articles/360054141274-Customer-Notice-FAQs\" target=\"_blank\" rel=\"noopener\">ShopBack a subi une violation de données</a> . L&#39;incident a révélé plus de 20 millions d&#39;adresses e-mail uniques ainsi que des noms, numéros de téléphone, pays de résidence et mots de passe stockés sous forme de hachage SHA-1 salé. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","ShortEdition2021-06-26":"En juin 2021, la maison d&#39;édition française de littérature courte <a href=\"https://short-edition.com/en/p/cyber-attack\" target=\"_blank\" rel=\"noopener\">Short Édition a subi une violation de données qui a exposé 505 000 notices</a> . Les données concernées comprenaient les adresses e-mail et physiques, les noms, les noms d&#39;utilisateur, les numéros de téléphone, les dates de naissance, les sexes et les mots de passe stockés sous forme de hachage SHA-1 salé ou SHA-512 salé. Short Édition a lui-même soumis les données impactées à HIBP.","Shotbow2016-05-09":"En mai 2016, le serveur multijoueur du service Minecraft <a href=\"https://shotbow.net/forum/threads/security-data-breach-and-information-leak.346321/\" target=\"_blank\" rel=\"noopener\">Shotbow a annoncé avoir subi une violation de données</a> . L&#39;incident a entraîné l&#39;exposition de plus d&#39;un million d&#39;adresses e-mail uniques, de noms d&#39;utilisateur et de hachages de mots de passe SHA-256 salés.","Slickwraps2020-02-16":"En février 2020, la boutique en ligne d&#39;emballages électroniques grand public <a href=\"https://www.slickwraps.com/blog/update/\" target=\"_blank\" rel=\"noopener\">Slickwraps a subi une violation de données</a> . L&#39;incident a entraîné l&#39;exposition de 858 000 adresses e-mail uniques dans les dossiers des clients et des abonnés à la newsletter. Les données supplémentaires impactées comprenaient les noms, les adresses physiques, les numéros de téléphone et les historiques d&#39;achat.","Smogon2017-09-10":"En avril 2018, le site Web Pokémon connu sous le nom de <a href=\"https://www.smogon.com/forums/threads/we-were-hacked-recently-you-may-potentially-want-to-change-your-passwords.3632265/\" target=\"_blank\" rel=\"noopener\">Smogon a annoncé avoir subi une violation de données</a> . La violation remontait à septembre 2017 et affectait leur forum basé sur XenForo. Les données exposées comprenaient les noms d&#39;utilisateur, les adresses e-mail, les sexes et les hachages de mot de passe bcrypt et MD5.","Snail2015-03-14":"En mars 2015, le site de jeux <a href=\"https://www.technadu.com/emuparadise-1-1-million-user-data-breach/70025/\" target=\"_blank\" rel=\"noopener\">Snail a subi une violation de données</a> qui a touché 1,4 million d&#39;abonnés. Les données concernées comprenaient les noms d&#39;utilisateur, les adresses IP et e-mail et les mots de passe stockés sous forme de hachages MD5 non salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","SIAE2018-11-03":"En novembre 2018, la Società Italiana degli Autori ed Editori (Société italienne des auteurs et éditeurs, ou SIAE) a <a href=\"https://www.repubblica.it/tecnologia/sicurezza/2018/11/03/news/tecnologia_altro_attacco_di_anonplus_bucato_il_sito_della_siae_e_rubati_4_giga_di_dati-210654944/?ref=search\" target=\"_blank\" rel=\"noopener\">été piratée, défigurée et près de 4 Go de données ont été divulguées publiquement via Twitter</a> . Les données comprenaient plus de 14 000 noms d&#39;utilisateurs enregistrés, adresses e-mail et mots de passe.","Sonicbids2019-12-30":"En décembre 2019, le site de réservation <a href=\"https://oag.ca.gov/system/files/Sonicbids%20-%20%20CA.pdf\" target=\"_blank\" rel=\"noopener\">Sonicbids a subi une violation de données</a> qu&#39;il a attribuée à &quot;un événement de confidentialité des données impliquant nos services d&#39;hébergement cloud tiers&quot;. La violation contenait 752 000 enregistrements d&#39;utilisateurs, y compris les noms et les noms d&#39;utilisateur, les adresses e-mail et les mots de passe stockés sous forme de hachages PBKDF2. Les données ont été fournies à HIBP par <a href=\"https://breachbase.pw/\" target=\"_blank\" rel=\"noopener\">violationbase.pw</a> .","Soundwave2015-07-16":"Vers la mi-2015, l&#39;application de suivi musical <a href=\"http://www.soundwave.com/help/\" target=\"_blank\" rel=\"noopener\">Soundwave a subi une violation de données</a> . La violation découlait d&#39;un incident au cours duquel &quot;des données de production avaient été utilisées pour remplir la base de données de test&quot; et ont ensuite été exposées par inadvertance dans une MongoDB. Les données contenaient 130 000 enregistrements et comprenaient des adresses e-mail, des dates de naissance, des sexes et des hachages MD5 de mots de passe sans sel.","SpyFone2018-08-16":"En août 2018, la société de logiciels espions <a href=\"https://motherboard.vice.com/en_us/article/9kmj4v/spyware-company-spyfone-terabytes-data-exposed-online-leak\" target=\"_blank\" rel=\"noopener\">SpyFone a laissé des téraoctets de données exposés publiquement</a> . Collectées subrepticement pendant que les cibles utilisaient leurs appareils, les données comprenaient des photos, des enregistrements audio, des messages texte et l&#39;historique de navigation qui ont ensuite été exposés via un certain nombre de mauvaises configurations dans les systèmes de SpyFone. Les données appartenaient aux milliers de clients SpyFone et comprenaient 44 000 adresses e-mail uniques, dont beaucoup appartenaient probablement aux personnes avec lesquelles les téléphones ciblés étaient en contact.","Staminus2016-03-11":"En mars 2016, le service de protection DDoS <a href=\"https://krebsonsecurity.com/2016/03/hackers-target-anti-ddos-firm-staminus/\" target=\"_blank\" rel=\"noopener\">Staminus a été « massivement piraté »</a> entraînant une panne de plus de 20 heures et la divulgation des informations d&#39;identification des clients (avec des hachages MD5 non salés), des tickets d&#39;assistance, des numéros de carte de crédit et d&#39;autres données sensibles. 27 000 adresses e-mail uniques ont été trouvées dans les données qui ont ensuite été rendues publiques. Staminus n&#39;est plus en fonction.","StarTribune2019-10-10":"En octobre 2019, le service d&#39;information basé au Minnesota <a href=\"https://www.startribune.com/hacker-group-claims-to-have-stolen-star-tribune-user-information/570384542/\" target=\"_blank\" rel=\"noopener\">StarTribune a subi une violation de données</a> qui a ensuite été vendue sur le dark web. La violation a exposé plus de 2 millions d&#39;adresses e-mail uniques ainsi que des noms, des noms d&#39;utilisateur, des adresses physiques, des dates de naissance, des sexes et des mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","SterKinekor2017-03-09":"En 2016, la société de cinéma sud-africaine <a href=\"http://blog.roguecode.co.za/sterkinekor-vulnerability-download-millions-accounts\" target=\"_blank\" rel=\"noopener\">Ster-Kinekor avait une faille de sécurité</a> qui faisait fuir une grande quantité de données clients via une vulnérabilité d&#39;énumération dans l&#39;API de leur ancien site Web. Alors que plus de 6 millions de comptes ont été divulgués par la faille, les données exposées ne contenaient que 1,6 million d&#39;adresses e-mail uniques. Les données comprenaient également de nombreuses informations personnelles telles que les noms, les adresses, les dates de naissance, les sexes et les mots de passe en texte brut.","StockX2019-07-26":"En juillet 2019, la plateforme de trading de mode et de baskets <a href=\"https://stockx.com/news/update-on-data-security-issue/\" target=\"_blank\" rel=\"noopener\">StockX a subi une violation de données</a> qui a ensuite été vendue via un dark webmarketplace. Les données exposées comprenaient 6,8 millions d&#39;adresses e-mail, de noms, d&#39;adresses physiques, d&#39;achats et de mots de passe uniques stockés sous forme de hachages MD5 salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","StoryBird2015-08-07":"En août 2015, le service de narration <a href=\"https://www.zdnet.com/article/hacker-puts-up-for-sale-third-round-of-hacked-databases-on-the-dark-web/\" target=\"_blank\" rel=\"noopener\">StoryBird a subi une violation de données</a> exposant 4 millions d&#39;enregistrements avec 1 million d&#39;adresses e-mail uniques. Les données concernées comprenaient également des noms, des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachages PBKDF2. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Straffic2020-02-14":"En février 2020, la société de marketing israélienne <a href=\"https://www.databreachtoday.com/israeli-marketing-company-exposes-contacts-database-a-13785\" target=\"_blank\" rel=\"noopener\">Straffic a exposé une base de données contenant 140 Go de données personnelles</a> . La base de données Elasticsearch accessible au public contenait plus de 300 millions de lignes avec 49 millions d&#39;adresses e-mail uniques. Les données exposées comprenaient également les noms, les numéros de téléphone, les adresses physiques et les sexes. Dans <a href=\"https://straffic.io/updates.php\" target=\"_blank\" rel=\"noopener\">son message de divulgation de violation</a> , Straffic a déclaré qu&#39;&quot;il est impossible de créer un système totalement immunitaire, et ces choses peuvent se produire&quot;.","Stratfor2011-12-24":"En décembre 2011, « Anonymous » a <a href=\"http://www.troyhunt.com/2011/12/5-website-security-lessons-courtesy-of.html\" target=\"_blank\" rel=\"noopener\">attaqué la société mondiale de renseignement connue sous le nom de « Stratfor »</a> et a par conséquent divulgué un véritable trésor de données, notamment des centaines de gigaoctets d’e-mails et des dizaines de milliers de détails de carte de crédit qui ont été rapidement utilisés par les attaquants pour faire de la charité dons (entre autres utilisations). La violation comprenait également 860 000 comptes d&#39;utilisateurs complets avec adresse e-mail, fuseau horaire, certaines données système internes et mots de passe hachés MD5 sans sel.","StreetEasy2016-06-28":"Vers juin 2016, le site immobilier <a href=\"https://therealdeal.com/2019/02/19/a-million-streeteasy-accounts-hacked/\" target=\"_blank\" rel=\"noopener\">StreetEasy a subi une violation de données</a> . Au total, 988 000 adresses e-mail uniques ont été incluses dans la violation aux côtés des noms, des noms d&#39;utilisateur et des hachages SHA-1 des mots de passe, qui sont tous apparus en vente sur un marché du dark web en février 2019. Les données ont été fournies à HIBP par une source qui a demandé il soit attribué à &quot;JimScott.Sec@protonmail.com&quot;.","StrongholdKingdoms2018-07-04":"En juillet 2018, le jeu en ligne multijoueur massif <a href=\"https://techraptor.net/content/roll20-stronghold-kingdoms-subject-security-breach\" target=\"_blank\" rel=\"noopener\">Stronghold Kingdoms a subi une violation de données</a> . Près de 5,2 millions de comptes ont été touchés par l&#39;incident qui a exposé des adresses e-mail, des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachage SHA-1 salé. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","SubaGames2016-11-01":"En novembre 2016, le développeur de jeux <a href=\"https://www.hackread.com/vbulletin-forums-hacked-accounts-sold-on-dark-web/\" target=\"_blank\" rel=\"noopener\">Suba Games a subi une violation de données</a> qui a conduit à l&#39;exposition de 6,1 millions d&#39;adresses e-mail uniques. Les données concernées comprenaient également des noms d&#39;utilisateur et des mots de passe, dont la plupart semblaient circuler dans le fichier piraté en texte brut après avoir été craqués à partir de hachages MD5 salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","SumoTorrent2014-06-21":"En juin 2014, le site torrent Sumo Torrent a été piraté et 285 000 enregistrements de membres ont été exposés. Les données comprenaient des adresses IP, des adresses e-mail et des mots de passe stockés sous forme de hachages MD5 faibles.","SweClockers2015-04-01":"Début 2015, le site d&#39;actualités technologiques suédois <a href=\"http://www.sweclockers.com/nyhet/20800-sweclockers-drabbas-av-dataintrang\" target=\"_blank\" rel=\"noopener\">SweClockers a été piraté</a> et 255 000 comptes ont été exposés. L&#39;attaque a conduit à l&#39;exposition de noms d&#39;utilisateur, d&#39;adresses e-mail et de hachages salés de mots de passe stockés avec une combinaison de MD5 et SHA512.","Swvl2020-06-23":"En juin 2020, l&#39;opérateur de bus égyptien <a href=\"https://portswigger.net/daily-swig/egyptian-bus-operator-swvl-hit-by-data-breach\" target=\"_blank\" rel=\"noopener\">Swvl a subi une violation de données</a> qui a touché plus de 4 millions de membres du service. Les données exposées comprenaient des noms, des adresses e-mail, des numéros de téléphone, des photos de profil, des données partielles de carte de crédit (type et 4 derniers chiffres) et des mots de passe stockés sous forme de hachage bcrypt, qui ont ensuite été largement partagés entre les communautés de piratage en ligne. Les données ont été fournies à HIBP par <a href=\"https://breachbase.pw/\" target=\"_blank\" rel=\"noopener\">violationbase.pw</a> .","TaiLieu2019-11-24":"En novembre 2019, le site Web éducatif vietnamien <a href=\"https://tailieu.vn/\" target=\"_blank\" rel=\"noopener\">TaiLieu</a> aurait subi une violation de données exposant 7,3 millions de dossiers de clients. Les données concernées comprenaient les noms et les noms d&#39;utilisateur, les adresses e-mail, les dates de naissance, les sexes et les mots de passe stockés sous forme de hachages MD5 non salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> après avoir été partagées sur un forum de piratage populaire. TaiLieu n&#39;a pas répondu lorsqu&#39;il a été contacté au sujet de l&#39;incident.","Taobao2012-01-01":"Vers 2012, il est allégué que le site d&#39;achat chinois connu sous le nom de <a href=\"https://www.taobao.com\" target=\"_blank\" rel=\"noopener\">Taobao a</a> subi une violation de données qui a touché plus de 21 millions d&#39;abonnés. Bien qu&#39;il existe des preuves que les données sont légitimes, en raison de la difficulté de vérifier catégoriquement la violation chinoise, elles ont été signalées comme « non vérifiées ». Les données de la violation contiennent des adresses e-mail et des mots de passe en texte brut. <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>","Teespring2020-04-01":"En avril 2020, le site Web de vêtements imprimés personnalisés <a href=\"https://www.zdnet.com/article/hacker-leaks-data-of-millions-of-teespring-users/\" target=\"_blank\" rel=\"noopener\">Teespring a subi une violation de données qui a exposé 8,2 millions de dossiers de clients</a> . Les données comprenaient des adresses e-mail, des noms, des emplacements géographiques et des identifiants de réseaux sociaux.","TGBUS2017-09-01":"Vers 2017, il est allégué que le site de jeux chinois connu sous le nom de <a href=\"http://www.tgbus.com/\" target=\"_blank\" rel=\"noopener\">TGBUS a</a> subi une violation de données qui a touché plus de 10 millions d&#39;abonnés uniques. Bien qu&#39;il existe des preuves que les données sont légitimes, en raison de la difficulté de vérifier catégoriquement la violation chinoise, elles ont été signalées comme « non vérifiées ». Les données de la violation contiennent des noms d&#39;utilisateur, des adresses e-mail et des hachages de mot de passe MD5 salés et ont été fournies avec le support de <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> . <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>","TheTVDB2017-11-21":"En novembre 2017, la base de données ouverte de télévision connue sous le nom de <a href=\"https://forums.thetvdb.com/viewtopic.php?f=3&t=43254\" target=\"_blank\" rel=\"noopener\">TheTVDB.com a subi une violation de données</a> . Les données violées ont été publiées sur un forum de piratage et comprenaient 182 000 enregistrements avec des noms d&#39;utilisateur, des adresses e-mail et des hachages de mot de passe MySQL.","ThisHabboForum2014-01-01":"En 2014, le forum ThisHabbo (un site de fans pour Habbo.com, un site de réseautage social finlandais) <a href=\"https://www.google.com/search?q=\"thishabbo_forum.txt\" target=\"_blank\" rel=\"noopener\">figurait parmi une liste de sites compromis</a> qui a par la suite été supprimée d&#39;Internet. Bien que la date réelle de l&#39;exploit ne soit pas claire, les données violées incluent les noms d&#39;utilisateur, les adresses e-mail, les adresses IP et les hachages salés des mots de passe. 584 000 enregistrements supplémentaires ont été ajoutés à partir d&#39;un fichier de violation plus complet fourni en octobre 2016.","Tianya2011-12-26":"En décembre 2011, <a href=\"http://thehackernews.com/2011/12/tianya-chinas-biggest-online-forum-40.html\" target=\"_blank\" rel=\"noopener\">le plus grand forum en ligne de Chine connu sous le nom de Tianya a été piraté</a> et des dizaines de millions de comptes ont été obtenus par l&#39;attaquant. Les données divulguées comprenaient des noms, des noms d&#39;utilisateur et des adresses e-mail.","Ticketcounter2021-02-22":"En août 2020, le service de billetterie néerlandais <a href=\"https://www.bleepingcomputer.com/news/security/european-e-ticketing-platform-ticketcounter-extorted-in-data-breach/\" target=\"_blank\" rel=\"noopener\">Ticketcounter a publié par inadvertance une sauvegarde de la base de données dans un emplacement accessible au public où elle a ensuite été trouvée et téléchargée en février 2021</a> . Les données contenaient 1,9 million d&#39;adresses e-mail uniques proposées à la vente sur un forum de piratage, ainsi que des noms, des adresses physiques et IP, des sexes, des dates de naissance, des historiques de paiement et, dans certains cas, des numéros de compte bancaire. Ticketcounter a ensuite été tenu à une rançon avec la menace que la violation soit rendue publique. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à redredred@riseup.net.","Ticketfly2018-05-31":"En mai 2018, le site Web du service de distribution de billets <a href=\"https://motherboard.vice.com/en_us/article/mbk3nx/ticketfly-website-database-hacked-data-breach\" target=\"_blank\" rel=\"noopener\">Ticketfly a été défiguré par un attaquant et a ensuite été mis hors ligne</a> . L&#39;attaquant aurait demandé une rançon pour partager les détails de la vulnérabilité avec Ticketfly mais n&#39;a pas reçu de réponse et a ensuite publié les données violées en ligne dans un endroit accessible au public. Les données comprenaient plus de 26 millions d&#39;adresses e-mail uniques ainsi que des noms, des adresses physiques et des numéros de téléphone. Bien qu&#39;il n&#39;y ait aucun mot de passe dans les données divulguées publiquement, <a href=\"https://support.ticketfly.com/customer/en/portal/articles/2941983-ticketfly-cyber-incident-update\" target=\"_blank\" rel=\"noopener\">Ticketfly a publié plus tard une mise à jour de l&#39;incident</a> et a déclaré qu&#39;« il est possible, cependant, que des valeurs hachées des informations d&#39;identification de mot de passe aient pu être consultées ».","Tokopedia2020-04-17":"En avril 2020, la plus grande boutique en ligne d&#39;Indonésie, <a href=\"https://www.zdnet.com/article/hacker-leaks-15-million-records-from-tokopedia-indonesias-largest-online-store/\" target=\"_blank\" rel=\"noopener\">Tokopedia, a subi une violation de données</a> . L&#39;incident a entraîné la publication de 15 millions de lignes de données sur un forum de piratage populaire. 76 millions de lignes supplémentaires ont ensuite été fournies à HIBP en juillet 2020. Au total, les données comprenaient plus de 71 millions d&#39;adresses e-mail uniques ainsi que les noms, les sexes, les dates de naissance et les mots de passe stockés sous forme de hachage SHA2-384.","ToonDoo2019-08-21":"En août 2019, le site de création de bandes dessinées <a href=\"https://www.zataz.com/6-000-000-de-donnees-personnelles-piratees-pour-le-site-toondoo/\" target=\"_blank\" rel=\"noopener\">ToonDoo a subi une violation de données</a> . Les données ont ensuite été redistribuées sur un forum de piratage populaire en novembre où les informations personnelles de plus de 6 millions d&#39;abonnés ont été partagées. Les données concernées comprenaient les adresses e-mail et IP, les noms d&#39;utilisateur, le sexe, l&#39;emplacement de l&#39;individu et les hachages de mot de passe salés.","Tout2014-09-11":"Vers septembre 2014, le service de réseautage social, aujourd&#39;hui disparu, <a href=\"https://en.wikipedia.org/wiki/Tout_(company)\" target=\"_blank\" rel=\"noopener\">Tout a</a> subi une violation de données. La violation est apparue par la suite des années plus tard et comprenait 653 000 adresses e-mail uniques, noms, adresses IP, l&#39;emplacement de l&#39;utilisateur, sa biographie et ses mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;nmapthis@protonmail.com&quot;.","TravelOK2020-12-17":"En décembre 2020, <a href=\"https://tulsaworld.com/news/local/state-tourism-department-reports-data-breach-no-social-security-financial-data-compromised/article_105b0d18-6595-11eb-998b-1b96c12d2d14.html\" target=\"_blank\" rel=\"noopener\">le département du tourisme et des loisirs de l&#39;État de l&#39;Oklahoma a subi une violation de données</a> . L&#39;incident a révélé 637 000 adresses e-mail dans une variété de tableaux, y compris les tranches d&#39;âge par rapport aux commandes de brochures et les dates de naissance par rapport aux inscriptions au concours. Les genres, les noms et les adresses physiques ont également été exposés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;badhou3a&quot;.","TrikSpamBotnet2018-06-12":"En juin 2018, le serveur de commande et de contrôle d&#39;un botnet malveillant connu sous le nom de « Trik Spam Botnet » a <a href=\"https://www.bleepingcomputer.com/news/security/trik-spam-botnet-leaks-43-million-email-addresses/\" target=\"_blank\" rel=\"noopener\">été mal configuré, de sorte qu&#39;il a exposé les adresses e-mail de plus de 43 millions de personnes</a> . Les chercheurs qui ont découvert le serveur russe exposé pensent que la liste d&#39;adresses a été utilisée pour distribuer diverses souches de logiciels malveillants via des campagnes de spam (e-mails conçus pour diffuser des logiciels malveillants).","Trillian2015-12-27":"En décembre 2015, l&#39;application de messagerie instantanée <a href=\"https://www.trillian.im/help/trillian-blog-and-forums-security-incident/\" target=\"_blank\" rel=\"noopener\">Trillian a subi une violation de données</a> . La violation est devenue connue en juillet 2016 et a exposé divers attributs de données personnelles, notamment des noms, des adresses e-mail et des mots de passe stockés sous forme de hachages MD5 salés.","TrueFire2020-02-21":"En février 2020, le site Web de cours de guitare <a href=\"https://guitar.com/news/industry-news/truefire-data-breach/\" target=\"_blank\" rel=\"noopener\">TrueFire a subi une violation de données</a> qui a touché 600 000 membres. La violation a exposé de nombreuses informations personnelles, notamment des noms, des adresses e-mail et physiques, des soldes de comptes et des hachages de mots de passe MD5 non salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Tumblr2013-02-28":"Début 2013, <a href=\"https://staff.tumblr.com/post/144263069415/we-recently-learned-that-a-third-party-had\" target=\"_blank\" rel=\"noopener\">tumblr a subi une violation de données</a> qui a entraîné l&#39;exposition de plus de 65 millions de comptes. Les données ont ensuite été mises en vente sur un site Web du marché sombre et comprenaient des adresses e-mail et des mots de passe stockés sous forme de hachages SHA1 salés.","Astoria2021-01-26":"En janvier 2021, plus de 11 millions d&#39;adresses e-mail uniques ont été découvertes par Night Lion Security, ainsi qu&#39;une grande quantité d&#39;informations personnelles, notamment des noms, des adresses physiques et IP, des numéros de téléphone et des dates de naissance. Certains dossiers contenaient également des numéros de sécurité sociale, des détails sur le permis de conduire, des informations financières personnelles et des données relatives à la santé, selon la provenance des informations. Initialement attribué à Astoria Company, <a href=\"https://astoriacompany.com/cyber-update/\" target=\"_blank\" rel=\"noopener\">ils ont par la suite enquêté sur l&#39;incident et confirmé que les données ne provenaient pas de leurs services</a> .","UtahGunExchange2020-07-17":"En juillet 2020, <a href=\"https://www.forbes.com/sites/daveywinder/2020/08/15/gun-owners-beware-hacker-offers-240000-stolen-records-on-dark-web-report-utah-gun-exchange-amazon-cloud/\" target=\"_blank\" rel=\"noopener\">le site Web Utah Gun Exchange a subi une violation de données</a> qui comprenait plusieurs autres sites Web associés. Au total, 235 000 adresses e-mail uniques ont été exposées avant d&#39;être échangées en ligne avec des noms, des noms d&#39;utilisateur, des sexes, des adresses IP et des hachages de mots de passe. Les données ont été fournies à HIBP par <a href=\"https://breachbase.pw/\" target=\"_blank\" rel=\"noopener\">violationbase.pw</a> .","uuu92016-09-06":"En septembre 2016, des données auraient été obtenues sur le site Web chinois connu sous le nom de <a href=\"http://www.uuu9.com\" target=\"_blank\" rel=\"noopener\">uuu9.com</a> et contenaient 7,5 millions de comptes. Bien qu&#39;il existe des preuves que les données sont légitimes, en raison de la difficulté de vérifier catégoriquement la violation chinoise, elles ont été signalées comme « non vérifiées ». Les données de la violation contiennent des adresses e-mail et des noms d&#39;utilisateur. <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>","Vakinha2020-06-22":"En juin 2020, le service de collecte de fonds brésilien <a href=\"https://www.bleepingcomputer.com/news/security/hacker-leaks-386-million-user-records-from-18-companies-for-free/\" target=\"_blank\" rel=\"noopener\">Vakinha a subi une violation de données</a> qui a touché près de 4,8 millions de membres. Les données exposées comprenaient des adresses e-mail, des noms, des numéros de téléphone, des emplacements géographiques et des mots de passe stockés sous forme de hachage bcrypt, qui ont ensuite été largement partagés entre les communautés de piratage en ligne. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","VBulletin2015-11-03":"En novembre 2015, le fabricant de logiciels de forum <a href=\"http://www.theregister.co.uk/2015/11/03/vbulletin_forum_software_hacked_defaced/\" target=\"_blank\" rel=\"noopener\">vBulletin a subi une grave violation de données</a> . L&#39;attaque a conduit à la libération de comptes d&#39;utilisateurs et de clients du forum totalisant près de 519 000 enregistrements. La violation comprenait des adresses e-mail, des dates de naissance, des questions et réponses de sécurité pour les clients et des hachages salés de mots de passe pour les deux sources.","Vedantu2019-07-08":"À la mi-2019, la plate-forme indienne de tutorat interactif en ligne <a href=\"https://www.vedantu.com/\" target=\"_blank\" rel=\"noopener\">Vedantu a</a> subi une violation de données qui a exposé les données personnelles de 687 000 utilisateurs. Le vidage de la base de données au format JSON a exposé de nombreuses informations personnelles, notamment l&#39;adresse e-mail et l&#39;adresse IP, les noms, les numéros de téléphone, les sexes et les mots de passe stockés sous forme de hachage bcrypt. Contacté au sujet de l&#39;incident, Vedantu a indiqué qu&#39;il était au courant de la violation et qu&#39;il était en train d&#39;informer ses clients.","VerificationsIO2019-02-25":"En février 2019, le service de validation d&#39;adresse e-mail <a href=\"https://securitydiscovery.com/800-million-emails-leaked-online-by-email-verification-service\" target=\"_blank\" rel=\"noopener\">verifications.io a subi une violation de données</a> . Découvert par <a href=\"https://twitter.com/mayhemdayone\" target=\"_blank\" rel=\"noopener\">Bob Diachenko</a> et <a href=\"https://twitter.com/vinnytroia\" target=\"_blank\" rel=\"noopener\">Vinny Troia</a> , la violation était due au stockage des données dans une instance MongoDB laissée publiquement sans mot de passe et a entraîné l&#39;exposition de 763 millions d&#39;adresses e-mail uniques. De nombreux enregistrements dans les données comprenaient également des attributs personnels supplémentaires tels que des noms, des numéros de téléphone, des adresses IP, des dates de naissance et des sexes. Aucun mot de passe n&#39;a été inclus dans les données. Le site Web de Vérifications.io a été mis hors ligne pendant le processus de divulgation, bien <a href=\"https://web.archive.org/web/20190227230352/https://verifications.io/\" target=\"_blank\" rel=\"noopener\">qu&#39;une copie archivée reste visible</a> .","Verified2014-01-10":"En janvier 2014, l&#39; <a href=\"http://securityaffairs.co/wordpress/21120/cyber-crime/verified-communities-hacked.html\" target=\"_blank\" rel=\"noopener\">une des plus grandes communautés de cybercriminels d&#39;Europe de l&#39;Est connue sous le nom de « Verified » a été piratée</a> . La violation a exposé près de 17 000 utilisateurs du forum vBulletin, y compris leurs messages personnels et d&#39;autres informations potentiellement personnellement identifiables.","Vianet2020-04-08":"En avril 2020, le fournisseur d&#39;accès internet népalais <a href=\"https://myrepublica.nagariknetwork.com/news/hackers-leak-personal-info-of-vianet-users/\" target=\"_blank\" rel=\"noopener\">Vianet a subi une violation de données</a> . L&#39;attaque contre le FAI a conduit à l&#39;exposition de 177 000 dossiers de clients, dont 94 000 adresses e-mail uniques. Des noms, des numéros de téléphone et des adresses physiques ont également été exposés.","ViewFines2018-05-07":"En mai 2018, le site Web sud-africain de visualisation des amendes routières en ligne connu sous le nom de <a href=\"https://www.iafrikan.com/2018/05/24/south-africas-viewfines-suffered-major-data-leak/\" target=\"_blank\" rel=\"noopener\">ViewFines a subi une violation de données</a> . Plus de 934 000 enregistrements contenant 778 000 adresses e-mail uniques ont été exposés et comprenaient des noms, des numéros de téléphone, des identifiants émis par le gouvernement et des mots de passe stockés en texte brut.","VK2012-01-01":"Vers 2012, le site de médias sociaux russe connu sous le nom de <a href=\"http://motherboard.vice.com/read/another-day-another-hack-100-million-accounts-for-vk-russias-facebook\" target=\"_blank\" rel=\"noopener\">VK a été piraté</a> et près de 100 millions de comptes ont été exposés. Les données ont émergé en juin 2016 où elles étaient vendues via un site Web de marché sombre et comprenaient des noms, des numéros de téléphone, des adresses e-mail et des mots de passe en texte brut.","VNG2015-05-19":"En avril 2018, la <a href=\"https://congnghe.tuoitre.vn/lo-thong-tin-hang-tram-trieu-tai-khoan-khach-hang-vng-xin-loi-20180427225719109.htm\" target=\"_blank\" rel=\"noopener\">nouvelle d&#39;une violation massive de données affectant la société vietnamienne connue sous le nom de VNG a été annoncée</a> après la découverte de données échangées sur un forum de piratage populaire où elles ont été largement redistribuées. La violation remontait à un incident survenu en mai 2015 et concernait plus de 163 millions de clients. Les données de la violation contenaient un large éventail d&#39;attributs personnels, notamment des noms d&#39;utilisateur, des dates de naissance, des sexes et des adresses personnelles, ainsi que des hachages MD5 non salés et 25 millions d&#39;adresses e-mail uniques. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Wanelo2018-12-13":"Vers décembre 2018, le centre commercial numérique <a href=\"https://www.zdnet.com/article/a-hacker-has-dumped-nearly-one-billion-user-records-over-the-past-two-months/\" target=\"_blank\" rel=\"noopener\">Wanelo a subi une violation de données</a> . Les données ont ensuite été mises en vente sur un marché du Web sombre avec une collection d&#39;autres violations de données en avril 2019. Au total, 23 millions d&#39;adresses e-mail uniques ont été incluses dans la violation, ainsi que des mots de passe stockés sous forme de hachages MD5 ou bcrypt. Après le chargement initial de HIBP, d&#39;autres données contenant des noms, des adresses de livraison et des adresses IP ont également été fournies à HIBP, bien que sans association directe avec les adresses e-mail et les mots de passe. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","WarInc2012-07-04":"À la mi-2012, le jeu de stratégie en temps réel <a href=\"http://thewarinc.com\" target=\"_blank\" rel=\"noopener\">War Inc. a</a> subi une violation de données. L&#39;attaque a entraîné l&#39;exposition de plus d&#39;un million de comptes, y compris des noms d&#39;utilisateur, des adresses e-mail et des hachages MD5 de mots de passe salés.","Wattpad2020-06-29":"En juin 2020, le site Web d&#39;histoires générées par les utilisateurs <a href=\"https://www.bleepingcomputer.com/news/security/wattpad-data-breach-exposes-account-info-for-millions-of-users/\" target=\"_blank\" rel=\"noopener\">Wattpad a subi une énorme violation de données qui a exposé près de 270 millions d&#39;enregistrements</a> . Les données ont d&#39;abord été vendues puis publiées sur un forum de piratage public où elles ont été largement partagées. L&#39;incident a révélé de nombreuses informations personnelles, notamment des noms et des noms d&#39;utilisateur, des adresses e-mail et IP, des sexes, des dates de naissance et des mots de passe stockés sous forme de hachage bcrypt.","WeHeartIt2013-11-03":"En novembre 2013, le réseau social d&#39;images<a href=\"http://help.weheartit.com/customer/portal/articles/2889018\" target=\"_blank\" rel=\"noopener\">We Heart It a subi une violation de données</a> . L&#39;incident n&#39;a été découvert qu&#39;en octobre 2017, lorsque 8,6 millions d&#39;enregistrements d&#39;utilisateurs ont été envoyés à HIBP. Les données contenaient des noms d&#39;utilisateur, des adresses e-mail et des hachages de mot de passe, dont 80% étaient salés SHA-256, le reste étant MD5 sans sel.","WedMeGood2021-01-06":"En janvier 2021, la plateforme indienne de planification de mariage <a href=\"https://www.thenewsminute.com/article/wedmegood-and-two-more-sites-hacked-103-crore-users-card-data-leaked-140996\" target=\"_blank\" rel=\"noopener\">WedMeGood a subi une violation de données qui a exposé 1,3 million de clients</a> . La violation a exposé 41,5 Go de données, notamment des adresses e-mail et physiques, des noms, des sexes, des numéros de téléphone et des hachages de mots de passe. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Whitepages2016-06-27":"À la mi-2016, le service d&#39;annuaire téléphonique et d&#39;adresses <a href=\"https://www.theregister.co.uk/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">Whitepages figurait parmi une série de sites violés et leurs données ont ensuite été vendues début 2019</a> . Les données comprenaient plus de 11 millions d&#39;adresses e-mail uniques ainsi que des noms et des mots de passe stockés sous forme de hachage SHA-1 ou bcrypt. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;BenjaminBlue@exploit.im&quot;.","WHMCS2012-05-21":"En mai 2012, la société d&#39;hébergement Web, de facturation et d&#39;automatisation <a href=\"http://news.softpedia.com/news/UGNazi-Leaks-1-7-GB-of-Data-from-WHMCS-Servers-270914.shtml\" target=\"_blank\" rel=\"noopener\">WHMCS a subi une violation de données</a> qui a exposé 134 000 adresses e-mail. La violation comprenait des informations détaillées sur les clients et les historiques de paiement, y compris des numéros de carte de crédit partiels.","Win7Vista2013-09-03":"En septembre 2013, le <a href=\"http://www.win7vista.com\" target=\"_blank\" rel=\"noopener\">forum Windows de Win7Vista</a> (renommé depuis le forum &quot;Au-delà de Windows 9&quot;) a été piraté et <a href=\"http://leak.sx/thread-186933\" target=\"_blank\" rel=\"noopener\">sa base de données interne a ensuite été vidé</a> . Le dump comprenait plus de 200 000 informations personnelles de membres et d&#39;autres données internes extraites du forum.","Wishbone2016-08-07":"En août 2016, l&#39;application mobile pour « comparer n&#39;importe quoi » connue sous le nom de <a href=\"https://motherboard.vice.com/en_us/article/popular-teen-quiz-app-wishbone-has-been-hacked-exposing-tons-of-user-information\" target=\"_blank\" rel=\"noopener\">Wishbone a subi une violation de données</a> . Les données contenaient 9,4 millions d&#39;enregistrements avec 2,2 millions d&#39;adresses e-mail uniques et constituaient prétendument un sous-ensemble de l&#39;ensemble de données complet. Les données exposées comprenaient le sexe, les dates de naissance, les adresses e-mail et les numéros de téléphone d&#39;un public majoritairement composé d&#39;adolescents et de jeunes adultes.","Wishbone20202020-01-27":"En janvier 2020, l&#39;application mobile pour &quot;comparer n&#39;importe quoi&quot; <a href=\"https://www.infosecurity-magazine.com/news/wishbone-breach-40-million-records/\" target=\"_blank\" rel=\"noopener\">Wishbone a subi une autre violation de données</a> qui a suivi leur violation de 2016. Une quantité importante d&#39;informations personnelles, y compris près de 10 millions d&#39;adresses e-mail uniques ainsi que des noms, des numéros de téléphone, des emplacements géographiques et d&#39;autres attributs personnels ont été divulgués en ligne. et largement redistribué. Les mots de passe stockés sous forme de hachages MD5 non salés ont également été inclus dans la violation. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;All3in&quot;.","WiziShop2020-07-14":"En juillet 2020, la plateforme de commerce électronique française <a href=\"https://www.wizishop.fr/\" target=\"_blank\" rel=\"noopener\">WiziShop a</a> subi une violation de données. La violation a exposé 18 Go de données, notamment des noms, des numéros de téléphone, des dates de naissance, des adresses physiques et IP, des hachages de mots de passe SHA-1 et près de 3 millions d&#39;adresses e-mail uniques. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;pompompurin@riseup.net&quot;.","Wongnai2020-10-28":"En octobre 2020, <a href=\"https://www.bleepingcomputer.com/news/security/hacker-is-selling-34-million-user-records-stolen-from-17-companies/\" target=\"_blank\" rel=\"noopener\">17 violations de données non divulguées auparavant sont apparues à la vente,</a> notamment le service de recherche de restaurants, d&#39;hôtels et d&#39;attractions thaïlandais, Wongnai. La violation a exposé près de 4 millions d&#39;enregistrements clients uniques à un moment donné en 2020, ainsi que des noms, des numéros de téléphone, des liens vers des profils de réseaux sociaux et des mots de passe stockés sous forme de hachages MD5. Les données ont été auto-soumises à HIBP par Wongnai.","Xbox-Scene2015-02-01":"Vers février 2015, le forum Xbox connu sous le nom de <a href=\"http://xboxscene.com/\" target=\"_blank\" rel=\"noopener\">Xbox-Scene a</a> été piraté et plus de 432 000 comptes ont été exposés. Le forum IP.Board incluait des adresses IP et des mots de passe stockés sous forme de hachages salés utilisant une implémentation faible permettant à de nombreux d&#39;être rapidement craqués.","Xiaomi2012-08-01":"En août 2012, <a href=\"https://thehackernews.com/2014/10/xiaomi-data-breach-hacker.html\" target=\"_blank\" rel=\"noopener\">le site Web du forum des utilisateurs de Xiaomi a subi une violation de données</a> . Au total, 7 millions d&#39;adresses e-mail sont apparues dans la brèche bien qu&#39;une partie importante d&#39;entre elles étaient des alias numériques sur le domaine bbs_ml_as_uid.xiaomi.com. Les noms d&#39;utilisateur, les adresses IP et les mots de passe stockés sous forme de hachages MD5 salés ont également été exposés. Les données ont été fournies avec le soutien de <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> . <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>","XPGameSaves2016-01-01":"Vers le début de 2016, le site Web de jeux <a href=\"http://www.xpgamesaves.com/\" target=\"_blank\" rel=\"noopener\">Xpgamesaves</a> (XPG) a subi une violation de données entraînant l&#39;exposition de 890 000 enregistrements d&#39;utilisateurs uniques. Les données contenaient des adresses e-mail et IP, des noms d&#39;utilisateur et des hachages MD5 de mots de passe salés. Le site a déjà été signalé comme compromis dans le répertoire de la base de données violée <a href=\"https://vigilante.pw/\" target=\"_blank\" rel=\"noopener\">Vigilante.pw.</a> Ces données ont été fournies par Adam Davies, chercheur en sécurité et analyste de données.","XSplit2013-11-07":"En novembre 2013, le fabricant du logiciel de diffusion en direct et d&#39;enregistrement de jeux <a href=\"https://www.xsplit.com/blog/xsplit-password-reset-alert\" target=\"_blank\" rel=\"noopener\">XSplit a été compromis lors d&#39;une attaque en ligne</a> . La violation de données a divulgué près de 3 millions de noms, d&#39;adresses e-mail, de noms d&#39;utilisateur et de mots de passe hachés.","Yahoo2012-07-11":"En juillet 2012, Yahoo! a vu son service de publication en ligne « Voices » compromis via une attaque par injection SQL. La violation a entraîné la divulgation de près d&#39;un demi-million de noms d&#39;utilisateur et de mots de passe stockés en texte brut. La violation a montré que parmi les comptes compromis, <a href=\"http://www.troyhunt.com/2012/07/what-do-sony-and-yahoo-have-in-common.html\" target=\"_blank\" rel=\"noopener\">59% des personnes qui avaient également des comptes dans la violation Sony ont réutilisé leurs mots de passe sur les deux services</a> .","Yam2013-06-02":"En juin 2013, le site Web taïwanais<a href=\"https://twitter.com/StillAzureH/status/1383234219153846276\" target=\"_blank\" rel=\"noopener\">Yam.com a subi une violation de données qui a été partagée avec un forum de piratage populaire en 2021</a> . Les données comprenaient 13 millions d&#39;adresses e-mail uniques ainsi que des noms, des noms d&#39;utilisateur, des numéros de téléphone, des adresses physiques, des dates de naissance et des hachages de mot de passe MD5 non salés.","Yatra2013-09-01":"En septembre 2013, le site de réservation indien connu sous le nom de <a href=\"https://www.yatra.com/\" target=\"_blank\" rel=\"noopener\">Yatra</a> avait 5 millions d&#39;enregistrements exposés dans une violation de données. Les données contenaient des adresses e-mail et physiques, des dates de naissance et des numéros de téléphone, ainsi que des codes PIN et des mots de passe stockés en texte brut. Le site a déjà été signalé comme compromis dans le répertoire de la base de données violée <a href=\"https://vigilante.pw/\" target=\"_blank\" rel=\"noopener\">Vigilante.pw.</a>","YoteprestoCom2020-06-22":"En juin 2020, la plateforme de prêt mexicaine <a href=\"https://newsbeezer.com/mexicoeng/yotepresto-has-disclosed-the-emails-and-passwords-of-all-1-4-million-customers/\" target=\"_blank\" rel=\"noopener\">yotepresto.com a subi une violation de données</a> . Plus de 1,4 million de clients ont été touchés par la violation qui a divulgué des adresses e-mail et IP, des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Youku2016-12-01":"Fin 2016, le service de vidéo en ligne chinois <a href=\"http://www.youku.com\" target=\"_blank\" rel=\"noopener\">Youku a</a> subi une violation de données. L&#39;incident a révélé 92 millions de comptes d&#39;utilisateurs uniques et les hachages de mot de passe MD5 correspondants. Les données ont été fournies à Have I Been Pwned avec l&#39;aimable autorisation de rip@creep.im.","YouNow2019-02-15":"En février 2019, les <a href=\"https://techcrunch.com/2019/02/14/hacker-strikes-again/\" target=\"_blank\" rel=\"noopener\">données du service de diffusion en direct YouNow sont apparues à la vente sur un marché du dark web</a> . Bien qu&#39;il ne soit pas clair à quelle date la violation réelle s&#39;est produite, les données concernées comprenaient 18 millions d&#39;adresses e-mail uniques, adresses IP, noms, noms d&#39;utilisateur et liens vers des profils de réseaux sociaux. Comme l&#39;authentification est effectuée via des fournisseurs sociaux, aucun mot de passe n&#39;a été exposé lors de la violation. De nombreux enregistrements n&#39;avaient pas d&#39;adresses e-mail associées, le numéro unique est donc inférieur au nombre total de comptes déclaré. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","YouveBeenScraped2018-10-05":"En octobre et novembre 2018, le <a href=\"https://blog.hackenproof.com/industry-news/new-report-unknown-data-scraper-breach/\" target=\"_blank\" rel=\"noopener\">chercheur en sécurité Bob Diachenko a identifié plusieurs instances MongoDB non protégées qui seraient hébergées par un agrégateur de données</a> . Contenant un total de plus de 66 millions d&#39;enregistrements, le propriétaire des données n&#39;a pas pu être identifié, mais on pense qu&#39;il a été supprimé de LinkedIn, d&#39;où le titre &quot;You&#39;ve Been Scraped&quot;. Les enregistrements exposés comprenaient des noms, des adresses e-mail professionnelles et personnelles, des titres de poste et des liens vers les profils LinkedIn des individus.","Zomato2017-05-17":"En mai 2017, le site Web du guide des restaurants <a href=\"https://www.hackread.com/zomato-hacked-17-million-accounts-sold-on-dark-web/\" target=\"_blank\" rel=\"noopener\">Zomato a été piraté,</a> entraînant l&#39;exposition de près de 17 millions de comptes. Les données ont donc été redistribuées en ligne et contiennent des adresses e-mail, des noms d&#39;utilisateur et des hachages MD5 salés des mots de passe (le hachage du mot de passe n&#39;était pas présent sur tous les comptes). Ces données ont été fournies à HIBP par Adam Davies, chercheur en sécurité Whitehat et analyste de données.","Zoomcar2018-07-01":"En juillet 2018, la société indienne de location de voitures sans <a href=\"https://tech.economictimes.indiatimes.com/news/internet/data-of-3-5-million-zoomcar-customers-up-for-sale/75896086\" target=\"_blank\" rel=\"noopener\">chauffeur Zoomcar a subi une violation de données qui a ensuite été vendue sur un marché du dark web en 2020</a> . La violation a exposé plus de 3,5 millions d&#39;enregistrements, notamment des noms, des adresses e-mail et IP, des numéros de téléphone et des mots de passe stockés sous forme de hachage bcrypt. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Zynga2019-09-01":"En septembre 2019, le développeur de jeux <a href=\"https://www.cnet.com/news/words-with-friends-hack-reportedly-exposes-data-of-more-than-200m-players/\" target=\"_blank\" rel=\"noopener\">Zynga (le créateur de Words with Friends) a subi une violation de données</a> . L&#39;incident a révélé 173 millions d&#39;adresses e-mail uniques ainsi que des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachage SHA-1 salé. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","Parapa2016-08-08":"En août 2016, <a href=\"http://www.zdnet.com/article/over-25-million-accounts-stolen-after-mail-ru-forums-raided-by-hackers/\" target=\"_blank\" rel=\"noopener\">le site de jeu russe connu sous le nom de Пара Па (ou parapa.mail.ru) a été piraté</a> ainsi qu&#39;un certain nombre d&#39;autres forums sur le fournisseur de messagerie russe, mail.ru. Le forum vBulletin contenait 4,9 millions de comptes, y compris des noms d&#39;utilisateur, des adresses e-mail et des mots de passe stockés sous forme de hachage MD5 salé.","DecoratingTheHouse2020-03-27":"En mars 2020, le site de décoration d&#39;intérieur coréen <a href=\"https://www.bleepingcomputer.com/news/security/hacker-leaks-386-million-user-records-from-18-companies-for-free/\" target=\"_blank\" rel=\"noopener\">???? (Decorating the House) a subi une violation de données</a> qui a touché près de 1,3 million de membres. Servies via l&#39;URL <a href=\"https://www.ggumim.co.kr/\" target=\"_blank\" rel=\"noopener\">ggumim.co.kr</a> , les données exposées comprenaient des adresses e-mail, des noms, des noms d&#39;utilisateur et des numéros de téléphone, qui ont ensuite été largement partagés dans les communautés de piratage en ligne. Les données ont été fournies à HIBP par <a href=\"https://breachbase.pw/\" target=\"_blank\" rel=\"noopener\">violationbase.pw</a> .","AtlasQuantum2018-08-25":"En août 2018, la plateforme d&#39;investissement en crypto-monnaie <a href=\"https://www.facebook.com/notes/atlas-quantum/comunicado-importante/2196456297259749/\" target=\"_blank\" rel=\"noopener\">Atlas Quantum a subi une violation de données</a> . La violation a divulgué les données personnelles de 261 000 investisseurs sur la plate-forme, y compris leurs noms, numéros de téléphone, adresses e-mail et soldes de compte.","BTSec2014-01-09":"En septembre 2014, un gros vidage de près de 5 millions de noms d&#39;utilisateur et de mots de passe a été <a href=\"https://forum.btcsec.com/index.php?/topic/9426-gmail-meniai-parol/\" target=\"_blank\" rel=\"noopener\">publié sur un forum Bitcoin russe</a> . Bien qu&#39;il soit couramment signalé comme 5 millions de &quot;mots de passe Gmail&quot;, le vidage contenait également 123 000 adresses yandex.ru. Bien que l&#39;origine de la violation reste incertaine, les informations d&#39;identification violées ont été <a href=\"http://web.archive.org/web/20140910190920/http://www.reddit.com/r/netsec/comments/2fz13q/5_millions_of_gmail_passwords_leaked_rus_most/\" target=\"_blank\" rel=\"noopener\">confirmées par plusieurs sources comme étant correctes</a> , bien qu&#39;elles datent de plusieurs années.","Chowbus2020-10-05":"En octobre 2020, l&#39;application de livraison de nourriture asiatique <a href=\"https://www.reddit.com/r/UIUC/comments/j5fcjp/chowbus_is_hacked_leaks_800000_entries_of/\" target=\"_blank\" rel=\"noopener\">Chowbus a subi une violation de données qui a entraîné l&#39;</a> envoi de plus de 800 000 enregistrements par courrier électronique aux clients. L&#39;e-mail contenait un lien vers un fichier CSV contenant des données client, notamment des adresses physiques, des noms, des numéros de téléphone et plus de 444 000 adresses e-mail uniques.","Edmodo2017-05-11":"En mai 2017, la plate-forme éducative <a href=\"https://motherboard.vice.com/en_us/article/hacker-steals-millions-of-user-account-details-from-education-platform-edmodo\" target=\"_blank\" rel=\"noopener\">Edmodo a été piratée,</a> ce qui a entraîné l&#39;exposition de 77 millions d&#39;enregistrements comprenant plus de 43 millions d&#39;adresses e-mail de clients uniques. Les données ont par conséquent été publiées sur un forum de piratage populaire et mises à disposition gratuitement. Les enregistrements de la violation comprenaient des noms d&#39;utilisateur, des adresses e-mail et des hachages bcrypt de mots de passe.","Evite2013-08-11":"En avril 2019, le site de planification sociale pour la gestion des invitations en ligne <a href=\"https://www.evite.com/security/update?usource=lc&lctid=1800182\" target=\"_blank\" rel=\"noopener\">Evite a identifié une violation de données de leurs systèmes</a> . Après enquête, ils ont découvert un accès non autorisé à une archive de base de données remontant à 2013. Les données exposées comprenaient un total de 101 millions d&#39;adresses e-mail uniques, la plupart appartenant à des destinataires d&#39;invitations. Les membres du service avaient également des noms, des numéros de téléphone, des adresses physiques, des dates de naissance, des sexes et des mots de passe stockés en texte clair exposés. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;JimScott.Sec@protonmail.com&quot;.","Fotolog2018-12-01":"En décembre 2018, le réseau social de partage de photos <a href=\"https://www.theregister.com/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">Fotolog a subi une violation de données</a> qui a exposé 16,7 millions d&#39;adresses e-mail uniques. Les données comprenaient également des noms d&#39;utilisateur et des hachages de mot de passe SHA-256 non salés. Le site a été dissous l&#39;année suivante et reconverti en un site d&#39;information basé à Brcko, en Bosnie-Herzégovine.","iDressup2016-07-15":"En juin 2016, le site social pour adolescents connu sous le nom d&#39; <a href=\"http://arstechnica.com/security/2016/09/social-hangout-site-for-teens-leaks-millions-of-plaintext-passwords/\" target=\"_blank\" rel=\"noopener\">i-Dressup a été piraté</a> et plus de 2 millions de comptes d&#39;utilisateurs ont été exposés. Au moment où le piratage a été signalé, les opérateurs d&#39;i-Dressup n&#39;étaient pas joignables et la faille d&#39;injection SQL sous-jacente est restée ouverte, exposant prétendument un total de 5,5 millions de comptes. La violation comprenait des adresses e-mail et des mots de passe stockés en texte brut.","Minehut2019-05-17":"En mai 2019, le site Web du serveur Minecraft <a href=\"https://minehut.com/\" target=\"_blank\" rel=\"noopener\">Minehut a</a> subi une violation de données. La société a indiqué qu&#39;une sauvegarde de la base de données avait été obtenue, après quoi elle a par la suite notifié tous les utilisateurs concernés. 397 000 adresses e-mail de l&#39;incident ont été fournies à HIBP. Un ensemble de données contenant à la fois des adresses e-mail et des hachages de mot de passe bcrypt a également été fourni ultérieurement à HIBP.","PSPISO2015-09-25":"Vers septembre 2015, le forum PlayStation PSP connu sous le nom de <a href=\"http://www.pspiso.com\" target=\"_blank\" rel=\"noopener\">PSP ISO a</a> été piraté et près de 1,3 million de comptes ont été exposés. En plus des adresses e-mail et IP, le forum vBulletin a également exposé des hachages de mot de passe MD5 salés.","HalloweenSpot2019-09-27":"En septembre 2019, le magasin de costumes d&#39; <a href=\"https://www.thehalloweenspot.com/\" target=\"_blank\" rel=\"noopener\">Halloween The Halloween Spot a</a> subi une violation de données. Initialement attribuée à tort au magasin de déguisements <a href=\"https://www.smiffys.com/\" target=\"_blank\" rel=\"noopener\">Smiffys</a> , la violation contenait 13 Go de données avec plus de 10 000 adresses e-mail uniques, ainsi que des noms, des adresses physiques et IP, des numéros de téléphone et des historiques de commandes. Le Spot d&#39;Halloween a informé les clients que la violation était liée à &quot;une ancienne base de données d&#39;informations sur les expéditions&quot;.","xat2015-11-04":"En novembre 2015, la salle de discussion en ligne connue sous le nom de <a href=\"http://xat.com/databreach.html\" target=\"_blank\" rel=\"noopener\">&quot;xat&quot; a été piratée</a> et 6 millions de comptes d&#39;utilisateurs ont été exposés. Utilisées comme moteur de discussion sur les sites Web, les données divulguées comprenaient des noms d&#39;utilisateur, des adresses e-mail et IP ainsi que des mots de passe hachés.","AgusiQTorrents2019-09-24":"En septembre 2019, le site torrent polonais <a href=\"http://agusiq-torrents.pl/\" target=\"_blank\" rel=\"noopener\">AgusiQ-Torrents.pl a</a> subi une violation de données. L&#39;incident a exposé 90 000 enregistrements de membres, notamment des adresses e-mail et IP, des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachages MD5.","BotOfLegends2014-11-13":"En novembre 2014, le forum de <a href=\"http://botoflegends.com\" target=\"_blank\" rel=\"noopener\">Bot of Legends a</a> subi une violation de données. Le forum IP.Board contenait 238 000 comptes, y compris les noms d&#39;utilisateur, les adresses e-mail et IP et les mots de passe stockés sous forme de hachage MD5 salé.","Boxee2014-03-29":"En mars 2014, le fabricant de logiciels pour PC de cinéma maison Boxee a vu ses forums compromis lors d&#39;une attaque. Les attaquants ont obtenu l&#39;intégralité de la base de données MySQL vBulletin et l&#39;ont rapidement publiée pour téléchargement sur le forum Boxee lui-même. Les données comprenaient 160 000 utilisateurs, des historiques de mots de passe, des messages privés et diverses autres données exposées dans près de 200 tables exposées publiquement.","EpicNPC2016-01-02":"En janvier 2016, le revendeur de comptes piratés <a href=\"https://www.epicnpc.com\" target=\"_blank\" rel=\"noopener\">EpicNPC a</a> subi une violation de données qui a touché 409 000 abonnés. Les données impactées comprenaient les noms d&#39;utilisateur, les adresses IP et e-mail et les mots de passe stockés sous forme de hachages MD5 salés. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","GamerzPlanet2015-10-23":"Vers octobre 2015, le forum de jeux en ligne connu sous le nom de <a href=\"http://gamerzplanet.net\" target=\"_blank\" rel=\"noopener\">Gamerzplanet a</a> été piraté et plus de 1,2 million de comptes ont été exposés. Le forum vBulletin incluait des adresses IP et des mots de passe stockés sous forme de hachages salés à l&#39;aide d&#39;une implémentation faible permettant à de nombreux d&#39;être rapidement craqués.","Gamigo2012-03-01":"En mars 2012, l&#39;éditeur allemand de jeux en ligne Gamigo a <a href=\"http://www.zdnet.com/article/8-24-million-gamigo-passwords-leaked-after-hack/\" target=\"_blank\" rel=\"noopener\">été piraté</a> et plus de 8 millions de comptes ont été divulgués publiquement. La violation comprenait des adresses e-mail et des mots de passe stockés sous forme de hachages MD5 faibles sans sel.","HeroesOfGaia2013-01-04":"Début 2013, le jeu multijoueur fantastique en ligne <a href=\"http://hog.playsnail.com\" target=\"_blank\" rel=\"noopener\">Heroes of Gaia a</a> subi une violation de données. Les enregistrements les plus récents de l&#39;ensemble de données indiquent une date de violation du 4 janvier 2013 et incluent des noms d&#39;utilisateur, des adresses IP et des adresses e-mail, mais aucun mot de passe.","Insanelyi2014-07-22":"En juillet 2014, le forum iOS <a href=\"http://insanelyi.com\" target=\"_blank\" rel=\"noopener\">Insanelyi a</a> été <a href=\"http://securityaffairs.co/wordpress/26835/hacking/hacked-bigboss-cydia.html?utm_content=bufferc7e16\" target=\"_blank\" rel=\"noopener\">piraté par un attaquant connu sous le nom de Kim Jong-Cracks</a> . Source d&#39;informations populaire pour les utilisateurs d&#39;appareils iOS jailbreakés exécutant Cydia, la brèche Insanelyi a révélé plus de 104 000 adresses e-mail d&#39;utilisateurs, noms d&#39;utilisateur et mots de passe faiblement hachés (MD5 salé).","Knuddels2018-09-05":"En septembre 2018, le site de médias sociaux allemand <a href=\"https://forum.knuddels.de/ubbthreads.php?ubb=showflat&Number=2916081\" target=\"_blank\" rel=\"noopener\">Knuddels a subi une violation de données</a> . L&#39;incident a révélé 808 000 adresses e-mail uniques, ainsi que les noms d&#39;utilisateur, les vrais noms, la ville de la personne et son mot de passe en clair. Knuddels a <a href=\"https://blog.avira.com/german-flirting-network-gets-fined-20000e-for-leaking-user-information/\" target=\"_blank\" rel=\"noopener\">ensuite été condamné à une amende de 20 000 € pour cette violation</a> .","LyricsMania2017-12-21":"En décembre 2017, le site Web de paroles de chansons connu sous le nom de <a href=\"https://www.lyricsmania.com/\" target=\"_blank\" rel=\"noopener\">Lyrics Mania a</a> subi une violation de données. Les données de la violation comprenaient 109 000 noms d&#39;utilisateur, adresses e-mail et mots de passe en texte brut. <a href=\"https://www.troyhunt.com/streamlining-data-breach-disclosure-a-step-by-step-process\" target=\"_blank\" rel=\"noopener\">De nombreuses tentatives ont été faites pour contacter Lyrics Mania au sujet de l&#39;incident</a> , mais aucune réponse n&#39;a été reçue.","MinecraftPocketEditionForum2015-05-24":"En mai 2015, le <a href=\"http://www.databreaches.net/minecraft-pocket-edition-forum-hacked-dumped/\" target=\"_blank\" rel=\"noopener\">forum Minecraft Pocket Edition a été piraté</a> et plus de 16 000 comptes ont été rendus publics. Prétendument piraté par <a href=\"https://twitter.com/rmsg0d\" target=\"_blank\" rel=\"noopener\">@rmsg0d</a> , les données du forum comprenaient de nombreuses données personnelles pour chaque utilisateur. Le forum a par la suite été désaffecté.","MoneyBookers2009-01-01":"En 2009, le service de portefeuille électronique connu sous le nom de Money Bookers a <a href=\"http://www.forbes.com/sites/thomasbrewster/2015/11/30/paysafe-optimal-neteller-moneybookers-gambling-cyberattacks-data-breach/\" target=\"_blank\" rel=\"noopener\">subi une violation de données qui a exposé près de 4,5 millions de clients</a> . Désormais appelée Skrill, la brèche n&#39;a été découverte qu&#39;en octobre 2015 et comprenait des noms, des adresses e-mail, des adresses personnelles et des adresses IP.","PixelFederation2013-12-04":"En décembre 2013, une <a href=\"http://www.cyberwarnews.info/2013/12/04/pixel-federation-hacked-38000-user-credentials-leaked\" target=\"_blank\" rel=\"noopener\">brèche dans la communauté des jeux en ligne basée en Slovaquie a</a> révélé plus de 38 000 comptes qui ont été rapidement mis en ligne. La violation comprenait des adresses e-mail et des mots de passe hachés MD5 non salés, dont beaucoup ont été facilement reconvertis en texte brut.","Plex2015-07-02":"En juillet 2015, le forum de discussion du centre multimédia Plex a <a href=\"https://blog.plex.tv/2015/07/02/security-notice-forum-user-password-resets\" target=\"_blank\" rel=\"noopener\">été piraté et plus de 327 000 comptes ont été exposés</a> . Le forum IP.Board incluait des adresses IP et des mots de passe stockés sous forme de hachages salés utilisant une implémentation faible permettant à de nombreux d&#39;être rapidement craqués.","StarNet2015-02-26":"En février 2015, le FAI moldave &quot;StarNet&quot; <a href=\"http://www.moldova.org/the-database-of-an-internet-provider-from-moldova-was-stolen-and-published/\" target=\"_blank\" rel=\"noopener\">a fait publier sa base de données en ligne</a> . Le dépotoir comprenait près de 140 000 adresses e-mail, dont beaucoup contenaient des informations personnelles, notamment des informations de contact, les modèles d&#39;utilisation du FAI et même des numéros de passeport.","TorrentInvites2013-12-12":"En décembre 2013, le site torrent <a href=\"https://www.reddit.com/r/trackers/comments/1sqqf7/torrentinvites_hacked/\" target=\"_blank\" rel=\"noopener\">Torrent Invites a été piraté</a> et plus de 352 000 comptes ont été exposés. Le forum vBulletin contenait des noms d&#39;utilisateur, des adresses e-mail et IP, des dates de naissance et des hachages MD5 salés de mots de passe.","VoidTO2019-06-13":"En juin 2019, le site de piratage <a href=\"https://void.to/\" target=\"_blank\" rel=\"noopener\">Void.to a</a> subi une violation de données. Il y avait 95 000 adresses e-mail uniques réparties sur 86 000 utilisateurs du forum et d&#39;autres tables dans la base de données. Un site Web de piratage rival a revendiqué la violation du forum basé sur MyBB qui divulguait des adresses e-mail et IP, des noms d&#39;utilisateur, des messages privés et des mots de passe stockés sous forme de hachage MD5 salé ou bcrypt.","Xbox360ISO2015-09-25":"Vers septembre 2015, le forum XBOX 360 connu sous le nom de <a href=\"http://www.xbox360iso.com\" target=\"_blank\" rel=\"noopener\">XBOX360 ISO a</a> été piraté et 1,2 million de comptes ont été exposés. En plus des adresses e-mail et IP, le forum vBulletin a également exposé des hachages de mot de passe MD5 salés.","XKCD2019-07-01":"En juillet 2019, <a href=\"https://forums.xkcd.com/\" target=\"_blank\" rel=\"noopener\">le forum du webcomic XKCD a</a> subi une violation de données qui a touché 562 000 abonnés. Le forum phpBB violé a divulgué des noms d&#39;utilisateur, des adresses e-mail et IP et des mots de passe stockés au format MD5 phpBB3. Les données ont été fournies à HIBP par Adam Davies, chercheur en sécurité et analyste de données à chapeau blanc.","Facebook2019-08-01":"En avril 2021, <a href=\"https://www.bleepingcomputer.com/news/security/533-million-facebook-users-phone-numbers-leaked-on-hacker-forum/\" target=\"_blank\" rel=\"noopener\">un vaste ensemble de données de plus de 500 millions d&#39;utilisateurs de Facebook a été mis gratuitement à disposition en téléchargement</a> . Englobant environ 20 % des abonnés de Facebook, les données auraient été obtenues en exploitant une vulnérabilité que Facebook a rectifiée en août 2019. La valeur principale des données est l&#39;association de numéros de téléphone à des identités ; alors que chaque enregistrement comprenait un téléphone, seulement 2,5 millions contenaient une adresse e-mail. La plupart des documents contenaient des noms et des sexes, dont beaucoup incluaient également les dates de naissance, le lieu, le statut de la relation et l&#39;employeur.","B2BUSABusinesses2017-07-18":"À la mi-2017, une liste de spam de plus de 105 millions de personnes dans les entreprises américaines a été découverte en ligne. Appelée « entreprises B2B USA », la liste classe les adresses e-mail par employeur, fournissant des informations sur les titres de poste des individus ainsi que leurs numéros de téléphone et adresses physiques au travail. <a href=\"https://www.troyhunt.com/have-i-been-pwned-and-spam-lists-of-personal-information\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les listes de spam dans HIBP.</a>","000webhost2015-03-01":"Vers mars 2015, le fournisseur d&#39;hébergement Web gratuit <a href=\"http://www.troyhunt.com/2015/10/breaches-traders-plain-text-passwords.html\" target=\"_blank\" rel=\"noopener\">000webhost a subi une violation de données majeure</a> qui a exposé près de 15 millions d&#39;enregistrements de clients. Les données ont été vendues et échangées avant que 000webhost ne soit alerté en octobre. La violation comprenait des noms, des adresses e-mail et des mots de passe en texte brut.","123RF2020-03-22":"En mars 2020, le site de photos d&#39; <a href=\"https://www.bleepingcomputer.com/news/security/popular-stock-photo-service-hit-by-data-breach-83m-records-for-sale/\" target=\"_blank\" rel=\"noopener\">archives 123RF a subi une violation de données</a> qui a touché plus de 8 millions d&#39;abonnés et a ensuite été vendu en ligne. La violation comprenait des adresses e-mail, IP et physiques, des noms, des numéros de téléphone et des mots de passe stockés sous forme de hachages MD5. Les données ont été fournies à HIBP par <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> .","17Media2016-04-19":"En avril 2016, les données des clients obtenues à partir de l&#39;application de streaming connue sous le nom de « 17 » <a href=\"http://motherboard.vice.com/read/another-day-another-hack-millions-of-user-accounts-for-streaming-app-17\" target=\"_blank\" rel=\"noopener\">sont apparues en vente sur un marché de services cachés Tor</a> . Les données contenaient plus de 4 millions d&#39;adresses e-mail uniques ainsi que des adresses IP, des noms d&#39;utilisateur et des mots de passe stockés sous forme de hachages MD5 non salés.","171732011-12-28":"Fin 2011, <a href=\"https://news.softpedia.com/news/China-Investigates-Hacking-Operations-That-Exposed-100-Million-Users-244312.shtml\" target=\"_blank\" rel=\"noopener\">une série de violations de données en Chine a touché jusqu&#39;à 100 millions d&#39;utilisateurs</a> , dont 7,5 millions du site de jeu connu sous le nom de 17173. Bien qu&#39;il existe des preuves que les données sont légitimes, en raison de la difficulté de vérifier catégoriquement la violation chinoise, il a été signalé comme &quot;non vérifié&quot;. Les données de la violation contiennent des noms d&#39;utilisateur, des adresses e-mail et des hachages de mot de passe MD5 salés et ont été fournies avec le support de <a href=\"https://dehashed.com/\" target=\"_blank\" rel=\"noopener\">dehashed.com</a> . <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>","2844Breaches2018-02-19":"En février 2018, <a href=\"https://www.troyhunt.com/ive-just-added-2844-new-data-breaches-with-80m-records-to-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">une collection massive de près de 3 000 violations présumées de données a été trouvée en ligne</a> . Alors que certaines données avaient déjà été vues dans Have I Been Pwned, 2 844 des fichiers composés de plus de 80 millions d&#39;adresses e-mail uniques n&#39;avaient pas été vus auparavant. Chaque fichier contenait à la fois une adresse e-mail et un mot de passe en texte brut et a donc été chargé comme une seule violation de données « non vérifiée ».","2fast4u2017-12-20":"En décembre 2017, le forum moto belge <a href=\"https://www.2fast4u.be\" target=\"_blank\" rel=\"noopener\">2fast4u a</a> découvert une violation de données de leur système. La violation du babillard vBulletin a touché plus de 17 000 utilisateurs individuels et a exposé des adresses e-mail, des noms d&#39;utilisateur et des mots de passe MD5 salés.","500px2018-07-05":"Mi-2018, la communauté de photographes en ligne <a href=\"https://support.500px.com/hc/en-us/articles/360017752493-Security-Issue-February-2019-FAQ\" target=\"_blank\" rel=\"noopener\">500px a subi une violation de données</a> . L&#39;incident a révélé près de 15 millions d&#39;adresses e-mail uniques, ainsi que des noms, des noms d&#39;utilisateur, des sexes, des dates de naissance et un hachage de mot de passe MD5 ou bcrypt. En 2019, <a href=\"https://www.theregister.co.uk/2019/02/11/620_million_hacked_accounts_dark_web/\" target=\"_blank\" rel=\"noopener\">les données sont apparues en vente sur un marché du Web sombre</a> (avec plusieurs autres violations importantes) et ont ensuite commencé à circuler plus largement. Les données ont été fournies à HIBP par une source qui a demandé qu&#39;elles soient attribuées à &quot;BenjaminBlue@exploit.im&quot;.","7k7k2011-01-01":"Vers 2011, il est allégué que le site de jeux chinois connu sous le nom de <a href=\"http://www.7k7k.com\" target=\"_blank\" rel=\"noopener\">7k7k a</a> subi une violation de données qui a touché 9,1 millions d&#39;abonnés. Bien qu&#39;il existe des preuves que les données sont légitimes, en raison de la difficulté de vérifier catégoriquement la violation chinoise, elles ont été signalées comme « non vérifiées ». Les données de la violation contiennent des noms d&#39;utilisateur, des adresses e-mail et des mots de passe en texte brut. <a href=\"https://www.troyhunt.com/handling-chinese-data-breaches-in-have-i-been-pwned/\" target=\"_blank\" rel=\"noopener\">En savoir plus sur les violations de données chinoises dans Have I Been Pwned.</a>"}